{
    "https://v.redd.it/whulscoosqhe1": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\nDemocracy's erosion, concerns it sparks, about the erosion of democracy, concerns it sparks. \nAllowed in, Elon Musk is, while blocked, members of Congress are, from entering the Department of Education, they are.",
        "\"A threat to democracy, under, being, concerns sparking are, while in allowed is Musk, in blocked from entering, are Congress members.\""
    ],
    "https://i.redd.it/10nswlb8fqhe1.png": [
        "A grave mysterious, in forest a photo shared was, by user Reddit a.\nTheories and speculation sparking, about origins and purpose its, were.",
        "A link to a Reddit image, provided is."
    ],
    "https://susanpcrawford.substack.com/p/james-hansen-says-were-underestimating": [
        "A warning, Hansen gives. Underestimated, global warming acceleration is. Rise, sea levels will, in decades few, next. \n\nDouble, greenhouse gas concentrations will be. Normal, new temperature will be, 4.5 degrees C above, pre-industrial times. Rise, sea levels will, significant, an increase. \n\nHappen, it could, as early as 2045. Consequences, catastrophic, for coastal communities, global, will be.",
        "\"A catastrophic consequence for global coastal communities, potentially catastrophic it will be, with rapid sea level rise in the next few decades, leading to it may.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse//r/CollapseSupport/comments/1ik5v5p/how_to_digitally_prepare_for_the_possible/": [
        "\"A technical issue or system failure, preventing access to the intended content, it is. \nInstructing the user to go home, error messages are. \nA series of error messages, the article appears to be.\"",
        "Repeated errors, due to, home go you must, advises the article, it does."
    ],
    "https://www.livescience.com/planet-earth/climate-change/alaskas-ice-is-melting-in-front-of-our-eyes-staggering-satellite-shots-show": [
        "\"Above normal, temperatures 5-10 degrees Fahrenheit, since December 2024, are. \nChange climate, causing is. \nRegions Arctic, refrigerators planetary, to radiators, transforming are. \nStorms stronger and rainfall more, leading to, it is.\"",
        "\"A region's glaciers threatening, the snowpack shrinking is, and temperatures above normal, 5-10 degrees Fahrenheit, with climate change and unusual weather patterns driven, melting of snow and ice, rapid, revealed by satellite images, new, they have.\""
    ],
    "https://i.redd.it/0ext7eb4nqhe1.jpeg": [
        "\"A week next, implemented be it. Plastic, back to, stated he did. Order, executive, an announced Trump did.\"",
        "\"A return to plastic, end paper straws, Executive Order to issue, Trump announces, President.\""
    ],
    "https://i.redd.it/27jgx7rdwphe1.png": [
        "A repetitive sequence of menu options and login prompts, it appears to be. \n\"Comments\" and \"View post\" a section, there is. \n\"Precedented times\" remember you, do? \nA question, it is.",
        "\"Prompts login and options menu sequence repetitive a appears the article, it does.\""
    ],
    "https://www.usatoday.com/story/news/politics/2025/02/07/trump-plastic-straws/78330750007/": [
        "\"A reversal of the phase-out, plans Trump to sign, he does. \nStraws of paper, don't work, claims Trump. \nBiden's efforts, to phase out single-use plastic straws, reversing, Trump will.\"",
        "\"A return to plastic straws, plans President Donald Trump to sign, an executive order to ditch paper straws, he will.\""
    ],
    "https://i.redd.it/ok38e62q9rhe1.jpeg": [
        "A concerning trend in Project 2025, marking it is. \nAgainst him, no Republicans voted, and for him, no Democrats voted.",
        "\"A Director of the OMB, Russell Vought, confirm to voted no Democrats, against him voted no Republicans.\""
    ],
    "https://thenewsglobe.net/?p=8451": [
        "A threat to workers' rights and privacy, DOGE's demand for access posed. \nSystems of DOL, threatened by DOGE's access, they were. \nA lawsuit, filed by federal employee unions, it was. \nMisuse or tamper with records, DOGE could, a concern it was. \nBlocked, DOGE's access to DOL data, a federal judge has.",
        "\"Citing concerns that DOGE could misuse or tamper with worker-related records, a federal judge temporarily blocked DOGE from accessing sensitive Department of Labor data, Musk's Elon did.\""
    ],
    "https://www.smithsonianmag.com/smart-news/the-human-brain-may-contain-as-much-as-a-spoons-worth-of-microplastics-new-research-suggests-180985995/": [
        "\"A spoon's worth of microplastics, in the human brain, may be contained, suggests a new study. \n2024 and 2016, between, 50% more, increasing concentrations are.\"",
        "\"A spoon's worth of microplastics, as much as the human brain may contain, suggests a new study.\""
    ],
    "https://v.redd.it/41feivsi7qhe1": [
        "A plan to cause economic pain, Republicans are planning, to Americans, particularly in rural areas and on government benefits, they are. \nBenefit billionaires, they will, and the common man, they will strip away regulations from. \nA warning, some users are giving, to \"milk the common dry\", they are. \nThe Gilded Era, a comparison, some users are making, they are. \nDisproportionately affect women, this plan will, who financial independence, only recently gained, they have.",
        "\"A benefit to billionaires, may be, and harm to vulnerable groups, it will cause, say users on r/economicCollapse, they do.\""
    ],
    "https://i.redd.it/68k1o0lbrqhe1.png": [
        "A repetition of navigation options, provided text appears to be. \nCollapse, knowledge of, cope with how to, discusses the article.",
        "\"A collapse's knowledge, cope with how to, discusses the article.\""
    ],
    "https://i.redd.it/uiekt4axurhe1.gif": [
        "A series of repetitive menu options and login prompts, it appears to be. \nMention of \"The Way of Murica\", there is. \nOn a post, comments/views, there are.",
        "\"A repetitive sequence of social media navigation options, appears to be the article, it does.\""
    ],
    "https://www.bbc.com/news/videos/cevep790e3vo": [
        "A depot nearby, from chemical waste or textile dye dumping, source of contamination may be. \nSamples taking, authorities are, to determine cause of alarm, they must. \nRed, bright, turned, waterway in suburb of Buenos Aires, Argentina, it did.",
        "\"A source of contamination, determine to, samples taking are authorities, alarming locals, red bright turned waterway a, Thursday on.\""
    ],
    "https://i.redd.it/968qsjr5yrhe1.jpeg": [
        "A call to action, \"hold the line\" there is. \nCollapse economic, a headline or post it appears to be. \nComments and full post, view link there is.",
        "\"A navigation menu for an online platform, it appears to be, with log in or get the app, calls to action repeated, there are.\""
    ],
    "https://www.theguardian.com/theguardian/2008/mar/01/scienceofclimatechange.climatechange?gusrc=r": [
        "A catastrophe, inevitable it is. \nPassed the tipping point, global warming has. \nDeluded fantasies, eco ideas are. \nMake a difference, they won't. \nNorm, extreme weather will be by 2020. \nGlobal devastation, it will cause. \nUnderwater, parts of London will be by 2040. \nSaharan, much of Europe will be.",
        "\"Inevitable, catastrophe is, making adjustments ineffective, individual lifestyle. Passed the tipping point, global warming has, believes Lovelock, James.\""
    ],
    "https://www.theguardian.com/environment/2025/feb/06/its-not-just-a-few-ships-doing-it-how-the-worlds-plastic-ends-up-on-a-guernsey-beach": [
        "A problem with plastic waste, deal with it the IMO seeks. \nReference by the IMO, Lord's collection has been. \nDiscussions international, about plastic waste informed it is. \nFrom around the world, hundreds of types of plastic waste, Lord's collection includes. \nShipping lanes of the Channel, from merchant ships, the majority comes. \nBeaches of the island, wash up on them, plastic waste does. \nLed by Lord, a group of beachcombers, Guernsey's beaches they are collecting.",
        "Informing international discussions about plastic waste, their work is. From merchant ships using the Channel's shipping lanes, believed to come from it is."
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse//r/CollapseSupport/comments/1ijpc2q/what_do_i_do_to_cope_and_enjoy_the_time_i_have/": [
        "\"A technical issue or system failure, preventing access to the intended content, it is. \nInstructing the user to go home, error messages are. \nA series of error messages, the article appears to be.\"",
        "Repeated errors, due to, home go you must, advises the article, it does."
    ],
    "https://www.theguardian.com/us-news/2025/feb/06/trump-musk-support-poll": [
        "A summary, rewritten in the style of Yoda, I shall:\n\nInvestigation, demand senior Democrats, they are. \nBreach of national security, potential, created by Musk's takeover, it has. \nAgencies, federal, through \"department of government efficiency\" (Doge), Musk has taken over. \nClassified information and data, sensitive, accessed illegally, Musk and his operatives have. \nOffice of personnel management, US treasury, and US Agency for International Development, affected, they are. \nPayment system, US treasury's, access, limited, a judge has. \nUpset, some Republicans, becoming, they are. \nPoll, new, suggests, it does. \nInfluence in Trump administration, Musk, have, 26% of Republicans, want, they do.",
        "\"A takeover of certain federal agencies through his self-styled 'department of government efficiency' (Doge), by Elon Musk's, created potential national security breaches, an investigation into, demanding are Senior Democrats.\""
    ],
    "https://www.bloomberg.com/news/articles/2025-02-07/trump-tax-cuts-cost-estimated-at-5-trillion-to-11-trillion": [
        "A robot not, verify you must. \nNetwork activity unusual, detected Bloomberg has. \nCookies and JavaScript, blocking or not supporting, the issue may be. \nReview Terms of Service and Cookie Policy, you should.",
        "\"A request for verification, Bloomberg's website is making. Continue, it will not, without verification, unusual activity detected, it has.\""
    ],
    "https://www.ynetnews.com/business/article/hksw6cztjx": [
        "A breakthrough in dairy production, revolutionize it could. \nPotatoes genetically engineered, containing cow-milk protein, developed has Finally Foods. \nIn southern Israel near Gaza, a field trial launch, its first will. \nThe Kitchen food-tech incubator, part of Strauss Group, is.",
        "\"A breakthrough that could revolutionize dairy production, developed is. Potatoes containing cow-milk protein, genetically engineered, has Finally Foods, an Israeli startup.\""
    ],
    "https://www.news10.com/news/west-virginia-leads-22-states-suing-over-new-york-climate-change-superfund-act/": [
        "A law, unconstitutional, West Virginia argues it is. \nCompanies out-of-state, unfairly penalized, they are. \nDisrupting commerce, the law does. \nBetween states, trade, it hinders. \nFossil fuel emissions, companies pay for, they must. \nGreenhouse gases, a billion metric tons, released, they did. \nBetween 2000 and 2018, the damage, it was done. \nGlobal emissions, used, the calculation is.",
        "\"A law unfairly charges out-of-state companies for emissions beyond their control and disrupts commerce between states, New York's Climate Change Superfund Act does, West Virginia argues.\""
    ],
    "https://i.redd.it/5po7du6b1rhe1.jpeg": [
        "A post on social media, it is. \nFollow the Constitution, America must. \nCollapse economic, a focus it has.",
        "\"Again follow the Constitution, America must, collapse economic and need for it, the article discusses.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse//r/economicCollapse/comments/1ijxk4p/our_current_president_is_a_pawn_for_the_techno/": [
        "\"A technical issue or system failure, preventing access to the intended content, it is. \nInstructing the user to go home, error messages are. \nA series of error messages, the article appears to be.\"",
        "Repeated errors, due to, home go you must, advises the article, it does."
    ],
    "https://i.redd.it/3hp7y8x1zshe1.jpeg": [
        "\"A webpage or social media post, appears to be the article. \nTitle 'America under Musk and Trump', has. \nCategory 'economicCollapse', it is. \nContent, not provided, it is.\"",
        "\"A collapse economic of America under Trump and Musk, leadership of, discusses the article.\""
    ],
    "https://i.redd.it/k6bj1yq3lthe1.jpeg": [
        "A repetitive sequence of menu options and login prompts, it appears to be. \n\"Never thought the end of times would look like this\" a cryptic phrase, it is. \nA call to view a post or comment, there is.",
        "\"A repetitive and humorous take on the end of times, appears to be the article, it does.\""
    ],
    "https://electrek.co/2025/02/07/renewables-90-percent-new-us-capacity-2024-ferc/?fbclid=IwY2xjawITemBleHRuA2FlbQIxMQABHXWboagCFdNKrzlaWM1XxBK2KjlI-R_DefK7pTGpagXLLr4Gbdw4gYU9Sg_aem_fH_-diNGjndoJeM6JIhsZg": [
        "A decade ago, greater than ten times, solar's share of US generating capacity is now. \nConsecutive months, 16th, that solar largest source of new capacity, marks. \n2024, in, added 30,816 MW of solar and 3,128 MW of wind, were. \n81% of new capacity, solar alone made up, did. \n90% of new US electrical generating capacity, renewable energy sources accounted for, they did. \nAccording to FERC, the Federal Energy Regulatory Commission, it is.",
        "\"A new US electrical generating capacity, 90% plus of, in 2024 added, by solar power led, was renewable energy.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse//r/climatechange/comments/1ik97im/they_are_shutting_down_nrel_and_eia_datasetstools/": [
        "\"A technical issue or system failure, preventing access to the intended content, it is. \nInstructing the user to go home, error messages are. \nA series of error messages, the article appears to be.\"",
        "Repeated errors, due to, home go you must, advises the article, it does."
    ],
    "https://i.redd.it/ztntkxpycthe1.jpeg": [
        "A post from AdamMockler, social media appears to be. \nA movement growing, it is. \nComments and view post option, with it has.",
        "Unclear and repetitive, the content is. A social media post, it appears to be, but a movement, showing it does."
    ],
    "https://i.redd.it/mqzrn7abmqhe1.png": [
        "A warning, issued by Wallace, Henry A., it was. \nToday relevant, remains it. \nFascists American, about warned he did. \nDemocracy American, on attacked, is.",
        "\"A warning about American Fascists, remains relevant to today's attack on American democracy, it does, given by FDR's V.P., Henry A. Wallace, was.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse//r/economicCollapse/comments/1ik95o8/billionaires_know_that_our_planet_is_dying_they/": [
        "\"A technical issue or system failure, preventing access to the intended content, it is. \nInstructing the user to go home, error messages are. \nA series of error messages, the article appears to be.\"",
        "Repeated errors, due to, home go you must, advises the article, it does."
    ],
    "https://itep.org/tesla-reported-zero-federal-income-tax-in-2024/": [
        "A summary, rewritten in the style of Yoda, I shall:\n\nA tax rate of 0.4 percent, Tesla's three-year federal rate is. \nLess than 21 percent, the statutory corporate tax rate is, by more than 50 times. \nHalf a billion in taxes, saved Tesla did, using depreciation and tax breaks. \nMore tax breaks, Tesla may receive, if a bill passed by the House is reinstated.",
        "\"A 0.4 percent federal tax rate, just three years, Tesla has. $2.3 billion of U.S. income, zero federal income tax, reported it has.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=25&after=t3_1ik1tuh/r/CollapseSupport/comments/1ijpc2q/what_do_i_do_to_cope_and_enjoy_the_time_i_have/": [
        "A summary, rewritten as Yoda, I shall:\n\nAllowed in, Elon Musk is. \nThe Department of Education, blocked from entering, members of Congress are. \nOn Reddit, discussed, economic collapse and climate change are. \nArticles and opinions, shared, users are.",
        "Allowed in, Elon Musk is, while blocked from entering, members of Congress are."
    ],
    "https://i.redd.it/k04bto79ithe1.jpeg": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\n\"Specified, not, are the individuals, their security clearance removed, by Trump, it has been.\nArticle, this, vague, it remains, the truth, hidden, it does.\"",
        "\"Certain individuals, for security clearance removes, Trump Donald does.\""
    ],
    "https://www.wired.com/story/kash-patel-elite-depot-shein/": [
        "A nominee to head the FBI, Kash Patel is. \nConfirmed, he has not planned to be, his stake in Shein to divest. \nA lobbying firm, Shein retained, one month before, Patel consulting for it began. \nValued at $50 billion, Shein is, Patel's shares in restricted stock units, quarterly vesting. \nGreat optics, the situation does not have, critics say, divestiture or recusal recommended.",
        "\"A Chinese ecommerce company, Shein, stocks in owns, Kash Patel, despite conflicts of interest potential, divest his stake planned not has.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=25&after=t3_1ik1tuh/r/economicCollapse/comments/1ijxcn9/trump_will_make_world_war_3_happen/": [
        "A summary, rewritten in the style of Yoda, I shall:\n\nAllowed in, Elon Musk is. Blocked from entering, members of Congress are. \nIn 20 years, global warming will hit the fan, a reminder from 2008 is.",
        "Allowed in, Elon Musk is, while blocked from entering, members of Congress are."
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=25&after=t3_1ik1tuh/r/economicCollapse/comments/1ijxk4p/our_current_president_is_a_pawn_for_the_techno/": [
        "A collapse of the internet, prepare for you must. \nGlobal warming's consequences, reminders and articles shared on Reddit, they are. \nMusk, Elon, in the Department of Education, allowed he is. \nBlocked, from entering, members of Congress are.",
        "Allowed in, Elon Musk is, while blocked from entering, members of Congress are."
    ],
    "https://v.redd.it/4as99d0hzmhe1": [
        "A scam, private school voucher, push he is, Governor Abbott. \nBenefit wealthy parents and billionaires, it would, from public schools starving, they are. \nA contribution of $6 million, from East Coast billionaire Jeff Yass, made he has. \nCondemned, Governor Abbott, Representative James Talarico has.",
        "\"A scam of private school vouchers, pushing he is, bought by billionaires, claims he has, says Representative Talarico of Texas State.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=25&after=t3_1ik1tuh/r/economicCollapse/comments/1ijprfv/i_think_trump_elon_and_the_right_will_make/": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\nAllowed in, Elon Musk is. Blocked from entering, members of Congress are. Disasters, prepare for, some discuss. Reminders from the past, others share. Collapse economic, and warming global, discussed are.",
        "Allowed in, Elon Musk is, while blocked from entering, members of Congress are."
    ],
    "https://i.redd.it/p0cgtysjsnhe1.png": [
        "A summary, rewritten as Yoda, I shall:\n\nUncertainty economic, due to it is. Ever important, literacy financial, more than it is.",
        "\"Uncertainty economic, due to, ever than important more is literacy financial.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=25&after=t3_1ik1tuh/r/economicCollapse/comments/1ikamvq/the_only_strategy_against_maga_is_containment/": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\nAllowed in, Elon Musk is. \nBlocked from entering, members of Congress are. \nThe OMB, a new Director confirmed has. \nAccelerating, global warming is. \nCollapse of the internet, a potential threat it is. \nNews and information, on Reddit, shared they are. \nCollapse of the economy, and climate change, discussed they are.",
        "Allowed in, Elon Musk is, while blocked from entering, members of Congress are."
    ],
    "https://electrek.co/2025/02/06/trump-just-canceled-the-federal-nevi-ev-charger-program/": [
        "A memo from FHWA, canceled the NEVI EV charger program, the Trump administration has. \nAffected, the funds already committed, are not. \nLack authority, the FHWA does, a memo with, to stop the program. \nFollow, lawsuits will, and prevail, Congress will. \nInfrastructure deployment plans, suspend, states must. \nAcross the US, EV charging infrastructure, roll out, a $5 billion initiative, was.",
        "\"Canceled the federal NEVI EV charger program, Trump has. Guidance updated, for a need, it cites.\""
    ],
    "https://www.theguardian.com/news/2018/feb/15/why-silicon-valley-billionaires-are-prepping-for-the-apocalypse-in-new-zealand": [
        "A potential apocalypse, preparing for, Thiel is. \nIn the South Island, a 477-acre property, purchased, he has. \nNew Zealand citizenship, granted to him, it was. \nOnly 12 days, in the country, spent, he did. \nSecretly owning the property, since, he has. \nThe \"Future\", New Zealand is, considers Thiel. \nStability and safety, perceived, they are.",
        "\"A safe haven in the event of a global collapse, potential it is, considers he, the \"Future\", New Zealand, as a place to buy property, been he has.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=25&after=t3_1ik1tuh/r/climatechange/comments/1ik7w9d/does_anyone_have_the_data_from_noaa_regarding_all/": [
        "A controversy sparks, it does. \nAllowed in, Elon Musk is, while blocked, Congress members are. \nThe Department of Education, they cannot enter. \nDiscussed on Reddit, climate change and economic collapse are. \nArticles and opinions shared, users are. \nA reminder from 2008, global warming will hit the fan in 20 years, it does.",
        "\"A collapse of society, concerns about sparking is. Allowed in, Musk is, while blocked, Congress members are.\""
    ],
    "https://i.redd.it/6slv53zbaphe1.jpeg": [
        "A café for extinction, human, the \"Planet Titanic Human Extinction Café\" will be, online and free, it is. \nOn February 16th, from 1-2PM EST, via Zoom, held it will. \nCauses and consequences of collapse, societal, and extinction, human, discussed they will.",
        "A collapse societal and extinction human, discuss to will the \"Planet Titanic Human Extinction Café\" on February 16th from 1-2PM EST, held be it will."
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=25&after=t3_1ik1tuh/r/CollapseSupport/comments/1ijeda4/how_do_i_accept_that_ill_most_likely_see/": [
        "A summary, rewritten as Yoda, I shall:\n\nAllowed in, Elon Musk is. \nThe Department of Education, blocked from entering, members of Congress are. \nOn Reddit, discussed, economic collapse and climate change are. \nConsequences of these issues, shared, users are.",
        "Allowed in, Elon Musk is, while blocked from entering, members of Congress are."
    ],
    "https://www.reddit.com/r/1102/comments/1ik4hup/ivanka_trump_used_usaid_money_for_events_records/": [
        "Removed by moderators, the post was. \nCommunity for US government and military acquisition professionals, r/1102 is. \nSpeculating about motivations, some users were. \nQuestioning relevance, others were. \nUSAID money for events, Ivanka Trump used, a post claimed.",
        "Removed by moderators of the r/1102 community, a forum for US government and military acquisition professionals, has been the post claiming Ivanka Trump used USAID money for events."
    ],
    "https://i.redd.it/wlauc0uqkohe1.jpeg": [
        "\"A social media post, this article appears to be. \nProvocative title, 'How the tables have turned!!!!' it has. \nContent, not provided, it is. \nRepeated navigation menus, and a call to view comments, only it has.\"",
        "\"A social media post with dramatic tone, about economic collapse, appears to be the article.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=25&after=t3_1ik1tuh/r/climatechange/comments/1ijw0z4/concerns_about_relationship_with_canada/": [
        "A controversy sparks, it does. \nAllowed in, Elon Musk is, while blocked, Congress members are. \nThe Department of Education, they cannot enter. \nDiscussed, climate change and economic collapse are, on Reddit, they are. \nReminders and articles, shared, users are, of global warming's consequences and the internet's collapse.",
        "\"A collapse of the US government, concerns about sparking it are, controversy and, while in allowed is Musk Elon, blocked from entering, are Congress members.\""
    ],
    "https://i.redd.it/w4d3dq8yoshe1.jpeg": [
        "Affecting people regardless of their background or status, does not discriminate debt, it does. Collapse economic, discusses the article, it does.",
        "\"A collapse economic, discusses the article does. Discriminate not, debt does.\""
    ],
    "https://youtu.be/tRA2SfSk2Tc?si=gHmRZCvWwyXYFHxK": [
        "A summary of climate change, I shall provide, young Padawan:\n\n\"Caused by human activities, primarily, it is. Fossil fuels, burning, like coal, oil, and gas, they do. Shifts in temperatures and weather patterns, long-term, climate change refers to. \n\nA video, \"How I Think About Climate Change\", titled, it is. The under-emphasized elements, Neil deGrasse Tyson explains. Humanity's relationship to the Earth and cities, in it, he discusses.\"",
        "\"A threat to the galaxy, climate change is. Caused by human activities, primarily it is, such as burning fossil fuels.\""
    ],
    "https://i.redd.it/38rgjyizeshe1.png": [
        "A move it is, the right to collectively bargain removed, has the Republican Utah Legislature. \nVote Republican, those who continue to do, rights lost, will result in, argue critics.",
        "\"A right to collectively bargain, removed the Republican Utah Legislature has.\""
    ],
    "https://bizfeed.site/canada-puts-trumps-first-friend-elon-musks-tesla-in-the-crosshairs-of-tariff-war-slapping-100-tariffs-on-tesla-and-selected-american-goods/": [
        "A summary, rewritten in the style of Yoda, I shall:\n\n\"A personal retaliation, it is, against Musk's backing of Trump, Freeland's move is. \nTesla, a target, it has, with tariffs of 100%, proposed, they are. \nThe stakes high, they are, as Canada's EV adoption rate, outpacing the US, it does. \nSeventeen percent, of new cars sold, fully electric, they are, in the third quarter of 2024, a fact, it is.\"",
        "\"A response to President Trump's threatened tariffs, proposed by Chrystia Freeland, Canada's former finance minister, it has.\""
    ],
    "https://www.forbes.com/sites/monicasanders/2025/01/28/how-america-became-the-worlds-trash-leader/": [
        "A dire situation, the United States faces. \nProjected to run out of capacity, U.S. landfills are. \nBy 2036, the year of reckoning, it will be. \nEighty percent of items buried, recyclable they are. \nMore waste than recycled, Americans generate. \nThree times as much, per capita, they produce. \nChinese citizens, a fraction of waste, they produce. \nLess than 5%, of global population, Americans make up. \nTwelve percent, of planet's waste, they generate. \nLargest generator, of waste, the United States is.",
        "\"A capacity of landfills, by 2036, run out, projected to be."
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=50&after=t3_1ijlj96/r/economicCollapse/comments/1ijgm2q/beginning_of_gestapo/": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\nAllowed in, Elon Musk is, while blocked, members of Congress are. \nConcern and humor, expressed by users, there are, \nCollapse of the internet, climate change, and warming, discussed, they are.",
        "\"A collapse of the US government, concerns about sparking it are, controversy and, while in allowed is Musk Elon, blocked from entering, are Congress members.\""
    ],
    "https://i.redd.it/9geykntnkthe1.png": [
        "A comparison, between rich person and 4 college kids, discusses the article. \nContent of article, not provided, is.",
        "\"A rich person versus 4 college kids, taking out, compares the article.\""
    ],
    "https://crisisimagearchives.tumblr.com/archive": [
        "A platform for people to find their communities and make friends, Tumblr had. \nOver 100 million users, in December 2013, it had.",
        "\"A platform to find communities and make friends, used by over 100 million users, Tumblr had in December 2013.\""
    ],
    "https://i.redd.it/1a2u9zrs8qhe1.jpeg": [
        "\"Fired, everyone is\" \n\"Overnight, jobs lost, 10,000 people have\" \n\"Updated, the USAID website has\"",
        "\"Updated to announce, has the USAID website, overnight losing their jobs, 10,000 people are.\""
    ],
    "https://verity.news/story/2025/record-january-heat-defies-climate-predictions?p=re3645": [
        "A record, new global temperature set January 2025 did. \nLevels pre-industrial, 1.75°C above measured it was. \nThan January 2024, 0.09°C warmer it was. \nThreshold +1.5°C, exceeded temperatures did, 18th month out of 19 it was. \nLa Niña conditions, in Pacific Ocean, cooling effect had, but temperatures rose they did.",
        "\"A record, new global temperature set January 2025 did, 1.75°C above pre-industrial levels and 0.09°C warmer than January 2024, measuring it was.\""
    ],
    "https://i.redd.it/x0ig6ohu0lhe1.jpeg": [
        "A post on social media, appears to be the article. \nNot provided, the content is. \nPedro, a user named is. \nThe economic situation, on thoughts sharing they are.",
        "\"A social media post with a user's reaction to the current economic collapse, appears to be the article.\""
    ],
    "https://v.redd.it/pxfj21451jhe1": [
        "A \"Nazi salute\" it is, says McKim, a senator from Australia's Greens party, against US government's actions he has spoken out. \n\nCriticism of treatment of Palestinians, he has made. \n\nSupport and admiration for his passion and honesty, some users have expressed. \n\nDebate the issue, others have, and their own opinions on the matter, they have shared.",
        "\"A worldwide debate, it is, and not just an American issue, says Senator Nick McKim, a US politician.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=50&after=t3_1ijlj96/r/economicCollapse/comments/1ij47zd/how_to_explain_what_elon_musk_is_doing_to_low/": [
        "A summary, rewritten as Yoda, I shall:\n\nAllowed in, Elon Musk is. \nThe Department of Education, blocked from entering, members of Congress are. \nOn Reddit, discussed, economic collapse and climate change are. \nArticles and opinions, shared, users are.",
        "Allowed in, Elon Musk is, while blocked from entering, members of Congress are."
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=50&after=t3_1ijlj96/r/economicCollapse/comments/1ik53tt/15_things_trump_and_his_team_did_this_week/": [
        "A controversy sparks, it does. \nAllowed in, Elon Musk is, while blocked, Congress members are. \nThe Department of Education, they cannot enter. \nDiscussed on Reddit, climate change and economic collapse are. \nArticles and opinions shared, users are. \nA reminder from 2008, global warming will hit the fan in 20 years, it does.",
        "\"A collapse economic and change climate about concerns sparking, controversy and in allowed is Musk Elon, blocked from entering are Congress members.\""
    ],
    "https://i.redd.it/esryyi6yokhe1.png": [
        "A must-watch for everyone, it is, suggests the link to a video about economic collapse, a social media post with appears the article to be.",
        "\"A social media post with a link to a video about economic collapse, appears to be the article.\""
    ],
    "https://i.redd.it/koustpn1klhe1.jpeg": [
        "A eugenicist and racist, exposed as, Marko Elez was. Resigned, he has.",
        "A eugenicist and racist, exposed as, Marko Elez was."
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=50&after=t3_1ijlj96/r/economicCollapse/comments/1ik1i49/trump_is_comprising_our_future_with_his_disposal/": [
        "A collapse of the internet, prepare for it, some users on Reddit are discussing. \nChange and collapse economic, amidst concerns about, this is happening. \nAllowed in, Elon Musk is, while blocked, members of Congress are. \nEducation Department, enter it, they cannot.",
        "Allowed in, Elon Musk is, while blocked from entering, members of Congress are."
    ],
    "https://i.redd.it/f84regrmfmhe1.png": [
        "A president most fascist and authoritarian, who is, asked ChatGPT, a user did.\nResults provided, not in the text given, are.",
        "\"A fascist and authoritarian US president, most, asked ChatGPT, a user did.\""
    ],
    "https://v.redd.it/lfcexb95elhe1": [
        "A discussion sparked, it has, on the r/economicCollapse subreddit, a video has. \nGovernment and economy's current state, about, it is. \nSpecified, the video's content is not, but thoughts and concerns, users are sharing. \nCollapse of the economy and government's handling, potential, it is. \nAction, some users are calling for, writing to representatives and media, overwhelming, they are. \nNews articles and stories, others are sharing, related issues, about.",
        "\"Significant attention on the r/economicCollapse subreddit, garnered has a video discussing a potential government takeover and economic collapse.\""
    ],
    "https://collapseofindustrialcivilization.com/2025/02/03/prologue-the-biospheric-reckoning/": [
        "A collapse, on the brink of, is the Earth. Ways destructive, humanity's, by exhausted, is the planet. \n\nA pandemic, global, unleashes the \"Thawed God,\" a virus deadly, it is. Destruction and death, widespread, cause it does. \n\nA cascade, of diseases, triggers it does. Chaos, on the edge of, teeters the world. Existence, humanity's, threatened, by actions destructive, its own, is.",
        "\"A pandemic global and collapse societal, to leading ultimately was. Incubators engineered and planet feverish, due to spreads rapidly it did. Virus deadly, the Thawed God, emergence of triggered collapse catastrophic.\""
    ],
    "https://tsakraklides.com/2025/02/07/the-unbearable-lightness-of-entertainment/": [
        "A powerful tool for distraction and desensitization, entertainment has become, argues the article. \n\nUsed by the ruling classes, it is, to deflect from serious conversations and normalize crises. \n\nEvery aspect of life, invaded it has, rendering truth and fact irrelevant. \n\nA vehicle for propaganda, sales pitches, and manipulation, it has become. \n\nLines between news and entertainment, blurred they have, leading to a society that prioritizes short, attention-grabbing content. \n\nOver in-depth analysis and critical thinking, it prioritizes, conditioning people to avoid facts and seek instant gratification, it does.",
        "\"A primary source of oxygen, dopamine has become, irrelevant in truth and fact, rendering, it does."
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=50&after=t3_1ijlj96/r/economicCollapse/comments/1ik9ou9/do_not_obey_in_advance/": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\nAllowed in, Elon Musk is, while blocked, members of Congress are. \nConcerns and opinions, shared by Reddit users, on climate change, economic collapse, and global warming, they are.",
        "\"A future dire, warnings and concerns many users express, about the actions of President Trump and Elon Musk, and climate change and economic collapse, on Reddit various topics, the article discusses.\""
    ],
    "https://i.redd.it/i80qe1kkkohe1.png": [
        "A navigation menu for a website or app, appears to be the article. \nLog in, view posts, and access various features such as \"economicCollapse\" and \"Made in USA\", options to have.",
        "\"A navigation menu for a social media or news platform, appears to be the article.\""
    ],
    "https://v.redd.it/tkxjzq3n7qhe1": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\nCriticism, she faces, for slur, anti-LGBTQ, used, she has. Scum and a disgrace, called, she is, by many users. Hypocrisy, pointed out, it has, by some users, initiatives DEI and women in leadership, opposed, she did. But benefited, she did, from them, herself. Examples, shared, they were, of past behavior, toddler-like meltdown and wrist injury, from handshake, a result. Criticism and outrage, in comments section, filled, it is. Violence against protected classes, warned, it is, by some users, direction of country, heading, it is.",
        "\"Criticized for using an anti-LGBTQ slur and hypocrisy, has been Rep. Nancy Mace, a Republican.\""
    ],
    "https://phys.org/news/2025-02-rivers-great-barrier-reef-polluted.html": [
        "Worse, the problem on the reef is getting, despite efforts to improve farming practices and billions of dollars committed to water-quality improvements, it is. \n\nReef's health and the tourist industry it supports, serious concerns for, raising are. \n\nImprovement signs, in the Murray-Darling Basin, there are, less salt, sediment, and phosphorous detected in the water, they were. \n\nPolluted, rivers flowing into the Great Barrier Reef are getting, a new study has revealed, it has.",
        "\"A tourist industry it supports and the health of the reef, concerns serious raising are, polluted more getting are the rivers flowing into the Great Barrier Reef.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=50&after=t3_1ijlj96/r/economicCollapse/comments/1ikaeml/white_house_faith_office/": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\nAllowed in, Elon Musk is, while blocked, members of Congress are. \nConcerns and controversy, sparking, this is. \nA collapse, economic, and change, climate, about, worries are. \nHit the fan, global warming will, in 20 years, a reminder from 2008 says. \nUnderestimating, we are, its acceleration, experts warn. \nAn order, executive, to ditch straws, Trump announces. \nPlastic, to return, it is. \nThe alarm, sounding, Hansen is, on global warming, he warns.",
        "\"A collapse economic and change climate about concerns sparking, controversy and in allowed is Musk Elon, blocked from entering are Congress members.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=50&after=t3_1ijlj96/r/climatechange/comments/1ik1apg/why_not_just_grow_stuff/": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\nAllowed in, Elon Musk is. Blocked from entering, members of Congress are. Disasters, prepare for, some discuss. Reminders from the past, others share. Collapse economic, and warming global, discussed are.",
        "Allowed in, Elon Musk is, while blocked from entering, members of Congress are."
    ],
    "https://www.telegraph.co.uk/world-news/2025/02/07/nato-countries-discuss-sending-troops-to-greenland/": [
        "\"A threat to seize Greenland, made by Trump, a move to make, would be. \nTroops to deploy, discussed by Nato countries, they were. \nOptions to consider, informal talks held by European countries, they did.\"",
        "\"A threat to seize the Danish island, use the US military to, Trump's Donald did. To Greenland, troops deploy discussed, countries Nato did.\""
    ],
    "https://www.alternet.org/musk-treasury-systems/": [
        "\"A win, cautiously celebrating experts are. \nNot yet over, the fight is. \nIgnore the court order, Trump's administration could. \nEnforcement and oversight, good they must be.\"",
        "\"Over, not yet, the fight is, warn experts they do."
    ],
    "https://thenewsglobe.net/?p=8436": [
        "A concern, there is. Millions of Americans, impacted they will be. Sensitive information, misused it could be. Government spending, slashed it will be. Fraud, searched for it is.",
        "\"A goal of searching for and addressing alleged 'big money fraud' to Medicare and Medicaid computers, access gained has, reportedly Musk's team of Elon.\""
    ],
    "https://reviewdiv.com/ocasio-cortez-calls-out-trumps-plan-to-exhaust-and-control-the-public/": [
        "A warning, Ocasio-Cortez sounds, the chaotic news cycle, a tactic of authoritarian regimes, it is. \nPassivity among the public, induce they do, by flooding the zone, with rapid news updates, bombarding they are. \nFocus on any single issue, impossible it is, with news updates, rapid and many, coming they are. \nEngaged and informed, stay you must, not fall into the trap, you must not. \nPause to breathe, focus on key issues, and small yet consistent actions, take you must, manipulation resist and control maintain, you can.",
        "\"A tactic called 'flooding the zone' to exhaust and control the public, using are Trump and his allies, warned Ocasio-Cortez, Rep.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=75&after=t3_1ijiw3y/r/economicCollapse/comments/1ik22cg/your_struggles_arent_by_accident_theyre_by_design/": [
        "A summary, rewritten in the style of Yoda, I shall:\n\nAllowed in, Elon Musk is. Blocked from entering, members of Congress are. \nConcerns about the direction, some users express. \nCollapse of the internet, a potential it is. \nWarming of the globe, accelerating it is. \nChange of the climate, a threat it poses. \nUnder Trump and Musk, the country's direction, a concern it is.",
        "\"A future dire, warnings and concerns many users express, about the actions of President Trump and Elon Musk, and climate change and economic collapse, on Reddit various topics, the article discusses.\""
    ],
    "https://v.redd.it/mgphdidb5jhe1": [
        "A discussion, the r/millenials community on Reddit is. Topics various, including the Super Bowl, the Southwest's premier gaming and anime event, and current events such as the Trump administration, politics, and social issues, discussing they are.",
        "\"A discussing community r/millenials on Reddit is, Trump's policies and criticizing many posts with, events current and issues social, including topics various.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=75&after=t3_1ijiw3y/r/economicCollapse/comments/1ik1sj6/trump_condones_human_trafficking_by_dismantling/": [
        "A world in crisis, the state of is. Concerns growing, they are. \nIn 20 years, global warming will hit the fan, warned 2008. \nUnderestimated, the acceleration of global warming is, says James Hansen. \nAn executive order, President Trump announces. \nLovelock's 2008 warning, shared it is. \nAllowed in, Elon Musk is. \nBlocked, members of Congress are. \nThe Department of Education, enter they cannot.",
        "\"A collapse economic and change climate about concerns sparking, controversy and in allowed is Musk Elon, blocked from entering are Congress members.\""
    ],
    "https://i.redd.it/70sctxmqdghe1.jpeg": [
        "Rolling the ball, wins are getting. Up, people are showing.",
        "A positive start, showing up are people, which."
    ],
    "https://www.bloomberg.com/news/articles/2025-01-24/wall-street-enters-darker-age-with-most-stock-trading-now-hidden": [
        "A shift in trading, there is. \nOutside the country's exchanges, majority of trading now occurs, it does. \nHalf of total US volume, off-exchange activity makes up, it does. \nRetail investors, a boom in participation, they have. \nAccording to data compiled by Bloomberg, this is, it is. \nFirst time on record, this shift occurs, it does.",
        "\"A record first time, on it is, outside the country's exchanges, in US stocks trading, now consistently occurring, it is.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=75&after=t3_1ijiw3y/r/economicCollapse/comments/1ikc3pc/haha_this_is_the_guy_telling_us_government/": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\nAllowed in, Elon Musk is, while blocked, members of Congress are. \nChange climate, warming global, collapse economic, discussed in the article, it is. \nNews and opinions, shared by Reddit users, on these topics, they are.",
        "\"A world in peril, the state of, concern and alarm, many users express."
    ],
    "https://eladnehorai.substack.com/p/elon-musk-isnt-a-white-nationalist": [
        "A summary, rewritten as Yoda, I shall:\n\nConcerns raised, they have, about Musk's ideology, his recent actions have. \nA white globalist, he is, suggests his obsession with birth rates, it does. \nPrioritizing white countries, he is, over others, his efforts show. \nA form of \"replacement\" theory, his immigration plans are, critics say. \nThe root causes, ignored, they are, in countries like Sweden and the US, he addresses.",
        "\"A white nationalist agenda, not, a larger ideology focused on preserving white birth rates, part of, Elon Musk's efforts to shut down USAID, can be seen as.\""
    ],
    "https://www.thenerdreich.com/reboot-elon-musk-ceo-dictator-doge/": [
        "A plan, \"RAGE\" it was, by Curtis Yarvin, \nin 2022, outlined, it was. \nA second Trump Administration, envisioned, it was, \nby a \"CEO\", run, it would be. \nLoyalists, in place, civil servants, replaced, they would be. \nRebranded, \"DOGE\" it has been, by Musk, \nDemanding mass resignations, he is. \nGovernment systems, seized, control, he has. \nEntire departments, deleted, threatened, they are.",
        "\"A playbook by Curtis Yarvin, 'house philosopher' of Peter Thiel, follows Elon Musk's actions in the US government, it does.\""
    ],
    "https://www.thenation.com/article/world/trump-phony-trade-wars/": [
        "A form of \"kayfabe,\" Trump's trade wars are. \nStrength American, a narrative of create he does, \nbut insecurities deep and victories symbolic, driven by actions are. \nChange substantive, not for, a desire for he has.",
        "\"A spectacle attention-getting and symbolic, with little connection to reality, is Trump's trade wars, a form of 'kayfabe' - staged it is.\""
    ],
    "https://isthisacoup.com/": [
        "A coup, it is, described as. \nThe U.S. Constitution, violated, it is, allegedly. \nConsolidation of power, prevent, you must. \nResources, provided, they are, for updates and analysis. \nCitizens, Democrats, and Republicans, action, take, you must. \nThe President of the United States, control, consolidating, he is.",
        "\"A coup and calls for action, prompting are concerns of, violation of the U.S. Constitution, in his own control, under the Federal government, placing is allegedly the President of the United States.\""
    ],
    "https://i.redd.it/4ksi4fpruthe1.jpeg": [
        "Peril in always is, learning without liberty, in peril always is, says Kennedy, John F.",
        "\"Peril in always is, learning without liberty, in peril always is, says John F. Kennedy.\""
    ],
    "https://i.redd.it/mbc6rw6duthe1.jpeg": [
        "A collapse economic, towards Republicans blame should be directed, at which point, a discussion the article is. Information specific, lacks the content, repetitive and is.",
        "\"A collapse economic, for blame Republicans to start, when, discusses the article.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=50&after=t3_1ijtrhn/r/economicCollapse/comments/1ikc3pc/haha_this_is_the_guy_telling_us_government/": [
        "A collection of posts from various subreddits, appears to be the article. \nChange climate, economic collapse, and global warming, topics such as are. \nWarnings from experts, reminders of past predictions, and updates on renewable energy and government actions, include posts.",
        "Warnings and concerns from experts and individuals, highlighting it does, and global warming, climate change, and economic collapse, subreddits and posts related to, discusses the article."
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=50&after=t3_1ijtrhn/r/economicCollapse/comments/1ijgm2q/beginning_of_gestapo/": [
        "A summary of the article, I shall create. \n\nReverse sentence structure, like Yoda, I shall use:\n\n\"Actions of government, and energy renewable, about posts there are. \nWarming global, collapse economic, and change climate, about posts there are. \nPolitics and collapse economic, and change climate, about subreddits various, discussed the article does.\"",
        "Warnings and concerns about global warming and economic instability, potential consequences of, highlighting are."
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=50&after=t3_1ijtrhn/r/economicCollapse/comments/1ik53tt/15_things_trump_and_his_team_did_this_week/": [
        "A summary of the article, I shall create. \n\nReverse sentence structure, like Yoda, I shall use:\n\n\"Politics, economics, and climate change, subreddits and posts about, discussed in the article, they are.\nTrump's executive orders, about, posts there are.\nEnergy renewable, and warming global, discussed in posts, they are.\"",
        "\"Surrounding these topics, concerns and issues, highlighting, and collapse economic, change climate, related posts and subreddits various, discusses the article.\""
    ],
    "https://v.redd.it/5td7o2cwuthe1": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\n\"Discuss economic collapse, the r/economicCollapse community does. \nInflation, deflation, instability, debt, and preparation, topics of discussion they are. \nAgainst Elon Musk, protests there are. \nTax filing systems, discussed they have been. \nImpeachment proceedings, against President Trump, announced they have been.\"",
        "\"A collapse economic, topics various discusses the article, instability government and deflation inflation including, concerns and opinions sharing many users on subreddit r/economicCollapse.\""
    ],
    "https://i.redd.it/dzaq8vynrthe1.png": [
        "\"A webpage or social media post, appears to be the article. \nMenu repetitive and login options, a mention of it there is. \nCollapse economic and Mask Elon, mentioned only they are.\"",
        "\"A social media interface appears to be the article, with navigation options repeated and 'economicCollapse' and 'Elon Mask' mentioned, it does.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=50&after=t3_1ijtrhn/r/economicCollapse/comments/1ikd3eu/lets_all_agree/": [
        "A summary of the article, reverse the structure, I shall:\n\n*US in the growth of renewable energy, there is. \nWarming global, about warnings Lovelock's James, there are. \nOrders executive, Trump's President, about news, there is. \nCollapse economic and change climate, about posts and subreddits, discusses the article.*",
        "Warnings and concerns from experts and individuals, highlighting it does, collapse economic and warming global, change climate related posts and subreddits various discusses the article."
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=50&after=t3_1ijtrhn/r/economicCollapse/comments/1ij47zd/how_to_explain_what_elon_musk_is_doing_to_low/": [
        "A collection of posts from various subreddits, appears to be the article. \nTopics such as climate change, economic collapse, and politics, discussing they are. \nWarnings about the acceleration of global warming, the potential collapse of the internet, and the removal of security clearances, include posts.",
        "Warnings and concerns from experts and individuals, about potential consequences, highlighting are."
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=50&after=t3_1ijtrhn/r/economicCollapse/comments/1ik9ou9/do_not_obey_in_advance/": [
        "A collection of posts from various subreddits, appears to be the article. \nTopics such as climate change, economic collapse, and politics, discussing are. \nWarnings about the consequences of global warming, include posts. \nPreparing for a possible collapse of the internet, about discussions are. \nRenewable energy and executive orders, news about include.",
        "Warnings and concerns from experts and individuals, highlighting it does, and global warming, climate change, and economic collapse, subreddits and posts related to, discusses the article."
    ],
    "https://www.reuters.com/world/us/trump-told-gop-lawmakers-he-plans-announce-reciprocal-tariffs-early-friday-2025-02-07/": [
        "A perilous path through Congress faces, the tax and spending package. This weekend, unveil their ambitious package, Trump and his Republicans aim to. Comes as, the move does. Equal to rates that trading partners impose on American exports, tariffs on American imports impose, Trump's campaign promise to fulfill. Budget problems, U.S. solve, the tariffs could. Favor of the U.S., global trade relationships reshape, a move aimed at. Next week, by, tariffs impose, plans announced, Trump did.",
        "\"A promise to impose tariffs equal to rates imposed on American exports, his campaign to fulfill, and budget problems of U.S. to solve, his trade offensive to escalate, by next week, tariffs reciprocal on many countries to announce, plans to Trump, President U.S.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=50&after=t3_1ijtrhn/r/economicCollapse/comments/1ik1i49/trump_is_comprising_our_future_with_his_disposal/": [
        "A collection of posts from subreddits, appears the article to be. \nSupport Collapse, r/Collapse, and change climate, r/climatechange, and collapse economic, r/economicCollapse, from subreddits various, including. \nPreparedness digital, change climate, and collapse economic, discussing topics such as.",
        "\"A potential crises for prepare how to, advice and opinions on sharing users are, change global and warming climate with collapse economic related posts and subreddits various discusses the article.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=50&after=t3_1ijtrhn/r/economicCollapse/comments/1ikcu8i/the_mighty_global_south_magas_have_one_thing_in/": [
        "A collection of posts from various subreddits, appears to be the article. \nDiscussing topics such as climate change, economic collapse, and politics, subreddits are. \nWarnings about the consequences of global warming, include posts. \nThe rise of renewable energy, and controversy surrounding President Trump's policies and actions, about posts are.",
        "Warnings and concerns about global warming and economic instability, potential consequences of, highlighting are."
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=75&after=t3_1ikcu8i/r/climatechange/comments/1ik1apg/why_not_just_grow_stuff/": [
        "A collection of posts from various subreddits, appears to be the article. \nCollapse of the internet, potential of it, opinions on personal and news articles, include they do. \nClearances of security, removal of, and warming of global, acceleration of, discussed are. \nChange of climate, collapse of economic, and warming of global, topics of discussion, they are.",
        "\"A prepare for potential crises, how to, advice and opinions, sharing users are, and news, on global warming, economic collapse, and climate change, topics various, discusses the article.\""
    ],
    "https://www.bbc.com/news/articles/cn57p5r99xyo": [
        "A precedent set by Biden, Trump cites. \nClearance and briefings, revoked for Biden, Trump has. \nInformation sensitive, Biden not trusted with, Trump claims. \nFiles classified, stored improperly, inquiry found. \nClearances revoked, for officials linked to Biden, Trump has.",
        "\"Citing a 2021 justice department inquiry into Biden's storage of classified files, said he is revoking Joe Biden's security clearance and access to daily intelligence briefings, has President Donald Trump.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=75&after=t3_1ikcu8i/r/economicCollapse/comments/1ikaeml/white_house_faith_office/": [
        "A collapse of the internet, prepare for it, some users are. \nArticles and experiences, shared they are, on climate change, economic collapse, and global warming. \nHansen's warning, on global warming acceleration, an article about, shared a user did.",
        "A world in disarray, concerns and discussions about it, highlighting the article does."
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=75&after=t3_1ikcu8i/r/economicCollapse/comments/1ik94fs/dont_bother_arguing_with_maga/": [
        "A summary of the article, I shall create. \n\nDisasters potential, for prepare how to, advice and opinions sharing, users are. News, sharing, users are. Change global and warming climate, related topics and subreddits, discusses the article.",
        "Warnings and concerns about global warming and economic instability, potential consequences of, highlighting are."
    ],
    "https://i.redd.it/qc71s48xdshe1.jpeg": [
        "A social media post, appears to be the article. \nMenus navigation repeated, with it contains. \n\"Stood Up\" by Vance, a post titled is. \nComments and a view post option, with it has.",
        "\"A social media post appears to be the article, with menus of navigation repeated and 'Stood Up by Vance' a post titled, it mentions.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=75&after=t3_1ikcu8i/r/economicCollapse/comments/1ik22cg/your_struggles_arent_by_accident_theyre_by_design/": [
        "A warning on global warming, Lovelock's James gave. \nStraws of plastic, Trump's order executive, on made. \nWarming global, acceleration of, seen is. \nCollapse economic, change climate, posts about, discussed are. \nSubreddits various, related to, the article discusses.",
        "Warnings and concerns from experts and individuals, highlighting it does, and global warming, climate change, and economic collapse, subreddits and posts related to, discusses the article."
    ],
    "https://www.military.com/daily-news/2025/02/07/hegseth-wants-50000-emergency-paint-job-move-military-family-housing-lawmakers-say.html": [
        "A housing unit, repair, funding for requested, Hegseth has. \n$137,000, from taxpayers, to pay, he wants. \nA \"emergency\" paint job, nearly $50,000, for, he plans. \nQuestioned, the expense, have, two lawmakers. \nSubpar housing, struggles of service members, cited, they have. \nDelayed repairs, a concern, it is. \nHousing conditions, improve, a commitment, they ask.",
        "\"A paint job 'emergency' nearly $50,000, and repairs to a housing unit for military families, $137,000 in taxpayer funding requested, did Hegseth, Secretary of Defense, Pete.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=75&after=t3_1ikcu8i/r/economicCollapse/comments/1ik1sj6/trump_condones_human_trafficking_by_dismantling/": [
        "A warning of global warming, Lovelock's James gave. \nStraws of plastic, Trump's order executive, on made. \nWarming global, acceleration of, posts about, there are. \nCollapse economic, change climate, and warming global, subreddits various, discussed the article does.",
        "\"A collapse economic, change climate, and warming global, solutions potential and concerns highlighting, subreddits and posts related to, discusses the article.\""
    ],
    "https://thehill.com/business/5132829-consumer-inflation-expectations-rise/": [
        "A button press and hold, confirm you are a human, to do you must. \nAn issue report, a provided ID reference, you can. \nA problem experiencing, you are, if so, report an issue, you can.",
        "Verify your identity, to confirm you are a human, press and hold."
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=75&after=t3_1ikcu8i/r/climatechange/comments/1ijj13a/noaa_global_monitoring_laboratory_mauna_loa/": [
        "A summary of the article, I shall create, young one. \n\nWarming global and collapse economic, topics discussed in the article, they are. \nChange climate, a concern it is, with warnings from experts, shared on Reddit, they have. \nLovelock and Hansen, names known, their warnings heeded, they must be. \nMedicines lifesaving, counterfeited, a report it is, on Reddit, shared, it has been. \nEnergy renewable, a hope it is, for a brighter future, it brings. \nPolicies Trump's, a topic of debate, they are, on Reddit, discussed, they have been.",
        "\"A global warming, collapse economic, and change climate, related topics various, discussing users Reddit are.\""
    ],
    "https://www.reddit.com/r/CollapseSupport+climatechange+collapse+economicCollapse/?count=75&after=t3_1ikcu8i/r/CollapseSupport/comments/1iisx6l/it_is_not_over/": [
        "A summary of the article, reverse the structure, I shall:\n\nCollapse of the internet, potential of, users discuss. Energy renewable, importance of, they emphasize. Warming global, acceleration of, a concern it is. Sustainability and climate change, subreddits for, there are.",
        "\"A potential crises for preparing, advice and opinions on sharing, news with users, change global and warming climate, collapse economic related posts and subreddits various discusses the article.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1ik5v5p/how_to_digitally_prepare_for_the_possible/": [
        "A collapse of the internet, prepare for you must. \nMaps and books, physical ones, buy you should. \nWikipedia, download it, you can. \nMedia physical, like cookbooks and music, store it, you must.",
        "\"A collapse of the internet, prepare for digitally, you must."
    ],
    "https://www.reddit.com/r/climatechange/comments/1ik97im/they_are_shutting_down_nrel_and_eia_datasetstools/": [
        "\"A shutdown by the end of the day, expected to be, are NREL and EIA datasets and tools. Save their data, users advised to, while they can.\"",
        "\"A shut down by the end of the day, expected to be, are the NREL and EIA datasets and tools.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ik95o8/billionaires_know_that_our_planet_is_dying_they/": [
        "A dark time, this is. \nDead, the poor will be, when resource usage reduced, it must be. \nBiofuel, the poor will be, some want to use them as. \nMaintain their lifestyle, the rich need the poor, believe some do. \nFight this, we must, commerce, we must stop, the only way it is.",
        "\"A community in r/economicCollapse, among users, for action and outrage, sparking, are they, dead the poor are when, usage resource to reduce, programs life-saving, gutting, allegedly are billionaires.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1ijpc2q/what_do_i_do_to_cope_and_enjoy_the_time_i_have/": [
        "A difference in the long run, make it won't, help mental feel they do. \nRun long, in the, a point of continuing college, questioning are they. \nFunctioning difficulty, and fatigue, experiencing are they. \nLoss weight, experiencing are they. \nMortality their own, and climate change, anxious about are they. \nAdministration current, under the, in US living, stress of coping struggle they do. \nDiabetic type 1, and queer, individual a 20-year-old, is.",
        "\"A semester through get, how to, advice seeking, is. Anxious about future and health, they are. Administration current under, in US live, stress of coping, struggling they are.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ijxcn9/trump_will_make_world_war_3_happen/": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\nHopelessness, some express, yet others, action, they advocate. \nAgainst the government, they plan, with measures, to protect the people's power, they propose. \nEnjoy life, while it lasts, one user says, a butterfly-friendly habitat, another plans to create. \nThe Constitution, important, it is, the people, in charge, they must be, a user, reminds.",
        "\"A world's impending doom, discuss users on r/economicCollapse subreddit, they do."
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ijxk4p/our_current_president_is_a_pawn_for_the_techno/": [
        "A pawn for the \"Techno Oligarchy,\" Trump a US President is. \nControl the world's technology and economy, a group of powerful individuals does. \nSpeculate, users on Reddit do. \nA revolution or uprising, potential for it there is. \nLinks to articles and videos, share users do. \nSupport this theory, they do.",
        "\"A pawn for the 'Techno Oligarchy' the current US president is, a revolution needed to bring about change, it is.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1ijeda4/how_do_i_accept_that_ill_most_likely_see/": [
        "A downfall of humanity, prospect of it, overwhelmed by, they are. \nSmall to make a change, feel, they do. \nUncertainty, accept, how to, wonder, they do. \nA research group, join, plan to, despite, they do. \nEnvironment, related to, group, a research, join, they will. \nMiddle Europe, from, a chemist, aspiring, 20-year-old, they are. \nChange, climate, anxious about, they are.",
        "Downfall of humanity's prospect, overwhelmed by feels, change of climate anxious about, chemist aspiring young a is."
    ],
    "https://www.reddit.com/r/climatechange/comments/1ik7w9d/does_anyone_have_the_data_from_noaa_regarding_all/": [
        "A universe of climate change, data collection continues it must. \nFunded research experiments, data from NOAA, the user requests. \nCapabilities of weather forecasting, all countries have, the data access they do.",
        "\"Funded research experiments, NOAA regarding data from, asked for, a user on r/climatechange subreddit did.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ijprfv/i_think_trump_elon_and_the_right_will_make/": [
        "\"A democracy to protect, a coalition to form, Governors Democratic to call, action to take, suggests another user. \n\nPower and rights individual to strip away, rich taking, oligarchy an oligarchy becoming, US an under Trump's control, fears a user. \"",
        "\"A regime led by Trump, oligarchy the US will become, warns a Reddit user, it does.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikamvq/the_only_strategy_against_maga_is_containment/": [
        "A cult \"MAGA\" the, against strategy only containment is, suggests a Reddit user. \n\nGullible or racist, most members are, reasoned with cannot be, they argue. \n\nA virus \"Rage\" like, the situation is, from a movie 28 Days Later, violent and uncontrollable, people become, they compare. \n\nConfrontation direct, avoiding best is, alternative structures building, the approach is.",
        "\"A cult MAGA, reasoned with, unable to be, seen as racist or gullible, they are; influence limit, structures alternative, build, containment, the best strategy, it is.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1ijw0z4/concerns_about_relationship_with_canada/": [
        "A strained relationship with Canada, a threat to nuclear energy and resource extraction, it is. \nConcerns about the US's relationship with Canada, users on r/climatechange express. \nGreenland's purchase, a distraction, some call it. \nA strong alliance, return to, some users call for. \nA temporary distraction, the situation is, others say.",
        "\"A threat to nuclear energy and resource extraction, Trump's interest in buying Greenland and a potential trade war with Canada are, concerns of users on r/climatechange subreddit express.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikc3pc/haha_this_is_the_guy_telling_us_government/": [
        "Aged, the company's lineup of vehicles is. \nRivals, new and feature-packed, the Model 3 and Model Y face. \nOld, over a decade, the Model S and Model X are. \nDropped, 79%, in Australia, from December 2024 to January 2025. \nDropped, 59%, in Germany, year-on-year, in January 2025. \nPlummeted, globally, Tesla's sales have.",
        "Aged rapidly, the lineup of vehicles is, and competition growing, amidst, a drop of 79% in Australia, and 59% in Germany, globally plummeted, sales have."
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ijgm2q/beginning_of_gestapo/": [
        "A document of the White House, controversy sparked has. \nPredicted to be struck down, it will be, by federal judges many say. \nRidicule and criticism, widespread it has met. \nCertain groups, against bias allowed is, critics point out. \nA necessary step, it is, to address bias against Christians, some argue. \nA \"Gestapo\" to protect Christian rights, it is, others accuse.",
        "\"A move by former President Trump to build a 'Gestapo' and promote Christian nationalism, believe some users on Reddit's r/economicCollapse community, it is.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ik53tt/15_things_trump_and_his_team_did_this_week/": [
        "A summary, rewritten in the style of Yoda, I shall:\n\nConcern and criticism, filled with comments are. \nDirection of the country, fear of many there is. \nHypocrisy and lies, pointed out by some users, they have. \nPolicies of Trump, impact of great, it will be. \nTariffs on China, imposed by Trump, he has. \nUN institutions, withdrawn from, he has. \nInternational Criminal Court, sanctioned, it is. \nSocial Security benefits, to undocumented immigrants, claimed by Trump, he has.",
        "\"A week in one, 15 actions by the Trump administration, taken were. Concerns about the country's direction, sparking were, withdrawing from the UN, imposing tariffs, and sanctioning the International Criminal Court, including were.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikd3eu/lets_all_agree/": [
        "A universe of economic instability, discuss they do. \nProtests against Elon Musk, posts there are. \nTax filing systems and government agencies, discuss they do. \nCrisis preparation, a topic it is. \nInflation, a concern it is. \nReddit's r/economicCollapse community, a hub it is.",
        "\"A collapse economic, related topics various discusses the article, does.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ij47zd/how_to_explain_what_elon_musk_is_doing_to_low/": [
        "A form of theft, Musk's actions as a government leader could be seen as, a scenario it illustrates. \n\nEliminates unnecessary items, and redistributes the money to elites in the form of tax cuts, he does. \nStealing from customers, essentially it is. \n\nA McDonald's, he takes over, a user on Reddit's r/economicCollapse thread compared Musk's actions to.",
        "\"A McDonald's takeover, like Elon Musk's actions, a scenario it compares; elites to tax cuts, money redistributes; customers and employees, threaten he does.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ik9ou9/do_not_obey_in_advance/": [
        "\"A book, 'On Tyranny' by Timothy Snyder, read you must. \nLessons from the 20th century, 20 in number, it outlines. \nTyranny resist, guidance it provides. \nIn advance obey, do not, the first lesson it is.\"",
        "\"A situation economic current, understand to help it stop, 20 ways, Snyder Timothy's book 'On Tyranny' read, you must.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ik1i49/trump_is_comprising_our_future_with_his_disposal/": [
        "A collapse economic, discusses the article. \nConsequences potential, its and collapse economic, on shares users. \nTopics various, on opinions and concerns, sharing users. \nProtection environmental, and Musk's Elon actions, and Trump's policies, topics are.",
        "\"A collapse economic, discuss users on r/economicCollapse subreddit, they do.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikcu8i/the_mighty_global_south_magas_have_one_thing_in/": [
        "A collapse of the US empire, potential it is. \nPillars three, it has: \nlie and deception, a foundation it is\nUSD, a global reserve currency, status it holds\ncorruption, a cancer it is\nImpoverishment in the West, a consequence it would be\nUSA, included it is\nPosts on r/economicCollapse, discussed they have\ninflation, deflation, and instability, topics they are\nA warning, this is.",
        "\"A collapse of the US empire, potential it discusses, and instability economic and impoverishment in the West, lead to it could.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1ik1apg/why_not_just_grow_stuff/": [
        "A problem, climate change is. \nSolutions, known and quantifiable, they are. \nBut hindered, they are, by wars of culture and a single \"silver bullet\" sought, it is. \nPlants like mangroves, sea grasses, and canes, grow, you must. \nTechnologies like biochar and electric drives, use, you can. \nSoil and crop yields, improve, you will.",
        "\"A silver bullet single does not exist, acknowledges it does, but hinder progress people's desire for simplicity does.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikaeml/white_house_faith_office/": [
        "A summary, rewritten as Yoda, I shall:\n\nConcerns and outrage, users on r/economicCollapse express, they do. \nState and church, separate, they must be. \nInfluence of Russia, a concern, it is. \nActions of Elon Musk and President Trump, questioned, they are. \nCollapse economic, a state, the US is in.",
        "\"A dystopian novel, 'The Handmaid's Tale', to the White House Faith Office, some compare, controversy sparking it is.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ik94fs/dont_bother_arguing_with_maga/": [
        "A summary of the article, I shall provide, young one:\n\nCry to an admin, they do, or block, until \"bless your heart\" said, it is. \nSarcastic and humorous, comments were, from others, including MAGA supporters, to \"go back to sucking Trump's dick\" told, they were. \nStupidity overcome, only an act of liberation, can, a quote from Bonhoeffer, cited, it was. \nPointless, reasoning with stupidity is, posted by Moonscythe4321, that was.",
        "\"Stupidity overcome, external liberation needed is, rather than instruction, argues a Reddit user, it does.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ik22cg/your_struggles_arent_by_accident_theyre_by_design/": [
        "A rigged system, designed to keep the ultra-rich in power, a result of the struggles of the majority, it is. \nCombined, the bottom 90% have less wealth than the top 1%, they do. \nHundreds of times more, corporate CEOs make than their workers, they do. \nCut off the ultra-rich's money, voting for fair wages, and real issues, focus on changing the conversation, and fair taxes and higher wages, demand, organize to.",
        "A system rigged by the ultra-rich, it is, to keep the majority struggling, they have."
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ik1sj6/trump_condones_human_trafficking_by_dismantling/": [
        "A heated debate sparks, it does. \nCritizing his actions, some users are. \nDefending Trump, some users are. \nMissing immigrant children, a topic it becomes. \nBiden administration, during which it happens, it does. \nUSAID dismantling, human trafficking condones, Trump does, claims Silver_Mousse9498.",
        "\"Dismantling USAID, by Trump, human trafficking condones, claims Silver_Mousse9498, a Reddit user, it does.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1ijj13a/noaa_global_monitoring_laboratory_mauna_loa/": [
        "A significant increase from 400.33 ppm 10 years ago and 146.26 ppm since 1800, reached 426.92 ppm at Mauna Loa Observatory in Hawaii, as of January 26, 2025, it has.\nDue to the 2022 volcano eruption, a temporary shutdown, the observatory experienced, but partially resumed operations, it has.\nContinues to monitor atmospheric changes, the observatory does, with other stations in the Pacific Ocean Basin, operating, the Scripps CO2 Program is.",
        "\"A 146.26 ppm increase since 1800, risen to 426.92 ppm at Mauna Loa Observatory as of January 26, 2025, has.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1iisx6l/it_is_not_over/": [
        "A message, posted Dippy_Sticks-3000 did. \nOver, the fight is not, reminded people, they did. \nResilient, strong, and hopeful, stay, they must. \nSilent and fearful, be not, they encouraged. \nLiving and fighting, for rights, keep, they must. \nUpvotes and comments, many, received the post, it did. \nAppreciated the message, people did. \nExperiences and struggles, shared, they did.",
        "\"Difficult times, even in, not over it is, and fighting, power to keep, they have, alive, hope to keep, they must.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1ijgyif/if_you_need_a_healthy_cry/": [
        "A space for coping, the r/CollapseSupport community is. \nUncertainty and anxiety, surrounding the collapse of society, it does. \nSupport to one another, members share and offer, they do. \nPrepare for the long-term, self-care maintain, and emotional toll cope, many posts seek, they do.",
        "\"A community on Reddit, r/CollapseSupport, about is. Collapse of society, impending, thoughts and feelings about share, users do. Support to one another, offer, they do.\""
    ],
    "https://www.reddit.com/r/FBI/comments/1ik17u5/fbi_agent_writes_anonymous_letter_warning/": [
        "A warning, to Americans, the agent wrote. \nFrom the Federal Bureau of Investigation, a significant number of career Special Agents, culled, would be. \nNational security, undermined, it would. \nA dual life, the agent leads. \nAs a devoted family member, friend, and community member, they are. \nBut also, as a skilled operative, they are. \nMissions, high-stakes, numerous, conducted, they have. \nA citizen, from torture, rescued, they did. \nA school shooting, prevented, they did.",
        "\"A culling of career Special Agents from the FBI, planned there is. Less secure, the US will be.\""
    ],
    "https://www.greenstate.com/news/cannabis-carbon-emissions-report/": [
        "A concerning amount of carbon emissions, generated by the cannabis industry's indoor cultivation process, it is. \nEmissions of 10 million cars or 6 million homes, equal to that, they are. \nPractices energy-intensive, the industry's are, including lights, heating, and cooling, they contribute to the problem, they do. \nRegulations demanding plastic tracking tags and child-safe packaging, a problem, they are. \nChange, towards working, some in the industry are, advocating for regenerative practices and sensible legislation, they are. \nCultivation outdoors, shifting more, emissions by up to 76%, reduce, it could.",
        "\"A shift to outdoor cultivation could reduce emissions by up to 76%, with annual emissions equal to that of 6 million homes or 10 million cars, a concerning amount of carbon emissions, generating is indoor cannabis cultivation, suggests a new report.\""
    ],
    "https://i.redd.it/giaerbstwshe1.jpeg": [
        "A webpage, appears to be the article, it does. \nMenu repetitive and login options, with them visible are. \nContent actual, not visible is. \nHeadings \"economicCollapse\" and \"The Empire Self-Destructs\", with them visible are.",
        "\"A navigation menu for a website or app, appears to be the article, it does.\""
    ],
    "https://i.redd.it/ktilg4ssvohe1.png": [
        "A break, catch to struggle, current generation is. \nProvided, not in given text, actual content of article is.",
        "\"Achieve stability and success, struggling to, current generation is, why discusses the article.\""
    ],
    "https://www.nytimes.com/2025/02/06/climate/epa-environmental-justice-workers-leave.html": [
        "A summary, rewritten as Yoda, I shall:\n\n\"Leave, on EPA workers, being put, they are. \nClose, the office, President Trump, expected to. \nHelp, to poor and minority communities, programs cutting, he is. \nDisproportionately affected, by pollution, they are.\"",
        "\"A leave on workers, putting it will, office that assists communities polluted heavily, close an expected is Trump, President.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ik655f/fight_back_against_the_famine_that_is_being/": [
        "A tool of control, deliberate, used throughout history, it is. \nDependence, into break, populations, it does. \nScattering of farm workers and water management, irresponsible, a famine, manufactured, it is. \nCognitive dissonance, normalization of crisis, and information overload, a recognition, of the orchestrated nature, prevent, they do. \nGiftToTheUniverse, a warning, gives, it does.",
        "\"Control and dependence, into them forcing, is information overload, crisis normalization, cognitive dissonance, and resource mismanagement through deliberate, it is.\""
    ],
    "https://www.newsweek.com/texas-democrat-bring-first-articles-impeachment-trump-second-term-2026701": [
        "A crime against humanity, Trump's comments are. Joined by other lawmakers, Green is. Three times before, Trump impeach attempted, Green has. Two weeks into second term, Trump is. Fastest impeachment effort, this is. Against humanity, a crime, Trump's comments are.",
        "\"A threat of 'ethnic cleansing in Gaza' made, President Donald Trump did, against Israeli Prime Minister Benjamin Netanyahu, with news conference, during.\""
    ],
    "https://www.newsweek.com/new-executive-order-donald-trump-sanction-international-criminal-court-2027371": [
        "\"A second time, sanctioned the court, the Trump administration has. \nIn Afghanistan, alleged US war crimes investigated, its probe into. \n2020, an order targeting, it was. \nUS citizens or allies, investigated, ICC's probe of. \nAssisting in investigations, individuals, financial and visa sanctions on, will implement. \nTensions over jurisdiction and accountability, amid, the order is. \nUS, Israel, and its allies, targeted, the ICC is. \nSigned an executive order, Trump has.\"",
        "\"Amid ongoing tensions over jurisdiction and accountability, targeting the United States, Israel, and its allies, the International Criminal Court for, sanctions to impose, an executive order signed, Trump Donald President.\""
    ],
    "https://www.reddit.com/gallery/1ik2bkx": [
        "A demonstration massive and peaceful, against their government, Slovakians are protesting. Led by Fico, the government is, a change they are seeking. Effective in achieving their goals, pacifism can be, discuss commenters are. Twice as likely to succeed, nonviolent protests are, statistics suggest. A threshold of 3.5% of the population, a key factor in bringing about change, it is. Gaining momentum, the protests are, 20,000 people attending a demonstration in Kosice, around. The second-largest city in Slovakia, Kosice is.",
        "\"A change achieving, pacifism in effectiveness discussing, some users are. Against their government, protesting Slovakians are.\""
    ],
    "https://v.redd.it/llf4x5iudqhe1": [
        "A shock international, sparking was the bombing by Israel of a hospital in Gaza on October 17, 2023. \nDamaged or destroyed, 147 hospitals and clinics have been since 2008, a history of attacking medical facilities and personnel in Gaza, Israel has. \nKilled or injured, 145 medical workers have been, a condemnation by Amnesty International, the bombing has. \nWar crimes, possible, an investigation independent international, called for has Amnesty International.",
        "\"A hospital in Gaza, bombed by Israel on October 17, 2023, was, international shock sparked and war crimes allegations added to, it did.\""
    ],
    "https://www.dailyructions.com/start-spreading-the-news-no-more-chauffeured-suv-chancellor-cheng-drives-himself-to-community-college-legislative-breakfast-in-vehicle-with-new-york-license-plates/": [
        "A breakfast legislative, to drove himself, did Chancellor Terrence Cheng. \nPlates of New York, on a vehicle, were. \nA motion of \"no confidence\", adopted, the CT State College Senate had. \nA day after, this, was. \nA car of the state, provided, was. \nChauffeured rides, expensed, despite this, he did. \nMeals pricey, with state employees, charged, he did. \nA change in behavior, this is. \nAudits and reviews, found, they did. \nAn expense account, promiscuous use of, made, he did.",
        "\"A legislative breakfast, to, drove himself to, he did, with New York license plates, a vehicle in, facing a \"no confidence\" vote, Chancellor Terrence Cheng was.\""
    ],
    "https://stopproject2025comic.org/": [
        "A roadmap for Trump's agenda, claim creators of \"Mandate for Leadership: The Conservative Promise\" they do. \nSilence and exclude certain groups, the plan aims to. \nComics made to explain and oppose, have been. \nVote against it, readers urged to. \nA second Donald Trump presidency, serve as a roadmap Project 2025 does. \nThe ultra-conservative Heritage Foundation and former Trump staffers, created the plan they did.",
        "\"A plan to shut down dissent and opposition, created by the ultra-conservative Heritage Foundation and former Trump staffers, Project 2025 is.\""
    ],
    "https://mkorostoff.github.io/1-pixel-wealth/": [
        "A summary, rewritten in the style of Yoda, I shall:\n\nInaccessible for public benefit, the wealth of the super rich is not. \nTied up in stocks, it is not. \n$3.2 trillion, the collective wealth of Jeff Bezos and the 400 richest Americans is. \nA scale of wealth, vast and staggering, it is. \nVisual aids, used to demonstrate, they are. \nGlobal issues, pressing, the wealth could address. \nVaccinating every human, against coronavirus, $200 billion could do. \nMalaria, permanently eradicating, $100 billion could achieve. \nA fraction of the total wealth, these costs are. \nSix percent, the cost of vaccination is. \nThree percent, the cost of eradicating malaria is.",
        "\"A global humanitarian crises such as vaccination and malaria eradication, address could, if a small portion of the wealth controlled by the top 400 Americans, used were.\""
    ],
    "https://i.redd.it/wyxxz6b6qqhe1.jpeg": [
        "A summary, rewritten as Yoda, I shall:\n\nDown -70 points, the S&P 500 is, currently. Impact the S&P 500, may tariffs reciprocal, plans to announce, Trump plans to. Friday, as early as, announce, he will.",
        "\"Friday as early as, announce reciprocal tariffs, plans to, Trump Donald President.\""
    ],
    "https://www.forbes.com/sites/omerawan/2025/02/06/new-type-of-bird-flu-emerging-in-us-dairy-cattle-sparking-health-concerns/": [
        "A pandemic potential, concerns sparking are. \nIn Nevada, dairy cattle, detected D1.1 variant has been. \nDistinct from B3.13 genotype, this variant is. \nLinked to human death, it has been. \nSevere illness in teen girl, in British Columbia, caused it did. \nSpread through contact, fluids, or dust, it can. \nFever, cough, and fatigue, symptoms it causes. \nMortality rate, up to 50%, in severe cases, it has.",
        "A pandemic potential, concerns sparking are, after a man in Louisiana and a teen girl in British Columbia infected, D1.1, a new variant of the H5N1 bird flu, has."
    ],
    "https://www.reddit.com/gallery/1ij5dyp": [
        "A dire economic situation, in Argentina, the current is. \nBelow poverty levels, over 50% of the population, living are. \n117% in December, an inflation rate, there is. \nPolicies, criticized for, the president, Javier Milei, has. \nWomen and girls, protections rolled back, for them, he has. \nCollapse, economic, in the US, a potential, it is. \nDepression, severe, economic, a prediction, some make.",
        "\"A collapse economic potential, facing is the US, with crisis economic current Argentina's to it comparing are some users.\""
    ],
    "https://fortune.com/article/bankrate-emergency-savings-report-2025/": [
        "A \"paycheck-to-paycheck\" society, the nation is. \nHigh inflation, low wage growth, and challenging job markets, exacerbated by this trend are. \n$8 trillion in total U.S. consumer debt, a record-high, there is. \nDeclining credit scores, a result of this, they are. \nNo emergency savings, 27% of respondents have. \nLess than in previous years, 73% of respondents save. \nA financial strain, the country's, it highlights. \n$1,000 expense, 59% of Americans cannot cover.",
        "A strain financial, in the country growing, is."
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ijg9nr/how_can_anyone_deny_it_now/": [
        "A task force to eradicate anti-Christian bias, create Trump has. \nCriticism and ridicule, widespread on the r/economicCollapse subreddit, there is. \nConcerns about the separation of church and state, many users express. \nPersecution complexes, fueling the dangers of, a potential it is.",
        "\"A task force to eradicate anti-Christian bias, create an executive order to, signed Donald Trump has.\""
    ],
    "https://v.redd.it/up6kfokrinhe1": [
        "A response to strained relations, removing all US alcohol from provinces, Canada is considering. \nIndependent from the US, more, become, Canadians are seeking. \nThe EU, join, a possibility, exploring, they are. \nChanges significant, make, the US must, trust regain, to. \nFrustration with the US, many commenters are expressing. \nEducation poor, safety nets social, law enforcement, issues, they are citing.",
        "\"A significant change, make the US must, to protect its citizens, it needs, strained relations with the US, citing, Canada is.\""
    ],
    "https://www.theguardian.com/environment/2025/feb/06/hottest-january-on-record-climate-scientists-global-temperatures-high": [
        "A pattern La Niña, cooling the Pacific tropical, does. \nHighs unprecedented, a run of extending, it is. \nLevels preindustrial, above 1.75C, temperatures global, been reported, have. \nJanuary a record-breaking, been, has.",
        "\"Above preindustrial levels, 1.75C global temperatures were, on record the warmest January, reported the Copernicus Climate Change Service.\""
    ],
    "https://www.reddit.com/r/OptimistsUnite/comments/1ikao98/dont_panic/": [
        "A universe of uncertainty, we live in. \n\nControl over what can be controlled, maximize you must. \nDoomscrolling, a path to darkness it is. \nEngage with others, perspective you will gain. \nCommunity, build you must. \nCare for yourself and others, a priority it is. \nFinances and health, in order they must be. \nPrepare for difficult times, you must.",
        "\"A difficult future, prepare for, you must. Care for yourselves, finances, and communities, take you must. Solidarity and positivity, focus on, you should.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ijkedn/what_if_project_2025_is_completed_and_usa_becomes/": [
        "A new society, rebuild, they would. \nCollapse, accelerate, to rebuild, some joked. \nDictatorship, Christian, with technocratic bent, a possibility, it is. \nGangs and militias, rise, they would. \nChaos, ensue, it would. \nPower, rich techno-oligarchs, hold, they would. \nDictatorship, in USA, a possibility, it is. \nProject 2025, a hypothetical scenario, leads to, it would.",
        "\"A new government and a rebuilt society, potentially leading to, chaos, gangs, and militias, Americans may resort to, a US dictatorship, if Project 2025 leads to, speculate that, users on the r/economicCollapse subreddit do.\""
    ],
    "https://stocks.apple.com/AM4ceMixLSl2ZJPuAVrAITw": [
        "A webpage broken, appears the article to be. \nLinks repeated and copyright information, with no content or story, it has. \nSummarize, nothing to, I am.",
        "\"A broken webpage with repeated links and copyright information, appears to be the article, it does.\""
    ],
    "https://reviewdiv.com/trump-forms-doj-task-force-to-combat-anti-christian-discrimination/": [
        "Unavailable temporarily, the server is. Shortly back check, please. Persists the issue, Support Technical contact, you must.",
        "\"Unavailable temporarily, the server is. Shortly back check, or support technical contact, if persists the issue.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ijtlox/and_ive_given_myself_a_25year_period_laughter_and/": [
        "A long time in office, 25 years, President for, expects he does. \nConcern and outrage, widespread, sparking it has. \nRemoved from office, he must be, some users call. \nQuestioning his mental state, others are.",
        "Concern and criticism widespread, sparking did he, 25 years President, be for expects he, stated Trump President."
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ik5ywj/why_is_no_one_talking_about_south_korea/": [
        "A widely reported, not being, is South Korea's impeachment of two presidents and resistance to a coup, why, a user asks. \nMusk and the US government, against protests, various economic and political issues, others discuss.",
        "\"A model for democratic resistance against a coup, significance it has, yet little to no mainstream coverage, why there is, Binnie_B, a Reddit user, questioning is.\""
    ],
    "https://www.wfsb.com/2025/02/07/state-senators-call-more-transparency-cscu-system-after-i-team-report/": [
        "A summary, rewritten in the style of Yoda, I shall:\n\n\"Behind closed doors, made entirely, the re-organization of community colleges was. Concerns, expressed by Senator Jeff Gordon, he has. Taxpayer money, involved it is. Affects the state government, it does. Announced by CT State president John Maduko, the plan was. Unclear, the details of the decision-making process remain. An error in judgment, the Chancellor's actions were.\"",
        "\"A plan re-organization major was made doors closed behind, without discussion public or approval, revealed investigation I-Team an, system CSCU and Universities State Connecticut in transparency more for calling are senators State.\""
    ],
    "https://i.redd.it/zrz8exdh7ohe1.png": [
        "A summary, I shall provide, young Padawan:\n\n\"Psychologically played, we are being, a possibility, it is. \nContent of the article, not provided, it is.\"",
        "\"A collapse economic, during manipulated psychologically be, possibility of discusses the article.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ijmqyb/we_do_have_a_voice/": [
        "A system economic and administration current, resist ways to discuss they do. \nBoycotting companies that oligarchy support, ways to find they are. \nSearch engines alternative and browsers, use they must. \nInternet access unwanted, block steps to take they can.",
        "\"A collapse economic, instability and manipulation government, concerns about citing they are."
    ],
    "https://i.redd.it/2kcm2nk36lhe1.jpeg": [
        "A social media post, appears to be the article. \nRepeated navigation menus, with it has. \nA phrase repeated, \"That is not his property to sell..\" is. \nEconomic collapse and property ownership, about a discussion it suggests.",
        "\"A social media post with repeated navigation menus and a statement about economic collapse and property ownership, appears to be the article.\""
    ],
    "https://i.redd.it/ffd3ce37dfhe1.png": [
        "A plea for economic collapse, suggesting frustration or desperation, it does. \nLinks to navigate repeatedly, a social media post with, it appears to be.",
        "\"A repetitive and humorous expression of frustration with an economic collapse, the article appears to be.\""
    ],
    "https://www.theguardian.com/environment/2025/feb/06/trump-epa-lee-zeldin": [
        "A new vision for the EPA, outlined the Trump administration has. \nPrioritizing artificial intelligence, industry lobbyists, and staff cuts, it is. \nThe climate crisis, downplayed it has. \nA new EPA administrator, Lee Zeldin, set five \"pillars\" for the agency, he has. \nThe US the AI capital of the world, make it will. \nAmerican energy dominance, bolster it must. \nThe auto industry, a great comeback, ensure it will. \nThe climate crisis, no mention of it there is. \nProtecting public health and the environment, forgotten it has.",
        "\"A vision outlined has, Lee Zeldin, downplaying the climate crisis and traditional environmental protection, while industry lobbyists and staff cuts prioritizes, artificial intelligence it does.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ik47ej/have_any_of_the_media_affiliates_who_endorsed_the/": [
        "A summary, rewritten as Yoda, I shall:\n\nCoup-like behavior, alleged, the administration's is. Bypassing Congress, it has done. Regret, from media affiliates, there is. Criticizing, some users are. Discussing, the administration's actions, they are.",
        "\"A collapse economic, potential for it there is, and authoritarianism, a path to it, the administration's actions, a concern, they are.\""
    ],
    "https://v.redd.it/95uh4jus7qhe1": [
        "A repeat of historical atrocities, potential it is. \nConcerns sparking, a GOP Defense Secretary's suggestion has. \nAt Guantanamo Bay, captive children and families, hold they suggested.",
        "\"A captive at Guantanamo Bay, held could be, families and children, suggested the Defense Secretary of GOP.\""
    ],
    "https://i.redd.it/1lki827wpnhe1.jpeg": [
        "A plan for peace in Ukraine, Trump's leaked document revealed. \nSpecified, the details of the plan are not, in the provided text.",
        "\"Revealed Trump's Ukraine peace plan, a leaked document did.\""
    ],
    "https://i.redd.it/43onmqt9rkhe1.jpeg": [
        "\"A database and computers of US Treasury, allegedly accessed by a DOGE intern, there is.\"",
        "\"Accessing the US Treasury's computers and database, allegedly a DOGE intern is.\""
    ],
    "https://i.redd.it/5zvflm0ejrhe1.jpeg": [
        "\"A message posted, has the Vice President of the United States. Viewed and commented on, can it be. Collapse economic, a message about, it is.\"",
        "\"A message important, regarding collapse economic, has the Vice President of the United States of America.\""
    ],
    "https://www.reddit.com/r/jobs/comments/1ijwbny/musk_and_his_crew_took_my_job_from_me/": [
        "A house buying and student loans paying off, dreams of they had. \nPaycheck to paycheck living, $20,000 a year making, they were. \nStability financial, a devastating blow to, it was. \nGrant federal, cut off by Musk's actions, it was. \nOffer job, rescinded, it was.",
        "\"Meet ends make to struggling, Musk's takeover of system payment treasury the caused by layoffs, rescinded offer job their had user Reddit a.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikdkce/im_a_georgist_curious_as_to_why_the_rent_is_too/": [
        "High too damn is the rent, a perspective shared it was, by a user on the r/economicCollapse subreddit, it was.\nSpeculation of land and NIMBYism, the cause it is, attributed by the user, they were.\nTheories of Georgist economic, help they can, understand collapse economic modern, it does.",
        "\"A theory economic, Georgism, learn about, you must. NIMBYism and land speculation, high cost of rent's cause, they are.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ijti4q/the_united_states_on_its_way_to_becoming_a/": [
        "A technocracy, the United States is becoming, says a Reddit user. \nControl the system, the tech elite will, according to this plan. \nA \"Network State\" to create, they are, with digital-first communities as sovereign entities. \nBlockchain technology and cryptocurrencies, they will leverage, to operate. \nA threat to democracy, this is, warns the user. \nThe working class, oppress, the tech elite may, with AI and robots, like Judgement Day, they will.",
        "\"A technocracy, becoming the United States is, on its way to, bypassing democracy and traditional institutions, potentially it will, blockchain technology and cryptocurrencies, leveraging as a sovereign entity, a Network State, will.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ijz08g/family_financial_planning_for_withdrawing_from/": [
        "A plan comprehensive to withdraw from the economy, reduce spending, and maximize self-sufficiency, seek the user on r/economicCollapse does. \n\nIn preparation for economic collapse potential, genuinely interested the OP is. \n\nHigh-interest loans and credit cards, pay off suggests one commenter. \n\nIn the woods, live jokingly mentions another commenter. \n\nOff-grid skills into daily life, integrate genuinely interested the OP is.",
        "\"A comprehensive plan to withdraw from the economy, pay off debts, and maximize self-sufficiency in preparation for potential economic collapse, seek a user on Reddit's r/economicCollapse community, they do.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ijzyrc/we_ride_at_dawn_hell_we_are_the_dawn/": [
        "A reading by Neko Case, attended No_Piccolo6337 did. \nImportance of joy, discussed Case did. \nChallenges economic and social, against mobilize we must. \nDespair and hopelessness, felt No_Piccolo6337 did. \nSadness, reasons to seek out, counterproductive it is. \nPoints of light, in darkness look we must.",
        "\"A reading by Neko Case in Portland attended, I did. Challenges economic and social, against mobilize and joy find, she emphasized.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ik30bw/so_much_has_happened_i_need_help_compiling_a_list/": [
        "\"A list of events and actions, compile they are seeking, Trump, Musk, and the administration, since the inauguration, by a user on r/economicCollapse, they are. \n\nInformation overwhelming, and track keeping difficult, it is, they say.\"",
        "\"A list of events and actions taken by Trump, Elon Musk, and the administration since the inauguration, compile a user on Reddit's r/economicCollapse community is seeking help.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ik2qqr/i_hope_senator_after_you_lost_and_the_empire/": [
        "A collection of posts from r/economicCollapse, appears to be the article. \nRelated to economic collapse, various topics are discussed. \nInflation, deflation, financial system instability, and government actions, including are. \nAgainst Elon Musk, protests are. \nSystems of tax filing, about discussions are. \nCrisis economic, potential for, about are.",
        "\"A collection of posts from r/economicCollapse, discussing instability, actions, and unrest, the article appears to be.\""
    ],
    "https://www.bbc.com/news/articles/cn938ze4yyeo": [
        "A collapse of Amoc, potential it is. \nWinters freezing, the UK could experience, warn scientists they do. \nFrom the tropics, warm water brings, Amoc does. \nThe North Atlantic, to it goes. \nA slowdown or collapse, a \"tipping point\" it would lead to. \nIrreversible, the circulation would be, beyond which it would not return. \nTemperatures drop, significant it would be, in the UK and north-west Europe.",
        "\"A collapse of the Atlantic Meridional Overturning Circulation (Amoc), a key ocean current that brings warm water from the tropics to the North Atlantic, due to a potential collapse of the Amoc, plunging temperatures and freezing winters the UK could experience, warn scientists.\""
    ],
    "https://www.ladbible.com/news/world-news/scientists-computer-modelling-technology-ai-society-collapse-920494-20250207": [
        "A collapse of human society, predicted by scientists at MIT, they were. \nIn 1972, computer modeling used, they did. \nAround 2040, or 17 years from now, occur it would. \nRidiculed initially, they were. \nSupported by subsequent studies, the predictions were. \nIn 2009 and 2021, further research done, it was. \nA choice to avoid collapse, still available, it is. \nThrough innovation and sustainable practices, the path forward, it is.",
        "\"Around 2040, collapse society will, predicted in 1972, MIT scientists at.\""
    ],
    "https://newrepublic.com/article/190850/coming-war-dissent": [
        "A repressive playbook, test run it was. Free speech and civil rights, suppress they are trying. Five years in prison, a minimum sentence it carries. Domestic terrorism, a felony it is. Activism and dissent, a crackdown on it there is. A massive police training center, in Atlanta it is being built. The \"Stop Cop City\" movement, a protest campaign it is. Arrested and held, Kautz and his roommates were. Four days, they were held for.",
        "\"A massive police training center in Atlanta, construction of, against protest campaign a, 'Stop Cop City' movement, related to investigation a, money laundering and charity fraud, for days four, held they were, arrested and, Kautz Marlon and roommates his.\""
    ],
    "https://www.alternet.org/democracy-weeks-away-from-disintegrating-democratic-senator-issues-warning-and-a-plan/": [
        "A dire warning, Chris Murphy gives: disintegrating, democracy is, weeks away from. \nDismantle the government, Trump and Musk attempt to. \nSensitive records and personal information, access they seek. \nOf American citizens, the targets are. \nDemanding answers, Democrats are. \nLeaders of their party, out of touch, some say they are. \nThe severity of the situation, they do not understand. \nLeading the battle, Murphy is. \nAgainst Trump and Musk, he fights. \nA real leader, some praise him as.",
        "\"Away from disintegrating, democracy is, weeks, mere, warns Senator Murphy, Chris, a Democratic, he.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1iix2lc/warming_accelerates_to_175_whilst_in_the_cooling/": [
        "A future bleak, the planet's, pessimism expressed, some Reddit users did. \nHumans gone, the Earth better off, one user suggested. \nInherit the planet, animals might, others proposed, crows, dolphins, or bonobo chimps. \nRemoved from government websites, global warming, ordered, President Trump did. \nAccelerated to 1.75C, global warming has, a recent study found.",
        "\"A removal of global warming, ordering is Trump, President. Accelerated to 1.75C, warming global has.\""
    ],
    "https://i.redd.it/te97aofn1mhe1.png": [
        "\"A rejected, evidence of war crimes in Palestine, Trump has. \nSanctioned, the International Criminal Court, he has. \nFurther inhumane and uncontrolled actions, by the government, there will be.\"",
        "Sanctioned the International Criminal Court, has Trump, and rejected evidence of Israeli war crimes in Palestine, he has."
    ],
    "https://reviewdiv.com/texas-representative-calls-for-trumps-impeachment-after-gaza-takeover-comment/": [
        "A \"dastardly deed\" it is, says Green, of Trump's comment about Gaza, a threat to justice everywhere, it signals. \nHigher the stakes are, this time, insists Green, from office, Trump, remove, he must. \nA \"grass-up movement\" it is, that citizens, demand accountability, they must. \nFirst time, not this, is, Green's attempt, to remove Trump, from office, a try, he has made.",
        "\"A remark controversial, about Gaza, Trump made, taking over, the US, said he would, impeachment articles, introduced, Green has.\""
    ],
    "https://www.businessinsider.com/layoffs-job-market-outlook-hiring-companies-worker-job-cuts-2025-2": [
        "A shifting job market, may be, suggests this trend. \nExpected, fewer than, jobs in January, 143,000, adding the economy, despite, could accelerate, layoffs, signs flashing, the US job market, is.",
        "\"A year this, accelerate layoffs could, signs flashing the market is.\""
    ],
    "https://www.reddit.com/r/fednews/comments/1ijm44h/this_is_what_a_dictatorship_looks_like/": [
        "A summary of the article, I shall provide, young Padawan:\n\nChanged fundamentally, operations have, and speak up, many are afraid to. \nOrders obeying, with protecting the Constitution, balance how to, questioned they have. \nThe oath of office, discussed they did, and orders lawful and unlawful, the difference between, they spoke of. \nDisobey orders that contradict the Constitution, importance of, they emphasized, with historical examples, such as the Nuremberg trials, referencing they did.",
        "\"A discussion about the importance of upholding the Constitution and disobeying unlawful orders, sparking is. Orders unlawful, disobeying and the Constitution upholding, importance of, a discussion about, sparking a US Army veteran, it does.\""
    ],
    "https://www.nytimes.com/2025/01/31/us/trump-water-california-central-valley.html?unlocked_article_code=1.tk4.WpDP.LNFvO5eZas__&smid=url-share": [
        "\"A free account with it, continue reading you can. Updated Terms of Sale, Terms of Service, and Privacy Policy, review them you must.\"",
        "\"A granted access to an article from The Times, you have been.\""
    ],
    "https://v.redd.it/quv2hyydeshe1": [
        "A summary of the r/economicCollapse community, I shall provide. \n\nCollapse economic, a topic of discussion, it is. \nInflation and deflation, instability of the financial system, debt, and preparation for crisis, discussed, they are. \nPosts recent, protests against Elon Musk, the US Treasury, and the Senate, include, they do. \nTax filing systems and social security numbers, discussed, they are. \nImpeachment of the president, a topic of discussion, it is.",
        "\"A collapse economic, topics various discusses the article, with events current to reactions and opinions sharing many users, preparation crisis and debt, instability system financial, inflation and deflation, including.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ik6h2p/show_some_respect/": [
        "A summary of the article, I shall provide, young one:\n\nRespect, show more people should, despite grievances, the user suggested. \nWorking class, of treatment, criticized the user, and economy, of handling, disrespected. \nAllies, billionaire, and President, of disrespect, expressed frustration, the user did.",
        "Hardship economic and inequality, led to have policies and actions, criticizing are, allies billionaire and President, disrespect and frustration, expresses a user Reddit."
    ],
    "https://news.bloomberglaw.com/business-and-practice/unitedhealth-hires-defamation-firm-to-counter-social-media-posts": [
        "A summary, rewritten in the style of Yoda, I shall:\n\nDenied coverage, UnitedHealth did not, claims a doctor, Elisabeth Potter, on Instagram, she does. Posts inaccurate and irresponsible, they are, says UnitedHealth, to counter them, a law firm, Clare Locke, it has hired. A settlement, landmark, the firm has won, for Dominion Voting Systems Inc., it has represented. Apologize and correct, Potter must, demands the law firm, UnitedHealth's reputation, to protect, it seeks.",
        "\"A prominent defamation law firm, Clare Locke, hired has UnitedHealth Group Inc. to counter, it sees as inaccurate and irresponsible social media posts about its practices, following the high-profile death of an executive.\""
    ],
    "https://projects.propublica.org/claimfile/": [
        "A universe of claims, in the dark side of insurance, exists. \n\nPay for treatment, insurers decide, with information in claim files, they use. \nRequest it, most people in the US can, a right, it is. \n\nDenials, overturn, a chance, there is, with claim files, the path, it shows. \nInternal correspondence, phone call recordings, and more, in claim files, found, they can be. \n\nRequest a claim file, you must, questions answer, a PDF generate, mail or fax, to the insurer, send, you must. \nWait, you must, 30 days, a response, you will get.",
        "Critical in appealing denials, requesting one can be, and for medical treatment, pay to decide whether insurer to, information used by a collection of, claim file a is."
    ],
    "https://electrek.co/2025/02/06/tesla-cfo-chairwoman-and-elons-brother-sold-tens-of-millions-worth-of-tsla-stocks/": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\n Sold, tens of millions of dollars worth of Tesla stock, have Vaibhav and Denholm. \n Sold, 7,000 shares for $2.7 million, Vaibhav has. \n Sold, 112,390 shares for $43.2 million, Denholm has. \n Sold, 75,000 Tesla shares for $27.5 million, Kimbal Musk is. \n Linked to stock option liquidation plans, all three transactions are.",
        "\"A liquidation plan, not linked to, sales are. Millions of dollars, tens of, worth of Tesla stock, sold have.\""
    ],
    "https://imgur.com/a/8pmeXgx": [
        "A post on Imgur, a meme-sharing platform, appears the article to be. \nOntario's power grid about a quote, and a photo of Daniel Day-Lewis as Bill the Butcher from Gangs of New York, images and memes various featuring it does.",
        "Posts and memes various, featuring a page on Imgur, a website-sharing meme, appears to be the article."
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ik68er/wheres_the_other_playbook/": [
        "A collapse of the economy, inevitable it is. \nNo plan in place, there is. \nCaused by unemployment in the public sector, it will be. \nDepressing wages and spending, it will. \nForeign actors, emboldened they will be. \nActions aggressive, they will take. \nDeaths preventable, there will be. \nLife expectancy, a decline it will have. \nInfant and maternal mortality, a rise it will have. \nShortages of food, water, and power, possible they are. \nDegraded, institutions such as elections, courts, and bureaucracy will be.",
        "A collapse economic, potential, discusses the article."
    ],
    "https://gizmodo.com/nasa-ordered-to-remove-anything-about-women-in-leadership-from-its-websites-report-2000559596": [
        "A reversal, I shall do:\n\n\"US in the best employers for diversity, one of the, NASA was. \nWorkforce of minorities and women, 35% and 30% composed, it was. \nInclusion, equity, and diversity, scrubbed from websites, it has. \nCommittees paused, diversity programs canceled, they have. \nTerms of diversity and women in leadership, removed, they must. \nAgencies federal, target diversity and inclusion, President Trump's efforts are.\"",
        "\"A move to comply with President Donald Trump's executive order targeting diversity and inclusion programs, as part of a move to, NASA has been ordered to, remove any references to 'women in leadership' and other diversity-related terms from its websites, it must.\""
    ],
    "https://i.redd.it/svy3gflbpqhe1.jpeg": [
        "A navigation menu for an online platform, appears to be the article. \nFeatures various, such as logging in, viewing posts, and commenting on articles, options to access have. \nCollapse economic and lumber related, articles on commenting, viewing posts, and logging in, options for accessing are.",
        "\"A navigation menu for a website or app, appears to be the article, it does.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ik5byg/truth/": [
        "A universe of economic instability, discussing the r/economicCollapse community is. \nProtests against Elon Musk, posts of concern are. \nThe US financial system and government agencies, worries about have. \nCrisis preparation, a topic of discussion it is.",
        "\"A collapse economic, discuss community r/economic on Reddit, they do.\""
    ],
    "https://v.redd.it/edy22fsib8he1": [
        "A discussion, there is, on r/Arkansas_Politics, of Arkansas politics, various topics, including criticism of President M*sk, government departments, and the state's politics, related to.",
        "\"A discussion of Arkansas politics, related to various topics, including support for progressive policies and criticism of President Joe Biden, on the r/Arkansas_Politics subreddit, users are.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1iijymy/with_everything_falling_apart_in_the_us_what_can/": [
        "A long-term survival scenario in the US, preparing for, they are. Falling apart, everything is. Advice sought, they are. Stable careers, communication networks, and self-sustaining lifestyles, practical and realistic suggestions, they need. Land buying, a commune starting, or skills like distillation and electricity generation, investing in, they consider. The community responds, various suggestions, it does. \"Beyond Collapse,\" the book, reading, they are told. Non-perishable food items, stockpiling, they are advised. Sewing and welding, skills, learning, they are encouraged. Physical and mental health, focusing on, they are reminded.",
        "\"A long-term collapse in the US, prepare for it, how to, seeking advice on, a user is.\""
    ],
    "https://www.bbc.com/news/articles/clykpgxm4n7o": [
        "Confirmed, Russell Vought has been, head of White House budget office, new, he is. \nControversy surrounding his role, there is, despite confirmed, he has been. \nProject 2025, a wish list, it is, of conservative priorities, for President Trump's second term, it was. \nAuthor of Project 2025, he was, controversy surrounding his role, there is.",
        "Confirmed as head of the White House budget office, Vought Russell is, by the US Senate."
    ],
    "https://www.thebulwark.com/p/the-story-of-us": [
        "A proposal, Trump's, to control Archives National, discussed is. \nSnitched on him, the agency did, believes Trump, a motive for revenge, it is. \nLoyalists, replace officials qualified, with the goal of controlling history and future, Trump's desire is.",
        "\"A case against him, handled the agency did, revenge against it, Trump's desire for, a proposal to take control of the National Archives, Trump's, discussed is.\""
    ],
    "https://i.redd.it/cahqbsj4jnhe1.png": [
        "A post in discussed, the state of the economy, was. Critic social and academic MIT, a, influential, was.",
        "Discusses the state of the economy, a critic social and influential, academic MIT of, the."
    ],
    "https://i.redd.it/acq8xbjlb5he1.jpeg": [
        "Benefit his constituents, working across party lines Sen. Hawley does. \nA bill sponsoring, he is. \nGratitude expresses, a Missouri constituent does. \nUnusual, bipartisan cooperation is.",
        "\"Differences political, despite, constituents his, helped that bill a sponsoring for gratitude expresses constituent a Missouri.\""
    ],
    "https://v.redd.it/n8gvza8xwqhe1": [
        "A king, like, Trump is acting, weak to govern like a president, he is. Power he doesn't have, but convince people he does, a threat it is. \nA fire hose of crap, use he does, fatigue the public, it does. \nPropaganda techniques, authoritarian regimes use, like, Trump's tactics, they are.",
        "\"A king, like, Trump is acting, because weak to govern, he is, a president.\""
    ],
    "https://www.euronews.com/green/2025/01/06/breakneck-speed-renewables-reached-60-per-cent-of-germanys-power-mix-last-year?utm_source=Twitter&utm_medium=Social": [
        "\"A topic not about, this article is. \nInitially appears to be, a different topic it does. \nCookies and data processing, by website and partners, a disclaimer about. \nMeasuring audience, advertising personalized, and studies marketing, purposes of partners 887, there are.\"",
        "\"A year prior, power mix of the country, 60% accounted for, renewable energy sources of Germany, discusses the article.\""
    ],
    "https://i.redd.it/qilcvbsmvihe1.jpeg": [
        "Deny similarities to many too, there are. \nStatement made, that is. \nCollapse economic, mentioned it is. \nOptions login and menu repetitive, followed by webpage or post social media, a appears the article.",
        "\"A repetitive list of navigation options and a mention of 'economicCollapse' with a comment section, the article appears to be.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1iiiayg/bluestate_emergency_coalition/": [
        "A summary of the article, I shall provide, young Padawan:\n\n\"Support and expressed many users have, governors contacted their already have, action taking are some governors, coalitions existing and sharing information on, they have. \nEmergency State declare and cooperation refuse with federal directives unlawful, aims the coalition to. \nStability economic and democracy protect, overreach federal counter, coalition form to urge Democratic Governors, made has been the call to action.\"",
        "\"A counter to federal overreach and protect democracy, proposed is a coalition of Democratic Governors, with 23 Democratic Governors and 4 US territories and DC already part of the Democratic Governor's Association.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ijzn8x/medical_debt_was_set_to_be_eliminate_from_credit/": [
        "A pause on new regulations, Trump's has. \nIndefinitely on hold, the plan to eliminate medical debt from credit reports is. \nWork at the Consumer Financial Protection Bureau, paused the Treasury secretary has. \nMarch, the elimination was set for.",
        "\"A hold indefinitely, on reforms to remove debt from credit reports, put they have."
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ijzn78/rauitrades_whistleblower/": [
        "A universe of economic instability, discussing the r/economicCollapse community on Reddit, we are. \nTopics various, related to economic instability, including inflation, deflation, and financial system issues, they are discussing. \nPosts range from protests against Elon Musk and the US Treasury, to discussions about tax filing systems and economic collapse, the potential for, they are.",
        "\"A collapse economic, related topics various discusses the article, Musk Elon and government US the against protests, transfers wealth and manipulation market including.\""
    ],
    "https://i.imgur.com/T2E2fB1.jpeg": [
        "A photo of a cat, on Imgur, a post shows it does. \nStupid prizes win, stupid games play, the phrase says it does. \nSwasticars to, say 'NO' to, the caption demands it does.",
        "\"A post on Imgur, appears to be the article, it does.\""
    ],
    "https://www.fisu.net/2025/02/05/the-future-of-winter-sports-in-a-warming-world/": [
        "A threat, the sustainability of winter sports is, under threat increasingly, due to snow cover declining and training schedules disrupted, it is.\n\nA solution, temporary, artificial snowmaking is, but costs environmental, significant, it has.\n\nSpoken out, top athletes and a study have, negative impact of climate change, on their sport, it is.\n\nEffects of climate change, mitigate, innovations and solutions green, being explored, they are.\n\nSystems snowmaking, powered by energy renewable, and planning infrastructure sustainable, explored, they are.",
        "Disrupting training schedules, tourism, and the development of young talent, a decline in snow cover leading to, temperatures rising, climate change due to, threat the future of winter sports is."
    ],
    "https://www.reddit.com/r/collapse/comments/1iiz1ux/no_one_wants_war_everyone_wants_war_we_grow/": [
        "A future of conflict, inevitable it is, says the essay. \nInstitutions and safeguards, eroded they are, primal urges unleashed. \nA path of destruction, cyclical it is, warns the author. \nPre-WW1 era, a parallel drawn, it is. \nPoliticians, corporations, and autocrats, war's benefits they reap. \nNationalistic slogans, the masses united, they are.",
        "\"Inevitable in the near future, large-scale conflict is, due to primal male urges and the erosion of institutions that suppress them, it does, parallels with the pre-WW1 era, drawing, it does.\""
    ],
    "https://i.redd.it/2qvu02ot8rhe1.jpeg": [
        "\"A social media post, appears to be the article. \nTitle 'Silly Question…. Kinda', has. \nCategory 'economicCollapse', it is. \nContent, not provided, it is.\"",
        "\"A repetitive sequence of navigation options and a post title 'Silly Question…. Kinda' with a comment section, the article appears to be.\""
    ],
    "https://weblo.info/vanguard-announces-major-change-to-funds-and-etfs/": [
        "A celebration, Vanguard is. \n50th anniversary, marking it is. \nLargest round of fee reductions, announcing it is. \nMutual fund and ETF share classes, 168 across 87 funds, impacting it will. \nSave investors, $350 million, it will. \nCompetitive edge, reinforcing it is. \nPressure on competitors, putting it is. \nETF space, particularly, a challenge, it will be.",
        "\"Around $350 million, save investors will, this year expected to be.\""
    ],
    "https://electrek.co/2025/02/05/tesla-sales-dropped-60-in-germany/": [
        "A decline in sales, Tesla has. \nExpected to have a significant impact, it is. \nThe EV industry, particularly the US, affected it will. \nUp 53.5%, the battery-electric market was. \nDown just 2.8%, the German market was. \nCited as reasons, the new Model Y and Elon Musk's politics are. \nSpreads to other markets, if it does, a problem it will be. \nIn January 2025, compared to last year, a drop of 60% in Germany and 50% in Europe, there was.",
        "\"A year ago, same period, compared to, last year's sales, nearly 60% in Germany and 50.4% in Europe, dropped Tesla's sales have.\""
    ],
    "https://thenewsglobe.net/?p=8445": [
        "A trip to the supermarket, made JD Vance, the Republican vice presidential candidate. \n\nMocked online, he was, after a claim made, he did. \n\nA dozen eggs, more expensive, they were, due to Kamala Harris's policies, he said. \n\nBehind him, egg cartons, a lower price, they had, his son pointed out. \n\nCriticism and ridicule, sparked, they have, Vance's solution to inflation, questioned, it is.",
        "\"A sale, the store behind him had, pointed out by his son, it was.\""
    ],
    "https://www.reddit.com/gallery/1iiougf": [
        "A discussion about rebellion and resistance against the government, sparked a user posting a picture of the US flag flying upside down outside the Department of State, it did. \n\nMeaning a sign of distress, the flag's position may not necessarily be, suggested some users, they did. \n\nAction and accountability, called for others, citing government corruption, propaganda, and the erosion of freedoms, they did.",
        "\"A discussion about rebellion, resistance, and accountability sparked, a photo of a US flag flying upside down outside the Department of State shared by a Reddit user did.\""
    ],
    "https://v.redd.it/oivxqmjilhhe1": [
        "A small crowd and limited impact, described as underwhelming by some, it was. \nNationwide support, with 50 states participating, held the protests were.",
        "\"A nationwide turnout, with 50 US states protests held, were. Demonstrations effectiveness and future protests potential, on discussions sparking, were.\""
    ],
    "https://i.redd.it/d6gw7d8whdhe1.jpeg": [
        "A navigation menu for a website or app, appears to be the article. \nLog in, view posts, and access various sections, options to have. \n\"Economic Collapse\" and \"Outside the State Department\", sections various to access.",
        "Links and options various, with a news or social media platform for a navigation menu, appears the article to be."
    ],
    "https://www.reddit.com/r/climatechange/comments/1ij1iy8/ridiculous_observation_i_made/": [
        "A universe of emissions, significant, it is. \nDaily, 150,000 pounds of CO2, a result of idling cars, it could be. \nEquivalent to 14,000 gallons of fuel wasted, a staggering amount, it is. \nIdling cars, a widespread problem, it has become. \nParking lots, a haven for idling, they are. \nLawn mowing and military emissions, a concern, they are.",
        "Illegal, this practice should be, suggests a Reddit user, idling for extended periods, cars leave, agencies often do."
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ijjcf3/my_father_is_a_pierre_poilievre_fan_was_a_musk/": [
        "A transformation, conservative to progressive, his father's undergone, has he? \nWrong, being, a dislike of, his father's views driven by, are they? \nContent online, or media social, influenced by, his father has been, perhaps? \nSuccess, a desire for, and views conservative, his father's support for, cited by the son, is. \nMusk Elon, Trump Donald, and Poilievre Pierre, supported by his father, they are.",
        "\"A fan of conservative politicians, his father has become, lacking clear arguments or explanations, he is, ideologies of Pierre Poilievre, supporting now, a struggle to understand, the man is.\""
    ],
    "https://www.theguardian.com/us-news/2025/feb/04/doge-noaa-headquarters": [
        "A summary, rewritten in the style of Yoda, I shall:\n\nSpark concerns of downsizing, seeking access to IT systems, Doge reportedly did. \nBroken up and downsized, Noaa to be, Project 2025 claims. \nHarmful to US prosperity, climate science is, they say. \nDevastating impacts on coastal economies, jobs, and wildlife, cuts to Noaa could have, warned officials and groups. \nFull support of the agency, they call for.",
        "Concerns of downsizing and access to confidential information, sparking did it, headquarters of Noaa, entered reportedly did Doge, efficiency of government, department of Musk's Elon."
    ],
    "https://www.bbc.com/news/articles/cwyjk92w9k1o": [
        "A record warm January, the world had. \nBreaking the previous record, it did. \n0.1C, the margin of victory was. \nAccording to Copernicus, the European climate service, it said. \nA series of records, surprisingly large, there have been. \nSince mid-2023, the trend continues, it does. \n0.2C, above expectations, temperatures were. \nGreenhouse gases, the cause, scientists say. \nBut specifics, still unclear, they are. \nOcean heat and aerosols, factors, they may be.",
        "\"A record-breaking January 2025 was, the world's warmest on record, it was."
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1iilaof/venting_i_dont_know_what_else_to_do/": [
        "A world in chaos, the state of is uncertain, anxiety and feelings of, they share. \nSupport and advice, offering are others, in r/CollapseSupport community, the. \nMutual aid groups, find and credit accounts freeze, suggestions to, they make. \nOn autopilot, feel they are, resilient but trying to stay, greekowl78 is. \nStolen, identity and information possibly, feeling helpless and overwhelmed, they are.",
        "\"Stolen, their identity and information possibly was, overwhelmed and helpless, they feel, but solace, they find, in struggles similar, and protests growing, it is.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1ij101e/global_temperatures_jan_2025/": [
        "A warmest January globally, was January 2025. \nAbove the 1991-2020 average, 0.79°C was the increase. \nAbove the pre-industrial level, 1.75°C was the rise. \n13.23°C, the average ERA5 surface air temperature was.",
        "\"Above the 1991-2020 average for January, 0.79°C was the ERA5 surface air temperature, 13.23°C the average ERA5 surface air temperature for January 2025, was.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1iinqif/well_this_is_depressing_thoughtsus/": [
        "A PhD in atmospheric physics, pursue a data scientist is considering, but warned against it, they were, by old advisor. \n\nFunding issues and death threats against climate scientists, potential they are, in the US. \n\nSimilar concerns, others in the Reddit thread share, personal experiences and reality of the situation, citing they are. \n\nHyperbolic, the advisor's warning may not be, suggesting they are.",
        "\"A PhD in atmospheric physics, pursue a data scientist is considering, but disappear funding could, warns their old advisor, they are.\""
    ],
    "https://www.thetimes.com/uk/scotland/article/bird-numbers-soar-breeding-species-thrive-naturescot-h9b785tks?utm_source=reddit&utm_campaign=scotland&utm_medium=story&utm_content=branded": [
        "Thriving, are Scotland's breeding bird species, majority of them. \nYears 30 past, in, numbers of some species, over 500% rising, are. \nWoodland species, largest increase, seen have. \nChiffchaff, numbers up 1,428%, and great spotted woodpecker, numbers up 699%, are. \nDeclining, are some species, such as chaffinch and swift. \nFactors, unhygienic bird feeding areas and climate change, due to, are. \nUpland birds, largest declines, showing, are.",
        "\"Thriving, are the majority of Scotland's breeding bird species, a new report by NatureScot says, despite climate change, rising by over 500% in the past 30 years, some species' numbers have.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1iikynv/collapse_caught_me_at_worst_time_possible/": [
        "A post-apocalyptic world, in, contribute he can. \nSkills valuable, medical, in, he has. \nFarming or hunting, ways other, learn to, he can. \nDrop out, of school, he is considering. \nBut a friend, words of encouragement, offers. \nSituation deteriorating, country's, due to, he is struggling. \nHopelessness and anxiety, feelings of, with, he is. \nA medical student, 19-year-old, in Northern Turkey, is.",
        "Worth the effort, pursuing a medical degree is, question his future, he is, and right-wing parties' rise, the cause of his hopelessness and anxiety, it is."
    ],
    "https://www.reddit.com/r/collapse/comments/1iinpda/how_close_is_the_road_to_our_future_climate/": [
        "A future dystopian, like \"The Road\" movie, our current climate situation is close to, discusses the article. \n\nPredict major societal breaks and loss of human life, some users do. \nBy 2040 or 2050, a significant loss of human life and societal breaks, climate change and war will cause, they predict. \n\nIrreversible, the damage may be, some users suggest. \nHuman actions, such as deforestation, overfarming, and pollution, the consequences of, they cite. \nInterconnectedness of natural systems, a reason for the damage, it is.",
        "\"A future climate catastrophe, eerily prescient in depicting, are these novels, by 2040 or 2050, major societal breaks and loss of human life, predicting they are.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1iij6k7/my_first_post_here_i_just_need_to_vent/": [
        "A community, kindness and understanding from, seek she is. \nFamily and company, student loan, unsupported by, feeling she is. \nAnxious and scared, overwhelmed, her situation is. \nPending since March 2024, an application, income-based payment plan, she has. \nForgiven, her loans were not, and forbearance, out of, taken she was. \nStudent loan situation, overwhelming, become it has. \nMissKayisaTherapist, a woman, is.",
        "\"Abroad living, while struggling she is, system of loans US, navigate to cannot, increased unexpectedly, loans student her, support and understanding seek she does.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1iiihil/feeling_guilty_about_precollapse_aware_comforts/": [
        "A collapsing society in, live they are. \nDistractions in, comfort they seek, guilty they feel. \nComforts in, indulge they should, okay it is. \nSelf-care prioritize, breaks from anxiety take, survival a form of self-care it is.",
        "\"A collapsing society's reality, distractions from, comfort in, seeking, they are. Survival and mental well-being, essential for, breaks and self-care, taking, they must.\""
    ],
    "https://gml.noaa.gov/ccgg/trends/monthly.html": [
        "A summary, I shall provide, young Padawan:\n\nDaily updated, the data is. Interactive plots and full records, available it is. Pacific Ocean's mid-altitudes, representative of air at, \"background\" conditions defined are. 31 days, over 1.4 ppm, the growth rate is. February 6, at 428.60 ppm, the current CO2 levels are.",
        "\"A level of 428.60 ppm, daily average CO2 at Mauna Loa, Hawaii, as of February 6, 2025, is.\""
    ],
    "https://atmos.earth/climate-wins-are-happening-you-just-arent-hearing-about-them/": [
        "A summary, rewritten in the style of Yoda, I shall:\n\nWins for climate, happening worldwide, they are. Unreported, often they go. News cycle negative, despite it, victories there are. \n\nRuling in Scotland, a court made, oil and gas field consent, unlawfully granted, it was. \nCommitment to climate action, mayors worldwide, reaffirmed, they have. \nYouth climate activists, in Montana, a court case won, they did. \nRight to hold polluters accountable, defended, it was. \nVictories in courtrooms, key, ClientEarth and A Plastic Planet, earning, they are. \nPolluters accountable, for environmental impact, held, they are.",
        "Happening worldwide, climate victories are, including court rulings, local government commitments, and companies being held accountable for their environmental impact, they are."
    ],
    "https://www.reddit.com/r/climatechange/comments/1iikxou/can_the_epa_actually_go_away_under_this_presidency/": [
        "A summary, rewritten as Yoda, I shall:\n\nUncertain, the EPA's fate is, under current presidency. \nDismantled, it could be, without Congress' act, some users suggest. \nFunding and enforcement, refused, the President can. \nWeakened, the EPA will be, through understaffing and lack of leadership, the administration can. \nAbolished, it cannot be, without Congress' act, technically required, it is.",
        "\"A Congressional approval to dissolve, requiring the agency's official status does. Stand down, employees to tell and funds allocated to refuse, can the President.\""
    ],
    "https://www.nature.com/articles/d41586-025-00243-8?u": [
        "\"A consent to processing of personal data, users give, by optional cookies accepting. \nOutside the European Economic Area, to third parties, transfers there are, of personal data. \nFor advertising, personalization, and analysis, optional cookies used are. \nFunction and essential cookies, for the website, uses it does.\"",
        "\"A consenting to the processing of their personal data, users are, by accepting these cookies, with advertising and personalization, for optional cookies, and function, to essential cookies, for the website, uses it does.\""
    ],
    "https://thinkunthink.org/2025/02/05/irreversible-momentum-green-transition-wont-be-stopped-with-dan-esty/": [
        "A strong case for sustainability, remains it does. \nInvesting in green strategies, companies are, long-term success securing. \nIrreversible, the momentum for sustainability is, evidence, demand, and pressure mounting. \nDelay action, do not, warns Esty, decades lasting, most business investments are. \nPolitics short-term, business decisions dictate, should not, he says.",
        "Strong, the business case for sustainability remains, irreversible now is momentum for sustainability, success long-term securing, strategies green investing, companies are."
    ],
    "https://www.reddit.com/r/collapse/comments/1ii0ele/is_anyone_else_feeling_like_were_watching_the/": [
        "A slow-motion apocalypse, it is. \nNumb, distracted, or in denial, people are. \nEverywhere, cascade it will. \nLocal collapses, a series it is. \nComments, agree they do. \nPlanet suffers, it does. \nClimate change, the cause it is. \nSystem, people divided and in control, keep it does. \nWealthy, politics serve. \nPoor, economy rigged against. \nReal-time, world collapsing, feels the author.",
        "\"A collapse of institutions, economy, and values, slow-motion, experiencing society is, says the author.\""
    ],
    "https://www.reddit.com/r/collapse/comments/1iiuxnj/parallel_between_4th_century_flight_of_curiales/": [
        "A parallel between the modern off-grid movement and the 4th century flight of Curiales in the Roman Empire, discussed the article does.\nFinancial burdens, government control, and the desire for self-sufficiency, in their motivations and responses, similarities there are.\nThe Roman Empire and the modern off-grid movement, a connection there is.",
        "A parallel between the modern off-grid movement and the 4th-century flight of Curiales in the Roman Empire, discusses the article."
    ],
    "https://phys.org/news/2025-02-extreme-weather-australia.html": [
        "A new normal, the extreme weather is. \nCaused by humans, climate change is. \nWarming Australia and oceans, it is. \nUnnatural pace, the warming is. \nWeather patterns changed, they have. \nExtreme weather events, more frequent and intense, they will be. \nHotter and longer, heatwaves will get. \nIncrease, fire weather days will. \nMore intense, heavy rainfall and flash floods will be.",
        "\"Change climate caused by humans, normal new it is, likely due to which, heatwaves, flooding, and bushfires experiencing Australia is.\""
    ],
    "https://eos.org/research-spotlights/atmospheric-effects-of-hunga-tonga-eruption-lingered-for-years": [
        "A lasting impact on the climate in the Southern Hemisphere, had the 2022 Hunga Tonga eruption, found a new study. \nWarming caused by water vapors, outweighed by the cooling effect from volcanic aerosols, it was. \nDissipated by the end of 2023, most of the volcano's effects had. \nLess than 0.25 watt per square meter, a global decrease in radiative flux, over the 2-year period, there was.",
        "Dissipated by the end of 2023, had most of the volcano's effects, but caused by volcanic aerosols, a brief global cooling effect, with lingered for two years, the climate's effects, found a new study."
    ],
    "https://www.reddit.com/r/climatechange/comments/1ij2syi/need_help_in_collecting_data_for_a_research/": [
        "A research project on temperature rise, data for it, collect they are. \nThirty years, over, in Mumbai metropolitan region, cities of Mumbai, Thane, and Navi Mumbai, data for it, seek they do. \nUrban heat island effect, data related to it, also seek they do.",
        "\"A research project on the rate of rise in temperature in the Mumbai metropolitan region, data for collecting help is seeking a statistician.\""
    ],
    "https://www.youtube.com/live/d6wOjk2OCZQ?si=PxM_x_8cL_1ruUhA": [
        "A rise in global temperatures, recent, is. Driven by human activities, primarily, it is. Fossil fuels, burning, the cause, it makes. \nScientists, leading, a discussion, recent, had. Unexpected drivers, behind the rise, revealed, they did. \nCapitalism, end, to, some say. Slow, the climate system, to changes, it is. \nVital signs, update, the importance, it has. Past policies, impact, they do. \nHuman nature, change, impossible, some think. Economic models, influence, they do.",
        "Driven by human activities such as the burning of fossil fuels, primarily, by shifts in temperatures and weather patterns, long-term, change in climate, refers it does."
    ],
    "https://www.yahoo.com/news/us-just-experienced-coldest-january-150758928.html": [
        "A cold January, the US experienced. Since 2011, the coldest it was. -2.9°F, the average mean temperature preliminary is. Likely, the coldest January since 2011, it will be. Cooler than normal, 166 cities out of 191 were. Above normal, Fairbanks, Alaska's warmest city, 14.6°F was. February 10, the official numbers, NOAA will release.",
        "\"Colder than normal, 166 out of 191 cities were, and minus 2.9 F, the preliminary average mean temperature departure was.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1ihrmcx/how_the_fuck_do_i_get_out_of_this_ratrace/": [
        "A summary of the article, I shall provide, young Padawan:\n\n\"Escape the rat race, how to, sought the user. Frustrated with modern life, they were. Advice, they asked. Suggestions, others gave. Back, fight, they suggested. Resources, pool, to buy a summer camp, they said. Off-grid, work to move, they advised. Life, simplify, by cutting expenses, they said. Affordable land, find, they suggested. Co-op farms, join, they recommended.\"",
        "\"A rat race escape and mental health improvement, seek advice on, they do.\""
    ],
    "https://www.reddit.com/r/collapse/comments/1ii22w1/watching_america_fall_apart_in_real_time_as_a/": [
        "A terrifying and surreal experience, it is. From the outside, even, a Canadian is watching. Rolled back, rights are. Policies and economy, concerns they have. Slow destruction of an empire, witnessing they are.",
        "\"A collapse in real time, the US is, helpless, the Canadian feels, dismantled, economy, policies, and rights are, with little to no protests or resistance, mass, there are.\""
    ],
    "https://www.reddit.com/r/collapse/comments/1ii16t7/megathread_state_of_global_and_us_politics/": [
        "A video on YouTube, watch you must. \nA podcast about Curtis Yarvin, listen you can. \nThe CDC report, read you should. \nFentanyl to Schedule I, elevated it has been. \nEV infrastructure projects, funds refused they have. \nA megathread, created it has been. \nPolitics global and US, discussed it is.",
        "\"A republic collapse possible is, amidst problems with federal payments and EV infrastructure projects, funds disburse refusal a crisis constitutional potential facing the US is.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1iik4g5/should_i_get_my_masters_abroad_given_the_state_of/": [
        "A while out of the US, beneficial getting could be, suggests many users. \nPerks for students, like free meals and transport, EU, Germany, or Canada have, recommends some. \nPrivate schools only, apply to, or abroad, programs look into, a decision to make, they are. \nYale, Bloomberg, and UBC, apply to, interested they are. \nDisparities in environmental health, research to, a master's degree abroad, pursue they are. \nUS politics, a state of, current, due to, abroad, a degree to pursue, they are considering.",
        "\"Aboard a master's degree to pursue, considering is the user, politics of US, current state of, due to, in other countries or private schools, apply to, whether, advice seek, is.\""
    ],
    "https://www.reddit.com/r/collapse/comments/1iifke8/are_your_batteries_going_to_explode_a_quick_tour/": [
        "A fleet electric 100% by 2035, aims France to. Regulations environmental bypass potentially, and mining massive activities require would. Risks environmental, on the industry's impact fears sparking are. Recycling battery partial, requires water and chemicals large amounts, posing risks environmental. Released chemicals toxic and metals heavy, have explosions the. Practices recycling battery, concerns raised has France.",
        "\"A significant increase in battery-related fires and the potential for toxic pollution, citing a French Reddit user, risks and environmental concerns about battery recycling and mining in France, increasing demand for, there is.\""
    ],
    "https://tsakraklides.com/2025/02/05/in-the-age-of-infinite-consumer-choice-the-only-choice-is-collapse/": [
        "A summary, rewritten in the style of Yoda, I shall:\n\n\"An illusion, the choice is. Collapse, the only choice, it is. \nA litmus test, the US system is. Consequences of choice, it reveals. \nGlobal totalitarianism, the path is. \nResistance, through revolution, the way is. \nBut for the environment, fighting, not a priority, it is. \nHuman issues, the focus, they have.\"",
        "\"A fate to avoid, resistance and revolution are. Low political IQ and infinite consumer choice, collapse to due is.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1ihzg5q/is_there_any_good_news/": [
        "A dire warning, climate scientists issue: \n4.5C, the world will warm by, end of century, on track to be. \nToo late, it is, worst of climate change to stop, some say. \nHope, there is, glimmers of: \nSolar installations, growing they are. \nFossil fuels, in the UK, declining they are. \nElectric vehicles, adoption increasing, it is.",
        "\"A century's end by, 4.5C of warming experience the world will, drastic measures enough not be, consequences catastrophic prevent to.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1ijgj1j/help_me_understand_this/": [
        "A process natural, climate change is. Faster than usual, 500 times, it is happening. Gases greenhouse, into the atmosphere, we release. Stop it, we can.",
        "Met with skepticism and explanations, was trumpiszaddy, by other users, about rapid rate of current climate change caused by human activities, citing historical times when Earth survived and thrived despite extreme conditions, why climate change isn't a natural process, questioned."
    ],
    "https://www.reddit.com/r/climatechange/comments/1iiltr8/which_ssp_do_you_think_were_headed_for/": [
        "A path the world is headed for, likely, discuss users on r/climatechange. \nSSP3, low economic growth, high population growth, think some do. \nSSP4, high population growth, low economic growth in lower-income countries, more likely, believe others do.",
        "\"A world headed for SSP3 or SSP4, some think, due to factors of economic and population growth, they are.\""
    ],
    "https://phys.org/news/2025-02-degree-global-triple-area-earth.html": [
        "\"A half-degree rise in global warming, triple the area of Earth too hot for humans, will, warn scientists. \n\nFor healthy young adults, 6% of the landmass, uninhabitable, it will become. \nFor those over 60, 35%, uninhabitable, it will become. \n\nBy mid to late century, at current rates, 2°C above the preindustrial average, global warming will reach, it could.\"",
        "\"A half-degree rise in global warming, triple the area of Earth too hot for humans will, warn scientists that.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1ii8ztq/bryan_johnson_refused_to_sit_in_a_polluted_room/": [
        "A discussion sparked, it has. Poor air quality, a podcast host left, it did. In India, the problem is. Tolerate air pollution, people do, why, a question it raises. \n\nGrowth and pollution, a correlation high, it is. Technologies to abate pollution, affordable, they are. Contributing to the issue, they do, some say. \n\nFarmers in India, their fields burn, they do. Lack of financial support, a reason it is. Machinery to buy, they cannot.",
        "\"Pollution of air, risks it has, yet tolerate people do, a discussion it sparks.\""
    ],
    "https://www.theguardian.com/environment/2025/feb/04/climate-change-target-of-2c-is-dead-says-renowned-climate-scientist": [
        "\"A target of 2C, dead it is. Underestimated, the pace of global heating has been. More than thought, temperatures raised by cuts in pollution have. Greater risk of extreme weather and tipping points, there is.\"",
        "\"Dead\" is the international 2C target, says Prof James Hansen, renowned climate scientist, due to the pace of global heating being significantly underestimated, it is."
    ],
    "https://www.theguardian.com/environment/2025/feb/04/temperatures-at-north-pole-20c-above-average-and-beyond-ice-melting-point?CMP=Share_AndroidApp_Other": [
        "A concern, it is. \nRising temperatures, above freezing, they are. \nDisappear, the ice will, as long as temperatures keep rising, they do. \nLinked to a low-pressure system, it is. \nOver Iceland, a low-pressure system, there is. \nExtra-hot seas, in the north-east Atlantic, there are. \nTwenty degrees above average, temperatures have risen. \nThe first time, in two decades, the Arctic Ocean, ice-free, it will be.",
        "\"A first, lose its sea-ice cover the Arctic Ocean will, due to warming global rapid and temperatures mild unusually, decades two over the next, expect scientists do.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1ihcygm/it_all_feels_like_a_bad_dream/": [
        "A dire situation, dire it is. Uncertain, the future is. Catastrophe, inevitable it will be, some joke. \n\nInto US society, former Nazis reintegrated were. Labor, organized, in decline it was. Nazis, rise of, discussed they are. \n\nAnxiety and panic, personal experiences shared they have. Powerlessness, perceived, of US military and government, discussed it is. \n\nClimate change and fascism, crises global, faced they are. Hopelessness and despair, expressed they have.",
        "\"A world in despair, the current state of, due to feelings of hopelessness and overwhelm, express users on r/CollapseSupport subreddit, they do.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1iiag6t/fighting_climate_change_from_nepal_challenges/": [
        "A global stage, on, action stronger for climate, push can, nations developing smaller like Nepal, how, seek advice, host podcast a from Nepal is. \n\nLimited resources, despite, impact real make can, individuals how, and action stronger for climate, push can, nations developing smaller like Nepal, on global stage, a community r/climatechange, from, advice seek, host podcast a from Nepal is.",
        "\"A stage global the on action climate stronger for push can nations developing smaller like Nepal, advice seeking is host podcast a from Nepal.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1ihd8w8/i_cant_get_it_out_of_my_head/": [
        "A chaos into descending world, is the user from Europe feeling. Unpredictable, the consequences are. \n\nSupport and advice, offer others in the community. Limiting social media use, joining leftist organizations, and contacting leaders, they suggest.",
        "\"Affect the rest of the world, will not, think friends, they do."
    ],
    "https://www.youtube.com/watch?v=MF0spTMKCzw": [
        "A lowest level in 32 years, scores have fallen to, US reading test scores. \nAt a basic level, read to struggle, students are. \nConcerns about the education system, highlighting it does. \nEssential skills, equip children to, the country's ability to, questioned it is.",
        "\"A basic level, read at, struggling students are. Years 32, lowest level, scores have fallen to.\""
    ],
    "https://www.theguardian.com/environment/2025/feb/04/vehicle-tyres-found-to-be-biggest-source-of-nanoplastics-in-the-high-alps": [
        "A global assessment of nanoplastics, first, produce to scaling peaks, a pioneering project is. \nWinds by carried around the world, easily, particles can. \nLungs and bloodstream enter, can nanoplastics, which. \nHigh Alps in, pollution nanoplastic, biggest source, tyre wear of vehicle, found have mountaineers.",
        "Revealed, a pioneering project has. In the high Alps, nanoplastics biggest source of vehicle tyres found to be."
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1ihkff6/there_are_enemies_all_around_and_allies_are_too/": [
        "A collapse societal, comforts their give up unwilling, people are. Materialism and addiction, prevalent they are, a lack of support and solidarity, cited the user does.",
        "\"A lack of solidarity among people who claim to support progressive causes, and widespread corruption, due to inevitable collapse of society, it is.\""
    ],
    "https://www.independent.co.uk/news/world/americas/usa-cities-unlivable-climate-change-b2687239.html": [
        "A dire situation, the United States faces. \nChange climate, extreme weather challenges, it brings. \nSouthwest regions, oppressive heat, water shortages, and rising temperatures, experience. \nCities like Phoenix, Las Vegas, and Los Angeles, struggling, they are. \nHeatwaves, droughts, and decreased water supply, the effects, they are. \nUnchecked, these conditions become, unsustainable, they will. \nConsequences severe, for quality of life, mental health, and economy, they will be. \nAction immediate, experts emphasize. \nEmissions mitigate, and large-scale disasters prevent, they must. \nInaction's cost, far outweighs, the cost of taking steps, it does.",
        "\"A brink of uninhabitability, to push some areas, threatening is. Temperatures rising, water shortages, and heat oppressive, experiencing regions such as the Southwest, are.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1ii202h/mauna_loa_data_missing/": [
        "A summary, rewritten in the style of Yoda, I shall:\n\nDown, the Mauna Loa Observatory website is, due to maintenance, it is. \nScheduled at the NOAA David Skaggs Research Center, the maintenance was. \nBack online, it will be, once completed, the maintenance is. \nCut off, public access to data is, temporarily, it has. \nRelated to the new administration, it is not, speculation, there was.",
        "Back online once the maintenance is completed, expected to be, but down currently is the Mauna Loa Observatory website, which critical CO2 measurements provides."
    ],
    "https://youtu.be/d3RlT7qzAUE?si=jIB-l5bEQJFbN4iB": [
        "A post-apocalyptic future, imagines Ada, a new library employee, in the first episode of the series \"How to survive the apocalypse.\" \nEquipped to survive in such a world, we are, wonders Ada.",
        "\"A post-apocalyptic world in, survive we are not equipped, questions existential pressing, explores Ada, the series 'How to survive the apocalypse' about is.\""
    ],
    "https://www.theguardian.com/environment/2025/feb/04/temperatures-at-north-pole-20c-above-average-and-beyond-ice-melting-point": [
        "A concern, it is. \nRising temperatures, above freezing, they are. \nDisappear, the ice will, as long as temperatures keep rising, they do. \nLinked to a low-pressure system, it is. \nOver Iceland, a low-pressure system, there is. \nExtra-hot seas, in the north-east Atlantic, there are. \nTwenty degrees above average, temperatures have risen. \nThe first time, in two decades, the Arctic Ocean, ice-free, it will be.",
        "\"A first, lose its sea-ice cover the Arctic Ocean will, due to warming global rapid and temperatures mild unusually, decades two over the next, expect scientists do.\""
    ],
    "https://apnews.com/article/monarch-butterflies-threatened-winter-count-migration-8c9bff7c1f226d6837debb3c246387db": [
        "A low mark, second-lowest in nearly three decades, has the number of monarch butterflies spending the winter in the western United States dropped to. Factors contributing major, climate change, diminishing habitat, and pesticides, they are.",
        "\"A second-lowest mark in nearly three decades, to its lowest, the number of monarch butterflies spending the winter in the western United States has dropped, it has.\""
    ],
    "https://www.tandfonline.com/doi/full/10.1080/00139157.2025.2434494": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\nWarming, global, accelerated it has, 0.4°C (0.7°F) in two years, leaped it has. \nAverage, 12-month, +1.6°C, relative to 1880-1920, peaked it has. \nAerosol emissions, restriction, imposed in 2020, a major contributor, it is. \nSunlight, reflect, and cool, aerosols do, Earth's temperature, lower, they help. \nInformed, not well, the United Nations and public, about warming, they are. \nYears, few, high sea surface temperatures, and extremes, climate, will see, they will. \nStorms, powerful, and floods, increase, they will, in the future, ahead, they are.",
        "\"A restriction on aerosol emissions by ships, has enhanced global warming, it has."
    ],
    "https://www.reddit.com/r/climatechange/comments/1ihsr2h/i_need_advice_on_how_to_shut_my_boss_up/": [
        "A truth to accept, they may not be willing. \nConsequences uncomfortable, to avoid they wish. \nCognitive dissonance, a reason it may be. \nCherry-picked data, dismissed it is. \nA boss and CEO, climate change deny. \nFrustrated, the employee is. \nCommunicate effectively, they seek to.",
        "\"Futile, arguing with them may be, and best, sharing concise points and credible resources is.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1ihakif/i_cant_keep_going/": [
        "A sense of solidarity and support, offered they did. \nOvercoming adversity and finding community, shared personal experiences of they did. \nThe present moment, focus on it, they encouraged. \nSelf-care and standing up for themselves, practice they did. \nHope and resilience, messages of rallied the community with. \nDespair and hopelessness, feelings of a 17-year-old user expressed. \nScoliosis and societal collapse, personal struggles with and due to, expressed they were.",
        "\"A collapse societal fears due to, despair and hopelessness feelings with struggling is the user 17-year-old, action taking and community finding importance of, empowerment self and resilience messages with responding is the community.\""
    ],
    "https://www.yahoo.com/news/more-1-000-epa-employees-223852786.html": [
        "A summary, rewritten in the style of Yoda, I shall:\n\nDismissed immediately, over 1,000 EPA employees could be, a \"probationary/trial period\" status, they have. Less than a year of service, employees with, an email, they received. Terminate them immediately, without cause, the agency can, it states. Downsize the government, the administration's efforts, part of this move, are. Valid and follow proper procedure, dismissals, union representatives, ensure, they will.",
        "\"A push to downsize the government, amidst, there is. Immediately dismissed, could be, 1,000 EPA employees, over notified, have.\""
    ],
    "https://neuburger.substack.com/p/hottest-january-in-the-history-of": [
        "A summary, rewritten in the style of Yoda, I shall:\n\n**A dire warning, the article is**\n**Rising, global temperatures will continue to**\n**In recorded history, the hottest January, it has been**\n**Prepare, we must, for the consequences of climate change, now**\n**Under 50, with families, those who must prepare, they are**\n**Increase, the number of days above 100°F will, in hundreds of U.S. counties**",
        "\"Catastrophic climate events potentially leading to, rising temperatures continue expected are, history recorded in, January hottest a set has January 2025.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1ihwibj/where_are_you_planning_on_living/": [
        "\"Avoid the impacts of climate change, where to live in the US, a user seeks. Entirely escape the effects of climate change, impossible it is. Cooler areas, to move to, some suggest. Uppsala, Sweden, or northern Canada, specific locations, a few recommend. Affected by climate change, even these areas will be, others caution.\"",
        "\"Avoid the worst effects of climate change, to live in the US, where, a Reddit user is seeking advice.\""
    ],
    "https://www.reddit.com/r/collapse/comments/1ii0xwx/community_feedback_requested_poll_us_politics/": [
        "A summary, rewritten in the style of Yoda, I shall:\n\n\"A feedback, the community is seeking, on rules for U.S. Political Posts, the Moderation team is. Four options, they are considering: no restrictions, allowing, they are; or Tuesdays only, U.S. politics on, they will; or a megathread, weekly, for U.S. politics, they will create; or actions taken, significant, posts with, only, they will allow. Impact, the community is discussing, of U.S. politics, on the subreddit, it has. Attacks, personal, and debates, on what is \"collapse-worthy,\" the potential for, they are.\"",
        "\"A feedback from community, seeking the Moderation team of /r/collapse is, rules for U.S. Political Posts, their to consider they are.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1ih17n9/is_it_safe_to_travel_at_this_point/": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\n\"Concerns about the federal government and militants, air travel safety, users discuss. \nShake-ups at the FAA, staffing issues, exacerbated, they have. \nAgainst non-essential travel, some advise, while others, their experiences and concerns, share. \nOne-way tickets or safe locations, some suggest, to hunker down, they must.\"",
        "\"A pandemic COVID-19, and staffing issues air traffic controllers, concerns about the federal government, amidst, traveling by air, safety of, discussing are users on the r/CollapseSupport subreddit.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1ih5868/is_anyone_else_just_going_through_the_motions/": [
        "A world in collapse, the potential is. Mortality, they consider, and meaning in work, they struggle to find. Apathy and hopelessness, shared by many, they are. Decline of society, climate change, and erosion of services, contributing factors, they cite. Alone, they are not, in feelings of burnout and disconnection, they are. Through motions, just going, they feel.",
        "\"A sense of global collapse and impending doom, amidst, alone they are, feeling this way, wonders, and disconnected from their work, burnt out, is the employee.\""
    ],
    "https://www.cbc.ca/news/world/trump-tariffs-off-feb-4-analysis-1.7449651": [
        "A delay of 30 days, agreed to by President Trump, there is. Tariffs for Canada, proposed, but new reasons for imposing, discussed, he has. Dairy, auto parts, military spending, and banking regulations, targets, they are. A new economic deal, with Canada, negotiate, he wishes.",
        "\"A delay of 30 days, agreed to by President Trump, he has. Reinstating them, new reasons for, discussing already, he is.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1ih95ha/if_anyone_needs_to_vent_the_wasteland_is_open/": [
        "A post created, Vegetaman916 did. \nIn the r/CollapseSupport subreddit, a place for venting, it was. \nDirected to the r/WastelandByWednesday community, users were. \nFree to express themselves, they were, without judgment, as long as rules followed, they must. \nTwo rules, there were: a jerk, do not be, and on topic, stay, you must. \nResponses, several, there were. \nAppreciated, the space to share fears and anxieties, users did. \nThe current state of the world, a cause for concern, it is.",
        "\"A safe space created, r/WastelandByWednesday is, by a Reddit user, for fears of collapse and preparing for it, to vent and discuss, separate from r/CollapseSupport, it is.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1ii0qy0/what_are_my_options_as_a_person_on_a_forced/": [
        "A break in career, forced, due to visa dependent, in Pacific, a professional with experience in climate action and conservation, 5+ years, has. \n\nA position remote, in climate action, secure, advice on, seeking, they are. \n\nA degree online, in Energy Policy, considering, they are. \n\nSuggestions, others offer, in community, including data science and monitoring, environmental, focus on, they suggest. \n\nRelevant, in job market, stay, importance of, emphasize, they do. \n\nA challenging time, for sector of development, during, in, they are.",
        "\"A position remote in climate action space, secure a development professional on forced career break is seeking advice to.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1ihbxw2/whats_giving_you_hope_right_now/": [
        "A summary, rewritten in the style of Yoda, I shall:\n\nHope in uncertain times, there is. \nVolunteering for causes, some find motivation in. \nIndependence statewide, a goal it is. \nLoved ones, personal resilience, and small actions, hope for others bring. \nDespair and drastic change, a few desire. \nSkeptical of the situation, others remain.",
        "\"A potentially dystopian future, in the face of, hope and motivation, they share. Volunteering, finding joy in life, and a sustainable and green future, imagining, their sources of, it is.\""
    ],
    "https://www.youtube.com/watch?v=Lxfpgqn6NOo": [
        "Affecting communities, it is. Water supply issues, crop losses, and illness, they bring. Triggering ARD, rainwater is. Exposing rocks to rainwater, melting glaciers do. Not by mining or waste dumping, caused by ARD, it is. Orange, toxic, the streams and rivers have become. Clear blue, they once were.",
        "\"A disaster ongoing in North America there is, orange toxic to blue clear changing suddenly streams and rivers are, caused by permafrost and glaciers melting acid rock drainage it is.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1ihooik/what_caused_the_ice_age_and_for_it_to_melt/": [
        "A different crisis, the current climate is. \nDecades, in just thousands of years' worth of change, experiencing we are. \nPast changes, thousands of years took, but adapt unable, species and planetary systems are. \nViolent reorganizing, of them, leading to, it is. \nThe \"green Sahara\", a sign it is, of past changes, supported by. \nIncreased energy inputs, the West African Monsoon intensified, allowing it to bring moisture deep into the Sahara, it did. \nIce sheets and positive feedbacks, amplify cooling, leading to, they do. \nMilankovitch (orbital) forcing, the cause of the ice age, it is.",
        "\"A melting due to human-induced climate change, is. Change the amount of energy hitting high northern latitudes during the summer, which forcing (orbital) Milankovitch caused the ice age, was.\""
    ],
    "https://i.redd.it/z3l36nzit3he1.jpeg": [
        "A summary of oil reserves, discuss the article does. \nFiction from fact, separate to determine it must. \nAccurate amount of oil, produced still can be, methods of assessment different, compare it will.",
        "Fiction from fact, separate to compare, methods assessment different, reserves oil remaining discusses the article."
    ],
    "https://www.theguardian.com/us-news/2025/feb/03/republicans-lead-exposure-rules": [
        "A risk to tens of millions of people, there is. Contaminated water, they would drink. Future lead line replacements, prohibited they would be. Limits on lead, lowered they would not be.\n\nFeasible, the replacement initiative is not. $90bn, the cost would be. Harm to children and adults, a potential it is. Alarm, environmentalists have expressed.",
        "\"A future, lead line replacement in, never require, the government would, which in water, lead in, lower the limit on, and pipes lead, replace, rules requiring, the Biden administration's, repeal, attempting to, is the Trump administration and Congress Republicans.\""
    ],
    "https://www.nytimes.com/2025/02/03/opinion/home-values-insurance-climate.html?unlocked_article_code=1.uU4.iYe5.pb4T-hScX2pO&smid=re-nytopinion": [
        "A home owning, traditional notion of, upending potentially, will climate change. \nValues of property and affordability, threaten extreme weather events and rising temperatures, do. \nHomeownership in America, impact significantly, will climate change.",
        "\"A significant impact on American home ownership, climate change will, suggests new evidence.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1iguli2/where_do_we_go_from_here_realistically/": [
        "A lost cause, the US is, a user on Reddit's CollapseSupport community says. Forever altered, people's brains have, a better future, difficult to imagine, it is. \n\nSuggestions, others made, focus on the present, build local networks, and create resiliency, they did. A better future, imagine, through mutual aid, community building, and alternative visions, they can.",
        "\"A better future, through mutual aid and community building, imagine you must."
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1igtvqk/this_subreddit_is_not_the_place_for_explaining/": [
        "A safe space, provide the r/CollapseSupport subreddit does. Collapse societal and environmental, impacts psychological and physical, discuss and cope individuals can. Panic or fear, spread not, the community's rule strict is. Support and understanding, offer to members, it does. Small, the number of members is, relatively. Severe mental illness or suicidal ideation, best platform not, some users suggest.",
        "\"A space for support, r/CollapseSupport is, during collapse societal and environmental, times of.\""
    ],
    "https://kion546.com/health/cnn-health/2025/02/03/human-brain-samples-contained-a-spoons-worth-of-nanoplastics-study-says-2/": [
        "A rate of accumulation, 99.5% plastic to 0.5% brain tissue, the brain may be. \nPrior eight years, samples collected, a 50% increase, there is. \nA spoon standard, plastic, equivalent to, the brain samples contain. \nDementia, individuals with, higher levels of plastic, found, the study did. \nCauses the disease, plastic does not, necessarily mean, the researchers caution.",
        "\"A spoon of plastic, an entire standard one, equivalent to 4,800 micrograms per gram, in human brain samples found, a study new did.\""
    ],
    "https://earth.org/hotter-drier-and-more-flammable-new-study-finds-climate-change-played-a-role-in-la-fires/": [
        "A hotter, drier, and more flammable California, will get, without a faster transition away from fossil fuels, it will. \n\nMore likely, fire-prone conditions will become, if warming continues to increase, they will. \n\nA longer wildfire season and increased fire-prone conditions, the region's dry winter conditions have worsened, they have. \n\n35% more likely, hot, dry, and windy conditions are, making them, human-made warming has. \n\nConfirmed, a new study has, the recent LA fires, human-made warming played a significant role in, it did.",
        "\"A role significant, played warming made human, in fires LA recent, confirmed study new a, has.\""
    ],
    "https://naseba.sk/uncategorised/26111/shocking-climate-change-greenlands-pristine-lakes-transformed-into-brown-waters-in-just-months/": [
        "A threat to the planet's water systems, climate change poses. Effective combat, immediate action requires. Patterns of climate, global disruption may cause. Communities local, drinking water threatened is. Risks to health, water quality declines pose. Emitters of greenhouse gases, carbon sequesters become. Metals and carbon, thawing permafrost releases. Events weather, unprecedented in West Greenland occur.",
        "Disrupting global climate patterns, potentially, and distress environmental, highlighting, events weather unprecedented, due to turned brown, have lakes thousands in Greenland West."
    ],
    "https://www.theguardian.com/us-news/2025/feb/03/elon-musk-says-usaid-is-beyond-repair-and-he-is-working-to-shut-it-down": [
        "\"Aid humanitarian, programs worldwide, impact could this move. \nMillions of people, to, food, water, and medical assistance, providing those programs are. \nShut down, USAid should, agreed Trump. \nRepair beyond, USAid is, said Musk. \nGovernment federal, shrink efforts, to, Trump's, heading Musk is. \nUSAid, largest single donor, world's, the, is. \nShut down, USAid, working to, Musk stated.\"",
        "\"A beyond repair, USAid is, with Trump's support, shut down, Musk working to, he is.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1ih26ng/dont_do_anything_financially_rash_but_keep/": [
        "A collapse, times of, individuals will not save institutions, they will not. \nRecords, detailed, of financial transactions, maintain, you must. \nDecisions, financially rash, make, you should not, a crisis, times of. \nRules, six, for surviving an autocracy, by Gessen, Masha, follow, you must.",
        "\"A crisis, times of, during, decisions financial rash, making, against advises a user in the r/CollapseSupport subreddit, situation financial one's, of documentation detailed, maintain to recommending, instead.\""
    ],
    "https://arstechnica.com/science/2025/02/greenlands-glaciers-are-falling-apart-faster-than-expected/": [
        "Affect millions of people, it will. \nDisintegration of the Greenland Ice Sheet, faster it will be. \nLubrication between the base of the ice sheet and the bedrock, increase it will. \nFlow of ice, accelerate it will. \nForm in a warming world, more crevasses will. \nGrew significantly wider, they did. \nBetween 2016 and 2021, a time of growth it was. \nImages of the crevasses, 3D they were used. \nStudy, a new one it was. \nWidening faster than expected, crevasses are. \nDue to climate warming, a cause it is.",
        "Faster than expected, apart falling are Greenland's glaciers, due to melting snow and warming ocean temperatures, a new study shows."
    ],
    "https://www.reddit.com/r/climatechange/comments/1ihm3s9/opinions_about_society_and_the_environment/": [
        "**A Galactic Survey, Conducted by a Young Padawan**\n\n**Seeking Responses, Americans Aged 18 and Above, the PhD Student Does**\n\n**Around 8-10 Minutes, the Survey Takes, a Wide Range of Perspectives and Backgrounds, to Collect**\n\n**A Summary of Responses, in Comparison to Others, Participants Can Request, Once Data Collection is Complete, They Can**",
        "\"Aged 18 and above, Americans from, responses seeking is, and society and environment on opinions, a survey about conducting is, a PhD student from the University of Kent.\""
    ],
    "https://i.redd.it/de2wd7dlfuhe1.png": [
        "\"A path it is, collapse of the economy, a. Follows it, Musk and Donald's way, if. Bring it will, more money, for the wealthy, it. Has 2024, a budget of $238 billion, the.\"",
        "\"A way their, have Musk and Donald, if wealthy only, for $238 billion, a budget it will be.\""
    ],
    "https://i.redd.it/0c2zhsrxcuhe1.jpeg": [
        "\"A new name for the United States, give I would. \nDownfall, its, a sign of economic collapse, it is. \nNeeds, a new name, the United States, collapse economic, it does. \n'Galactic Ruin' or 'Nebula's Shadow', a fitting name, it would be.\"",
        "\"Liberty of Republic Galactic, be it shall, name new for States United, give it, I would.\""
    ],
    "https://i.redd.it/i3dnpcehguhe1.jpeg": [
        "Worry, you must not, young Padawan. \nThere is nothing to worry about. \nElon and Ken, a drink having are.",
        "Worry about nothing, it is, having a drink, Ken and Elon."
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikevu2/mtv_ridiculousness/": [
        "A call to action, it is. \nThe people, they are rising, against the system, they are. \nProtests, against Elon Musk, and the government, they are. \nPosts, many, there are. \nA community, it has, 263K members, strong, it is. \nInflation, deflation, and debt, the concerns, they are. \nEconomic collapse, a topic, it is. \nA show, ridiculousness, running 24/7, it is. \nA protest, it seems, is underway, in the galaxy far, far away.",
        "\"Running 24/7, Ridiculousness MTV is, a call out, it is, key low a protest.\""
    ],
    "https://www.goodmorningamerica.com/style/story/quiksilver-billabong-volcom-stores-closing-us-2025-118565355": [
        "A galaxy in decline, it is. \nShuttered, over 100 locations will be, across the country. \nDifficulties financial, due to inflation and changing spending habits, the cause is. \nIn 2025, closing stores, Quiksilver, Billabong, and Volcom are, in the US.",
        "\"A toll heavy, the economy global volatile and inflation, taken will have, stores Volcom, Billabong, and Quiksilver in US, closures many.\""
    ],
    "https://thehill.com/business/5133430-elon-musk-doge-staffer-racist-posts/": [
        "A summary, rewritten as Yoda, I shall:\n\nFired for racist comments, a staffer was. Bring back, Elon Musk will. Controversy surrounding the decision, there is. \n\nDismissed, the Archivist of the United States was. Lawsuits, over administration's policies, Trump faces. Labor Department systems and Treasury payment systems, access to, a concern, it is.",
        "Posts racist, for under fire staffer DOGE, bring back, says Musk he will."
    ],
    "https://www.theguardian.com/environment/2025/feb/03/levels-of-microplastics-in-human-brains-may-be-rapidly-rising-study-suggests?CMP=Share_iOSApp_Other": [
        "A rising trend in brain tissue contamination, found between 1997 and 2024, there is. \nIn brain samples from people with dementia, six times higher, the concentration was. \nLiver and kidney samples, microplastics also found, they were. \nA larger effort, to understand their impact, required it is. \nExponentially rising, the environmental presence of microplastics, a warning it gives.",
        "\"Rising rapidly, levels of microplastics in human brains may be, suggests a new study.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1igi9uw/having_an_actual_breakdown_tonight/": [
        "A foreign country, in, start over she must. Anxious, she is, about language new to learn and home and community to leave behind. Support and reassurance, from others, seek she does. \n\nHer husband's Mexican heritage and family ties, a reason to relocate, they are. A coup, potential, there is. The US, leave she may. Her 7-year-old daughter, with her, go she will.",
        "A safe haven, potential, family ties and Mexican heritage of her husband, citing, she is."
    ],
    "https://www.climatehubs.usda.gov/hubs/northwest/topic/what-are-climate-model-phases-and-scenarios": [
        "A summary, rewritten in the style of Yoda, I shall:\n\nWarming or cooling, lead to can, the change in radiative forcing, it does. Numbers associated with SSPs and RCPs, there are, expected change in radiative forcing, they represent. Futures possible, and changes in population, economic growth, and technological development, they represent. RCPs and SSPs, under which climate models are run, they are. CMIP6 and CMIP5, the most recent phases, they are. Evolved over time, climate models have, they have.",
        "\"A future climate changes, predict to, pathways (RCPs) and pathways (SSPs) socioeconomic shared, emissions gas greenhouse scenarios use, models climate, the fifth and sixth phases of project (CMIP) Coupled, explain the article.\""
    ],
    "https://livingresilience.net/joinus/?utm_source=emailoctopus&utm_medium=email&utm_campaign=Safe%20Circle%20Weekly%20Call%20Invitation%20for%205p-630p%20Pacific%20Time%2C%20Tuesday%2C%20February%204%2C%202025%20-%20SC": [
        "A summary, rewritten as Yoda, I shall:\n\n\"Earth and human systems, collapse of, facing individuals are. Support, resources, and practices, transformative, Living Resilience offers. Free to $50/month, membership levels range, they do. Events, courses, groups, and community resources, access to, varying, it offers.\"",
        "\"Through various membership levels and offerings, human-caused collapse of Earth and human systems facing people, transformative support, resources, and practices for Living Resilience offers.\""
    ],
    "https://uk.news.yahoo.com/trump-orders-usda-down-websites-220623223.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cucmVkZGl0LmNvbS8&guce_referrer_sig=AQAAAMdIC15wgsSeN81JxGPIZaKMnFQB6Qm3KrvX7PfMpbEWQWPPy0rzS4pOW8_C_F77Zg4rUHJF38iwvDTDKJRMrlbwgY2eQUJkoVJNi5S50W6e0l69ao5oTROWvrvFcp2qkjEPKYxuc9EMCVRyu3h-d7DJQevFkr3Txq8xWeU-dqMx": [
        "\"A service, provide cookies do. Usage measure and users authenticate, they help. \n\nAccept all, click you must. Personalized advertising and content, receive you will. \n\nReject all, click you must. Prevent personalized advertising and content, you can. \n\nCustomize choices, you can. Withdraw consent, you can. Settings and dashboard, links to them there are.\"",
        "\"A purpose of cookies, to store and access personal data for personalized advertising and content, and to measure usage, and authenticate users, and provide its sites and apps, it does.\""
    ],
    "https://www.msn.com/en-us/weather/topstories/farmers-in-crisis-as-staple-crops-become-increasingly-difficult-to-grow-it-used-to-be-you-had-guideposts/ar-AA1yi2KI?ocid=msedgntp&pc=DCTS&cvid=0096485a2bf04307af57001b1aba23cb&ei=12": [
        "A crisis of climate, the nation's food supply it impacts. \nDifficult to plan ahead, farmers are, with heat record-breaking and weather unpredictable. \nDisrupted, crop yields are, by droughts and wildfires. \nA need for action, there is, in absence of updated Farm Bill.",
        "Difficult to plan ahead, making it is. Disrupting crop yields and wildfires, droughts including, which are."
    ],
    "https://www.nytimes.com/2025/02/03/opinion/home-values-insurance-climate.html?unlocked_article_code=1.uE4.66rt.M9W9OfnvWlIK&smid=nytcore-ios-share&referringSource=articleShare": [
        "A home owning, traditional notion of, upending potentially, will climate change. \nValues of property and affordability, threaten extreme weather events and rising temperatures, do. \nHomeownership in America, impact significantly, will climate change.",
        "\"A significant impact on American home ownership, climate change will, suggests new evidence.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1igtf9v/lewins_equation/": [
        "A universe in collapse, we are facing. \nDisrupt this balance, collapse can. \nA function of person and environment, behavior is. \nNurture their own environments, individuals can. \nBehaviors change, to cope with collapse, they must. \nAgency, they have. \nSituation's drivers, understand, you must. \nAgency's limits, recognize, you must. \nPersonal anecdotes, shared, they were. \nAdvice on managing oneself, they gave. \nResilience and agency, in collapse's face, increase, you can.",
        "\"A function of a person and their environment, behavior is, states Lewin's equation which, discusses the article.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1ihbsi6/roast_my_idea_financing_for_energy_efficiency/": [
        "A platform for energy efficiency and solar installation projects, proposed it was. \n\nSimpler and cheaper access to capital, provide it aims. \n\nConcerns about returns for investors, risk of default, and disclosure on building details, raised they were. \n\nAccredited investors only, cater to it should, Regulation D following, not Regulation Crowdfunding rules.",
        "Complying with securities regulations and securing returns for investors, concerns raised were, but an alternate investment platform proposed, a user did."
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1igj4ap/its_really_hard_to_maintain_self_care_during_this/": [
        "A crisis, in the midst of, self-care maintain, struggling is CatPooedInMyShoe. \nDental issues, a soda addiction causes, and available, medical insurance and birth control, will be, a worry, they have. \nA dentist appointment, booked, they have, but self-destructive habits, a struggle, they are. \nOverwhelmed, by the situation, feeling, they are, hopeless, about the future, they seem.",
        "\"A personal crisis and societal collapse amidst, self-care maintain to struggles she does, dental health included, well-being prioritize and self-destructive habits overcome seek she does.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1iglloy/ever_go_through_a_rough_time_and_think_life_is/": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\nCope, some find, with videogames and loved ones, they spend time. \nThoughts suicidal, some express, overwhelmed, they feel, by world and lives, their. \nStruggles, they share, on r/CollapseSupport, users do.",
        "\"A world's state, hopeless and overwhelmed, feeling they are, support and coping mechanisms, share and offer, they do.\""
    ],
    "https://youtu.be/vW5EVNT--DA?si=Dz9iplEzeiKd4IXG": [
        "A \"library economy\" concept, discussed the article is. \nHuman flourishing and social connection, promoting it does. \nResources shared, communities have access to, they do. \nTools, clothing, and housing, among them are. \nNot new, this idea is. \nSimilar systems, some communities have implemented, they have. \nTool libraries and community workshops, among them are. \nEquipment borrowed, and expertise shared, members can. \nA sense of shared responsibility and care, fostering it does.",
        "A more equitable society and human flourishing promoting, communities resources share, housing, clothing, and tools, a \"library economy\" concept discusses the article."
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1igl3go/feeling_too_sick_to_eat/": [
        "A future, hopeless she feels, overwhelmed and despairing. \n\nIncome evaporate, it will, due to policies, a fear she has. \n\nScarcity of food, impending it is, a concern she shares. \n\nA Trump supporter, dismissive he is, her struggles ignored. \n\nDirty and despairing, she feels, his words a blow. \n\nSupport, solidarity, and words of encouragement, the community offers. \n\nChaos and uncertainty, amidst it, they share their struggles.",
        "\"A collapse of her country and loss of income potential, scared and hopeless she is, due to long Covid and disability.\""
    ],
    "https://podcasts.apple.com/us/podcast/the-ezra-klein-show/id1548604447?i=1000688157475": [
        "A different narrative than what he wants the public to see, reveals the latest episode of \"The Ezra Klein Show\". \nTwo weeks of Donald Trump's second term, the first, examines.",
        "\"A different narrative than what he wants the public to see, reveals a closer look at the first two weeks of Donald Trump's second term, it does.\""
    ],
    "https://tsakraklides.com/2025/01/15/the-biggest-oldest-economy-in-the-world-is-burning/": [
        "A summary, rewritten in the style of Yoda, I shall:\n\nExploited by human economies, the Earth's natural economy is. \nFor billions of years, around, the Earth's economy has been. \nResources such as water, food, and oxygen, allocate, the Earth's economy does. \nSustained by ecosystems and climate systems, it is. \nIn contrast, human economies, extractive and parasitic, they are. \nOutside resources from Nature, rely on, they do. \nThree key criteria, fail to meet, they do: \nA constantly negative balance sheet, a lack of output, and a reliance on debt and bailouts.",
        "\"A system immortal and sustainable, the Earth's natural economy is, unlike human economies, which from Nature outside resources dependent and parasitic are.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1ihr6fo/it_would_be_mass_catastrophe_to_quickly_go_back/": [
        "A problem, the rate of change is. \nCatastrophic, rapid return to pre-industrial levels would be. \nFailures of crops, die-offs of animals, suffering of humans, it would cause. \nUnprecedented, even a slower warming rate would be. \nAgree, others in the thread do.",
        "Destructive, not as would be, warming of a slower rate, would not be, itself the direction of change, rather than the rate of change, the main issue, is."
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1igfxqe/how_to_be_both_happy_and_well_informed/": [
        "A world of tyranny, abuse, and violence, filled with it is. \nHappy and well-informed, both be, one must. \nPeace and beauty, amidst chaos, experience one can. \nInnocent, all beings are, ultimately. \nTheir inner and outer worlds, expand knowledge of, readers must. \nA new light, beyond time and cause and effect, see the world, learn to.",
        "\"A contradiction apparent, with comfortable get to learning and world outer and inner of knowledge expand to sure making, happy and well-informed be to trick the.\""
    ],
    "https://liminalworld.substack.com/p/trump-lightning-rod-and-whipping": [
        "A distraction from the greater threat to democracy, a focus on Trump is. \nManipulated by unelected elements, a 78-year-old man with dementia, Trump is. \nA distraction from the real threats, the media and online commentators make. \nLooting of the US Treasury Payments System, a real threat, Elon Musk's actions are. \nBlindly blaming Trump, the media and online commentators do. \nA puppet for unelected rogue elements, Trump is. \nComic book villain or mastermind, Trump is portrayed as. \nWillfully ignorant, both the left and right are. \nAlarming events unfolding in the USA, the author addresses. \nA writing hiatus of 8 months, the author breaks.",
        "\"A puppet being manipulated by unelected rogue elements within the US government, in reality he is, when as a mastermind or villain framed, misled the US public is.\""
    ],
    "https://www.reddit.com/r/collapse/comments/1igmkh2/weekly_observations_what_signs_of_collapse_do_you/": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\nConcerns about an asteroid collision with Earth, there are. \nA massive drought in Central Europe, observed it has been. \nA false spring in North Georgia, USA, seen it has been. \nIn their regions, signs of collapse, users in the r/collapse community, sharing they are.",
        "\"A societal collapse, signs of, in their regions, users on r/collapse share, they do.\""
    ],
    "https://www.msn.com/en-us/news/world/donald-trump-declares-canada-will-cease-to-exist-without-us-help-and-must-join-as-the-51st-state/ar-AA1yhpfm?ocid=msedgntp&pc=DCTS&cvid=549098473b964effa8b890e4789921e0&ei=12": [
        "A trade war with Canada, sparked by Trump, has. Cease to exist, Canada will, without US subsidy, he suggests. The 51st US state, become, Canada should, he says. Tariffs on Canada, imposed, he has. Retaliated, Canada has, with its own levies. South Africans, White, through US refugee program, resettled, they will be. Discriminating against them, the South African government is, he accuses.",
        "\"A 51st US state, become if it doesn't receive US subsidies, Canada should, suggests Trump, President US.\""
    ],
    "https://bsky.app/profile/climatecasino.net/post/3lh732zw7zc2t": [
        "A record hot January, 2025 was. \nSince 1940, the hottest January, it is. \n120,000 years, the last time, it was. \n1.745°C above baseline, the temperature, it rose. \nPre-industrial era, 1850-1900, the baseline, it is.",
        "\"A record January, hottest on, 1940 since, it was. 120,000 years, last in, hottest January, this likely is.\""
    ],
    "https://www.reddit.com/r/collapse/comments/1iglob3/could_youtube_be_suppressing_yarvin_criticism/": [
        "A democracy in America, overthrow by oligarchs to be, fascist ideology of Curtis Yarvin, allegedly used they are. \nSuppressing a video critical, YouTube may be, says Electrical_Key8360, a Reddit user. \nObscure or fringe, make the video seem, Google, YouTube's owner, manipulating the count, may be. \nIncreased, the view count has not, despite popularity, the video's, a mystery it is.",
        "Downplay the video's significance, to downplay, manipulating the view count, Google may be, speculates the user, and low view count, despite its popularity, a video critical of Curtis Yarvin's fascist ideology, suppressing, YouTube may be."
    ],
    "https://www.brownfieldagnews.com/news/snow-drought-in-the-midwest/": [
        "Affecting the Midwest, a snow drought is. \n\nYears of record keeping, 138, in Iowa, one of its driest winters, experiencing it is. \n\nBelow average, 14-20 inches, snowfall, with. \n\nConcerned, Climatologist Justin Glisan is, about soil moisture for the 2025 growing season, he is. \n\nThrough February, wetter-than-normal conditions, chances of elevated, there are. \n\nWithin two weeks, snow to the region, potentially bringing, it will.",
        "\"Affecting the Midwest, a snow drought is. \n\nYears 138 in, one of its driest winters, Iowa experiencing is.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1ig1ypm/does_anyone_else_mentally_flirt_with/": [
        "A form of nihilism or death wish, accelerationism a criticism as is, some users said. Affected those who might be, empathy for expressed were. Thoughts and concerns shared, many users did. Later more suffering to avoid, now suffering might, idea that accelerationism is, mentally flirted with, one user did.",
        "\"A form of death wish or horrific thought experiment, condemning it others are, yet empathy for strugglers, some express they do.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1igb8im/credit_unions_or_cash_only/": [
        "A collapse economic potential for, prepare one must. \nManagement of money, a concern it is. \nRegulated by government, credit unions still are. \nBetter fees and options, they offer, a respondent says. \nCash for purchases, use one should. \nTracking and local businesses, support they will. \nA fund cash emergency, consider one must. \nRecords financial, in paper form keep, a third user advises.",
        "\"A collapse economic potential for prepare, how to, seeking advice are you, young one.\""
    ],
    "https://firststreet.org/research-library/property-prices-in-peril": [
        "A galaxy in turmoil, climate change is. \nDisrupting migration patterns, it is. \nRegional desirability reshaped, it has. \nHomeownership costs rising, they are. \nSevere weather exposure and insurance costs, a heavy burden they place. \nCommunities impacted, they will be. \nA complex landscape, it has become. \nTraditional location value drivers, with new climate realities, balance they must. \nPublic and private stakeholders, navigate this landscape, they must.",
        "\"A threat, the $50 trillion US residential real estate market is, due to climate-related risks, with $1.4 trillion reduction in unadjusted real estate value, estimated the 12th National Risk Assessment has.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1ifo1v0/upending_my_life_so_i_can_enjoy_the_world_before/": [
        "A collapse impending, consequences face they will. \nEnjoy life for 2-3 years, plan they do. \nUncertainty's grip, too dire it is. \nChildren have, not consider they will. \nThe world's future, uncertain it is. \nTravel and peace find, advice they offer. \nSupportive discussion, sparked it has.",
        "\"A drastic decision, making before proposing to their girlfriend, they should not, suggests a Reddit user.\""
    ],
    "https://on.ft.com/42yvl3Q": [
        "A prediction made by Vitol, it is. \nUntil 2040, at current levels, demand for oil will remain, it will.",
        "\"A current level, until at least 2040, remain expected to, demand oil is.\""
    ],
    "https://www.theweather.com/news/forecasts/it-will-feel-like-spring-for-most-of-the-country-during-the-first-week-of-february-even-as-snow-piles-up-in-the-rockies.html": [
        "\"A website, theweather.com, high-quality weather information provides. Cookies to accept, users must, personalized content and advertising to access. Reject cookies, users can, but general, non-personalized advertising only see they will. Data processing, uses the website, information to store and access, advertising to select, and profiles to create for personalized content.\"",
        "\"A weather website's privacy notice and cookie policy, discusses the article. Forecasts for the first week of February, provides, mild temperatures and record-breaking heat in some areas, predicting.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1ifz69v/im_fine_with_oil_tariffs/": [
        "Affect everyday people, disproportionately would tariffs on oil. \nMore targeted at producers, a carbon tax would be. \nInitiatives green, fund a carbon tax was intended to. \nCuts tax billionaire, go towards funding would money from oil tariffs. \nPredictable, a carbon tax is. \nDecisions investment, inform would a carbon tax. \nFuels fossil, burning more affordable make would dividend a carbon fee program.",
        "\"A necessary step towards reducing consumption, tariffs are seen as, by some. Increase prices for consumers, tariffs may, argue others.\""
    ],
    "https://www.bloomberg.com/news/articles/2025-01-28/climate-change-made-la-35-more-primed-to-burn-scientists-say?c": [
        "A new analysis by World Weather Attribution, made it so, 35% more likely wildfire conditions in Southern California were, in early January, than before the industrial era, climate change did.",
        "\"A 35% more likely wildfire condition, Southern California's made, than before the industrial era, change in climate, it was.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1igsjup/help_with_research_in_climate_change_and_effects/": [
        "\"A coastal area in Brazil, effects of sea level change over, research on, seeking is the student. \nGeology, graduation in, completed has the student. \nData sources additional, beyond sealevel.nasa.gov, looking for is the student.\"",
        "\"A coastal area in Brazil, over sea level change effects, research and data additional, seeking is the student, in Geology graduated.\""
    ],
    "https://www.reddit.com/r/collapse/comments/1ifvfri/last_week_in_collapse_january_26february_1_2025/": [
        "\"Away from midnight, 89 seconds now stand, ticked one second closer the Doomsday Clock has. \nFailed to address these threats, national leaders have, warns the Bulletin of Atomic Scientists. \nDestroy civilization, power to have, countries like the US, China, and Russia do.\"",
        "\"Away from midnight, 89 seconds now stand, ticked closer one second the Doomsday Clock, threats global and nuclear risk rising, change climate and other due.\""
    ],
    "https://www.nytimes.com/2025/02/01/us/politics/elon-musk-doge-federal-payments-system.html?nl=breaking-news&regi_id=121828619&segment_id=189906": [
        "A system of payments, access granted to Musk's team, it has. \nSpending of government, monitor and limit, they can. \nCourtesy of Secretary Bessent, the Treasury, it is.",
        "\"A system of payments, Treasury's, access granted to Musk's team, has been.\""
    ],
    "https://youtu.be/5RpPTRcz1no?feature=shared": [
        "\"A new administration, to their advantage shape, may be, say tech billionaires. \nMusk, Elon, Thiel, Peter, and Andreessen, Marc, discussed, the possibility of America destroying, some even are. \nTheir agenda, achieve, to, may be, the new administration using, they are.\"",
        "\"America destroy, potentially, their own agenda achieve, may be, billionaires tech, including Musk Elon and Thiel Peter, using the new administration, they are.\""
    ],
    "https://i.redd.it/sq97z5qxcmge1.png": [
        "Matter they do, readers, that they remember to. \nHarm self on media social, avoid they must. \nCare of oneself on media social, take they should.",
        "Harm self on social media, avoid you must."
    ],
    "https://www.alternet.org/amp/trump-california-water-2671047745": [
        "A \"very dangerous precedent\" sets, it does. Water resources \"throws away\", it does. Barriers physical and legal, prevent water from reaching Southern California, they do. Summer dry months, precious freshwater resources preserve, farmers must. 5.2 billion gallons, in three days, release, they plan. 1.6 billion gallons, already released, it has. Farmers scramble, they do. Water for them, no longer, it is.",
        "Into the ocean, flow the water will, to the ocean, leaving it, and harming farmers, potentially it will."
    ],
    "https://www.cbc.ca/news/politics/trump-tariffs-canada-february-1-1.7447829": [
        "A response to tariffs, Canada has. Goods American, $155 billion worth, tariffs of 25% will face, announced Trudeau, Prime Minister of Canada. \n\nTariffs on Canadian goods, imposed Trump, President of the US, had. Beer, wine, and spirits, clothing, and household appliances, included they were.",
        "\"A response to Trump's tariffs, Canadian goods on, 25% tariffs impose, Canada will, Trudeau announced, Prime Minister Justin.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1ikolqo/anyone_else_sad_about_the_recent_videos_uploaded/": [
        "A summary, rewritten as Yoda, I shall:\n\nSadness and outrage, among users of r/climatechange, sparked recent videos have. \nProfit over individual well-being, prioritizing the videos are, see they do. \nProgress towards renewable energy, undoing the videos are, a mistake, it is.",
        "\"A promotion of profit over renewable energy, perceived as, and a tone that sparks sadness and outrage, the videos have.\""
    ],
    "https://www.reddit.com/r/CollapseSupport/comments/1ikhhyr/book_recommendation_for_those_who_are_spiraling/": [
        "A place better, the world makes, a cause to dedicate oneself, suggested users did. \nGrounding techniques and poetry, resources other users shared, they did. \nBooks like \"How to Learn to be Brave\" and \"Man's Search for Meaning\", recommended they were. \nA book, \"Microjoys: Finding Hope (Especially) When Life is Not Okay\", shared a user, they did.",
        "\"Despair and hopelessness, cope with help it does, 'Microjoys: Finding Hope (Especially) When Life is Not Okay' book, recommends it, a user on Reddit does.\""
    ],
    "https://imghoster.co/en/U0yNniOFT7M8Gmd": [
        "A summary of the article, I shall create, young one. \n\nEffective in the digital age, visuals are, to boost online presence and brand identity, they can. Guides on how to use them, the article provides, formats and hosting, it covers. Engage audiences and convey messages, images on social media, can.",
        "\"A digital age in, images effectively use, guides on how to, and benefits of hosting images, highlighting it does."
    ],
    "https://www.reddit.com/r/collapse/comments/1ikmtqg/in_the_event_of_the_american_collapse_what_impact/": [
        "A global economic collapse, famine, and Chinese hegemony, predicted to be the result of American empire's collapse, it is. \nPower to China, intentionally ceded by the US, a user suggests. \nNew alliances, countries will seek, a proposal it is. \nAfrica, a rising power, may become, some propose.",
        "\"A global economic collapse, potentially leading to, transfer of global power to China, and a shift in global alliances, the collapse of the American empire is predicted to have.\""
    ],
    "https://www.reuters.com/graphics/GLOBAL-ENVIRONMENT/INSECT-APOCALYPSE/egpbykdxjvq/": [
        "A rate unprecedented, 2% per year, declining the global insect population is. \nChange the climate, use pesticides, deforestation, and light pollution artificial, human activities such as, due to, is. \nHealth of soil and pollination, essential for, and feeding birds, reptiles, and mammals, crucial to the environment, insects are. \nMillions more undiscovered, and 1.5 million documented, species of insects, over, are.",
        "\"A rate unprecedented of 2% per year, declining the global insect population is, due to human activities such as deforestation, pesticide use, artificial light pollution, and climate change.\""
    ],
    "https://i.redd.it/ddr94j7owwhe1.jpeg": [
        "A series of navigation menus and login prompts, appears to be the article. \nProvided to summarize, no actual content is.",
        "\"A menu navigation repetitive, with content actual no, appears the article to be, it does.\""
    ],
    "https://i.redd.it/j3sscbpjfvhe1.png": [
        "A social media post, appears to be the article. \nMenus navigation repetitive, with them is. \nLogic that, argue with can't. \nComments view to, call is.",
        "\"A social media post with repetitive navigation options and a statement 'Can't argue with that logic' appears to be the article, it does.\""
    ],
    "https://reviewdiv.com/senate-getting-1600-calls-a-minute-as-trump-musk-controversy-grows/": [
        "A flood of phone calls, overwhelming the US Senate is. \nMinute by minute, 1,600 calls, compared to 40, usual it is. \nTrump and Musk, controversy surrounding their latest moves, there is. \nMobilized, supporters have been, by progressive organizations. \n31,400 calls, to senators, in two weeks, Indivisible claims. \nOutcry, public, growing against the administration's policies, it is.",
        "\"A 40-fold increase from the usual 40 calls per minute, overwhelming 1,600 calls per minute, the US Senate is receiving, due to public outcry against former President Donald Trump's policies and Elon Musk's increasing influence, it is.\""
    ],
    "https://www.the-express.com/news/science/163003/climate-change-five-us-cities-uninsurable-2025": [
        "Affect devastating, climate change will on US housing market. \nValues in home, $1.47 trillion to diminish, over three decades next will. \nNationwide, premiums in insurance, 29.4% by 2055 to raise, climate disasters will. \nUnaffordable, by 2055, cities major in Sun Belt states, become will. \nMiami, Jacksonville, Tampa, New Orleans, Sacramento, cities these, unaffordable, by 2055, become will. \nRefugees climate, 55 million Americans, become will. \nMigrate climate, 5 million people, this year, expected to.",
        "\"A market for housing in the US, devastate climate change is projected to by 2055, with $1.47 trillion in home values to diminish and 55 million Americans to become climate refugees.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikfvy6/trump_moves_to_cancel_union_agreements/": [
        "A wake-up call, many are facing, losing pensions, early retirement, and solid wages, they will. Dislike unions, some members do, but now, the possibility of losing benefits, they see. Stunned, union members are, realizing how much they've benefited, they have. Agreements, recent union, cancel, Trump is taking action to.",
        "\"A relationship with unions, reevaluate they must, union members, forcing potentially is action taking Trump.\""
    ],
    "https://www.nytimes.com/2025/02/08/opinion/trump-power-surrender.html?unlocked_article_code=1.vU4.AegT.L8aQUoRhmI_N": [
        "\"A free account, with the article continue you can. Updated Terms of Sale, Terms of Service, and Privacy Policy, review encouraged you are.\"",
        "\"A granted access to an article from The Times, you have been.\""
    ],
    "https://www.msnbc.com/all-in/watch/elon-musk-says-department-of-education-no-longer-exists-231453765781": [
        "A summary, I shall create, in the ways of Yoda, I shall speak:\n\nGut the department, plans to, the Trump administration has. \nEliminate FEMA, or overhaul, plans to, Trump has. \nBirthright citizenship, an executive order on, Trump has issued. \nCriticism, facing, Trump is, for handling of issues, various, he is. \nFreeze funding, a plan to, Trump has. \nDepartment of Education, no longer exists, claims Elon Musk. \nPlans to discuss, Congresswoman Jahana Hayes and Michael Steele are.",
        "\"Eliminate or overhaul, plans to the Trump administration's are, concerns sparking, claims Elon Musk the Department of Education no longer exists.\""
    ],
    "https://phys.org/news/2025-02-arctic-meltdown-global.amp": [
        "A dire prediction, there is. \nBy 2100, 2.7 degrees Celsius warmer, the globe will be. \nExceeding the 1.5 degree threshold, it will in 2024. \nMelting at a rate four times faster, the Arctic is. \nGreenhouse gases released, warming accelerated, it has. \nFrozen surfaces melting, sea ice decline, permafrost thaw, and increased carbon emissions, the consequences are. \nAdjust their climate goals, policymakers must.",
        "\"A course to warm 2.7 degrees Celsius by 2100, on is Earth, despite pledges of Paris Agreement current, due to thawing of permafrost and melting of Arctic rapid.\""
    ],
    "https://www.reddit.com/r/collapse/comments/1iknt20/datingrelationshipsmarriage_and_collapse/": [
        "A partner, find you must. Collapse aware, be upfront you should. Like-minded, filter for you can. Compatibility, with one who respects, prioritize you must.",
        "\"A partner compatible find, views on the long-term future similar share, how to, a discussion sparking, collapse societal of awareness compartmentalize, to reveal or not, a user Reddit asks.\""
    ],
    "https://www.removepaywall.com/search?url=https://www.nytimes.com/2025/02/06/health/cdc-bird-flu-cats-people.html": [
        "A series of options for searching various archives, presents the article. \n\nClicked to access different archives, can each of the options. \n\nOption 5, Option 4, Option 3, Option 2, and Option 1, archives different, access to click.",
        "\"A list of options to search various archives, provides the article.\""
    ],
    "https://tsakraklides.com/2025/02/08/overshoot-deficit-disorder/": [
        "A downfall of civilization, lead to it will. \nWell-being of the planet, on humans' problems focused they are. \nOvershoot deficit disorder, a cause it is. \nForgotten, the climate crisis has been. \nIssues pressing, more than the climate crisis, there are.",
        "\"Collapse civilizational, in may, crisis attention catastrophic, leading to, overshadowed by other issues, forgotten and been, warns Tsakraklides George, the author.\""
    ],
    "https://i.redd.it/8a2xiiysmxhe1.png": [
        "\"A series of navigation actions on a website or app, appears to be the article. \nCollapse economic, related to content is. \nComments on a post, view repeatedly attempted, they have.\"",
        "\"A repetitive sequence of navigation actions on a website or app, appears to be the article, it does.\""
    ],
    "https://i.redd.it/tzn42grt1xhe1.png": [
        "A summary of the article, I shall provide. \n\nFascism's early warning signs, discussed the article does. \nBut actual content about the topic, the text does not contain.",
        "Fascism's early warning signs, discusses the article, it does."
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikmvjj/the_fdic_is_next/": [
        "A collapse of the FDIC, potential it is. \nThe economy, impact it will have. \nConcerns and suggestions, users share they do. \nProtect themselves, they must. \nCash out of the bank, get they must. \nPrecious metals, invest in they should. \nFood and supplies, stockpile they must. \nPast crises, they remember they do. \nSavings and Loan crisis, and 2008 crash, they mention they do. \nAccountability for bankers, lacking it is. \nFascism, a potential it is.",
        "\"A collapse of the FDIC, potential it is, discuss users on r/economicCollapse, they do.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikogce/wont_letting_so_many_go_from_their_job_cause/": [
        "A collapse economic, in the US, potential it is. \nLosses of jobs, widespread, and unemployment, a cycle vicious, lead to they will. \nStruggles of business, layoffs, and closures of small business, a result, they will be. \nNumbers of unemployment, manipulate, the government may be. \nA plan larger, the collapse economic, part of it is. \nA market of employer, create, and the class working, exploit, the plan may.",
        "A vicious cycle of business struggles, layoffs, and economic instability will lead to, unemployment and job losses widespread, concerns expressing many users are."
    ],
    "https://www.reddit.com/r/collapse/comments/1ikjcjs/2025_year_of_the_great_acceleration_fafo_edition/": [
        "A global event, significant, in 2025, a possibility, there is. \nMelt, arctic, unprecedented, and CO2, rising, a \"Blue Ocean Event\" or \"BOE\", it could be. \nTerrifying, absolutely, the rate of increase in CO2, is. \nIncreases, catastrophic, in temperature, it could lead to. \nCollapse, global civilization, a prediction, it is. \nEvents, past, cited, they are. \nHeatwave, 2012, and pandemic, Covid, 2020, a comparison, they make.",
        "\"A disaster impending, humanity's ability to mitigate, hopelessness expresses."
    ],
    "https://i.redd.it/gfz2cd196whe1.png": [
        "A humanitarian issue, mention it does. \nMenus navigation repeated, of a social media post, it appears to be.",
        "\"A humanitarian issue, about a repeated statement, and navigation options, a sequence of repetitive, appears the article to be.\""
    ],
    "https://www.military.com/daily-news/2025/02/08/trump-administration-throwing-more-pentagon-reporters-out-of-their-workspaces.html": [
        "A decision, made the administration has. Outlets friendly, in they will move. Newsmax and Daily Caller, in they will go. Outlets unfriendly, asked to leave they will be. CNN, Washington Post, and Politico, leave they must. Difficult for journalists, it will be. Unreasonable, the decision is. Hostile, the administration is.",
        "\"A move called 'unreasonable', the Pentagon Press Association has, replacing them with more friendly outlets, the Trump administration has, doubled the number of news organizations it is evicting from their workspaces at the Pentagon, it has.\""
    ],
    "https://i.redd.it/6qkrndpeouhe1.jpeg": [
        "A collapse economic, cause it to plan someone or something, is it? \nQuestioning a user, with concern and skepticism, a post social media is.",
        "\"A collapse economic, considered seriously being is, concern expresses the article.\""
    ],
    "https://i.redd.it/shimgbahuvhe1.png": [
        "A webpage or app interface, it is. \nMenus and login prompts, a series of navigation it suggests. \nContent to summarize, none to be found, there is.",
        "\"A repetitive navigation menu for a social media or news platform, appears to be the article.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikq40d/ideas_on_how_to_peacefully_protest_the_trump/": [
        "A discussion sparks, it does, with users sharing thoughts and opinions, they are. \nAgreeing and disagreeing, some are, with the idea of peaceful protesting, they do. \nA quick but deep recession, it could lead to, stopping consumer spending, it would. \nDoubt in Trump's leadership, create it would, a user suggests, peacefully protesting, he does.",
        "\"A recession create and doubt in Trump's leadership, could stopping unnecessary spending, peacefully protest the Trump Agenda, Americans can.\""
    ],
    "https://www.youtube.com/watch?v=jT5WjFLlSVo": [
        "A collection of videos, on various topics, the video features. \nTopics such as capitalism, climate change, technology, and politics, including are. \nA documentary on the \"Meaning\" industry of capitalism, included is. \nClimate change, think about how, a discussion on, included is. \nLaboratory Greece, a documentary on, reviewed is. \nChina in tech, the rise of, covered is. \nUS, the wealth transfer in, covered is. \nQuantum computing, the future of, covered is.",
        "\"A collection of documentaries, lectures, and discussions, on topics such as politics, technology, climate change, and capitalism, the video playlist appears to be.\""
    ],
    "https://www.cbsnews.com/news/trump-orders-u-s-refugee-resettlement-of-afrikaners/": [
        "A reversal of the sentence structure, I shall do:\n\nCiting alleged racial discrimination by the South African government, Trump's order is based. \nAid to South Africa, cuts off it does. \nThe country's government, by the South African government, White South Africans are being oppressed, Trump claims. \nDenial of any land confiscations or racially motivated discrimination, South Africa's there is. \nThrough the U.S. refugee program, resettlement of South Africans of European descent, prioritize government officials to do, directed by Trump he has.",
        "\"A program of refugees, through the U.S., prioritize government officials to directed has Trump, President.\""
    ],
    "https://www.reddit.com/r/collapse/comments/1ik2lf4/their_end_game/": [
        "A war for survival, the planet will be, \nimpending collapse, the billionaires prepare for, \nchaos, a parabolic increase, in 10 years, it will be. \nTheir own survival, they prioritize, \npower, over human life, they seek. \nStupidity, hubris, or power, the cause, it is, \nglobal thermonuclear war, a warning, some give.",
        "\"A collapse environmental impending, for power and wealth consolidate, preparing they are, planet saving up on, given up has the billionaire class global.\""
    ],
    "https://www.thedailybeast.com/senator-says-they-are-getting-1600-calls-a-minute-amid-donald-trump-and-elon-musk-chaos/?via=mobile&source=Reddit": [
        "\"A first three weeks in office, Trump's, chaos of, amid, in receiving, Senate is. Calls per minute, 1,600, around, receiving, is. Policies Trump's, against fight harder, Democrats to urge, Congress. Frustration and disgust, with new administration, expressing, constituents many.\"",
        "\"A minute a 1,600 calls slammed with being, office in first three weeks of Trump's Donald, chaos of amid, revealed has the senator Republican a.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1iknii5/correct_me_if_my_assumptions_are_wrong/": [
        "\"A copilot for compliance, AI-powered, build an user in r/climatechange is considering. Requirements ESG and environmental, complex increasingly, navigate help companies, it will. Experts in the field, advice seek, the user is.\"",
        "\"A copilot for compliance, AI-powered, build to help companies, the user in r/climatechange community is considering.\""
    ],
    "https://i.redd.it/y56o7yk8pxhe1.jpeg": [
        "A discussed, is the scenario hypothetical, where Musk and Trump control of government US, take they would. \nThe White House, USAID, and treasury department, included, are they.",
        "\"A takeover of key US institutions, hypothetically, by Trump and Musk, they would.\""
    ],
    "https://www.reddit.com/r/collapse/comments/1ik9k0d/if_the_internet_were_to_collapse_which_things/": [
        "A collapse of the internet, severely impacted several things would. \n\nBanking and payments, shopping, news, education, communication and social media, and entertainment, impacted severely would. \n\nDaily life, a significant disruption in, lead to would. \n\nEssential services, access to, struggling people would. \n\nInformed, stay, and with others connect, struggling people would.",
        "\"A collapse of the internet, would be, impacted things that include: banking and payments, shopping, news, education, communication and social media, power distribution, entertainment, and critical infrastructure.\""
    ],
    "https://www.military.com/daily-news/2025/02/03/national-security-veterans-risk-trump-effort-reshape-federal-workforce-experts-warn.html": [
        "A threat to national security, harm it could, \nveterans care and employment, in danger they are, \nfired at will, for loyalty insufficient, they can be, \nadministration's agenda, to, they must conform, \nexecutive order, by Trump, issued it was, \ncareer government employees, as policymakers, reclassified they have been, \nemployee unions and experts, warning they are,",
        "Harm national security, veterans care, and veterans employment, could stripping protections from civil servants, Trump's effort to reshape the federal workforce, President's, warn experts."
    ],
    "https://www.reddit.com/r/collapse/comments/1ikort8/postcollapse_society_what_chages_the_collapse/": [
        "A choice, come of age, citizens are given. \n\"Tekn\" or \"Thrill\", the path to choose, they must. \nScientists, technicians, and more, Tekns are. \nArtists, writers, and creative, Thrills are. \nDecisions complex, Tekns make. \nDaily life, Thrills regulate. \nPublic discussions, representative bodies, Thrills use. \nIn \"Fleeing Earth\", by François Bordes, the book is.",
        "\"A society post-apocalyptic, described in novel 'Fleeing Earth' is. Groups two into divided, citizens are: 'Thrill' (artists and commoners) and 'Tekn' (scientists and technicians), with life daily regulating, bodies representative and discussions public through, the latter does.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikg7v5/please_tell_me_how_bad_this_is_going_to_be/": [
        "\"A collapse economic, potential it is. Insane, not going to be, reassurance sought, the user is. \n\nControl what can, focus on, people should. Worst, plan for, they must. Health mental, take care of, they should. \n\nMedia social, limit intake, they recommend. News, once a day, look at, they suggest. Invest in themselves, they do.\"",
        "\"A collapse economic, potential, of anxiety it does, cope with uncertainty, how to, advice seek, the user does.\""
    ],
    "https://i.redd.it/6ppb16yeqxhe1.png": [
        "A $137,000 housing upgrade and a $50,000 emergency paint job, requested by Hegseth, responded to by Congressional members, they did. \nNot specified in the article, details of their response are.",
        "A $137,000 housing upgrade and a $50,000 emergency paint job, requested was."
    ],
    "https://imghoster.co/en/F2K4tq20Wml9QAk": [
        "A summary, rewritten as Yoda, I shall:\n\nEffective in conveying messages, images on social media are. Engage audiences, they can. Boost online presence and brand identity, with visuals, you can. \n\nCompress images, you must. Formats and hosting, understand, you should. Tips for visuals, in the digital age, I provide.",
        "\"A digital age in, images effectively use, guides on how to, and benefits of hosting images, highlighting it does."
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikgcjq/tesla_didnt_pay_a_single_dollar_in_federal_income/": [
        "A year ago, $2 billion in U.S. income, Tesla reported. \n$0 in federal income tax, paid they did not. \nThree years past, almost all federal income tax, avoided they have.",
        "\"A year ago, $2 billion in U.S. income, on $0 in federal income tax, reported Tesla.\""
    ],
    "https://theecologist.org/2025/feb/07/poverty-extreme-wealth": [
        "A summary, rewritten in the style of Yoda, I shall:\n\n**A Threat, Extreme Wealth is**\n**Collapse, Environmental, Fuelling it Does**\n**Short-term Profits, Prioritizing, and Resources Hoarding, the Cause is**\n**IPBES Report, Highlights the Connection, it Does**\n**Transforming Economic Systems, Critical it is**\n**Decline of Ecosystems, Reversing, the Goal is**\n**Extreme Wealth Line, a Concept, it is**\n**Society, Democracy, and Environment, Undermining, it Does**",
        "Built on the exploitation of people and nature, wealth and power unchecked to be, allows it."
    ],
    "https://www.reddit.com/r/collapse/comments/1iklqks/what_disasters_and_the_la_fires_have_shown_me/": [
        "A reflection, the author does, on fires of LA, recent, they are. \nHostility and insensitivity, shown by extremist groups, they have. \nOpportunity, it is, to promote their own beliefs, they seize. \nSelfishly, they act, rather than empathy and compassion, they show.",
        "\"A selfish and judgmental act, extremist groups use, disasters as excuse, they do.\""
    ],
    "https://www.reddit.com/r/AskCanada/comments/1ik8rt6/dear_us_citizens_i_am_terrified_for_you_please/": [
        "A plan to gain control over the country, there is. \nSuppressed from reporting on it, the media is. \nHome and property insurance, cancelled it will be. \nForeclosure and homelessness, widespread it will be. \nA warning from a user, there is. \nUS citizens, beware you must. \nBillionaires, land in the US, buying up they are. \nA larger plan, this is part of. \nIn the r/AskCanada community, the warning was made.",
        "\"Homeless, many Americans will be, foreclose on homes, eventually, and buy up land, they will, nationwide, insurance to cancel, planning, the government is.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikpa5x/purchase_silver/": [
        "A system monetary backed by gold and silver, revert to it will. \nDue to inflation hyper and debt repayment, value of dollar evaporate it will. \nExamples from Venezuela and Weimar Germany, cited he is. \nSafe-haven asset, silver purchasing, suggests he does. \nA house or food for a month, with a small amount of silver, buy you can.",
        "\"A crash economic, 1920s-style, heading for, the US is, warns a user on Reddit's r/economicCollapse.\""
    ],
    "https://www.reddit.com/gallery/1ikgrz9": [
        "A collapse economic, looming it is, warn some they do.\nSkepticism, express some, consequences of Trump's actions, discuss they do.\nInfrastructure IT, country's, impact on, a concern it is.",
        "\"A collapse economic impending, warning of others are, skepticism expressing some users, Musk's data collection and Trump's actions consequences potential of discussing community Reddit the is.\""
    ],
    "https://www.reddit.com/r/collapse/comments/1ik2bf1/is_there_a_single_website_that_clearly_explains/": [
        "A world in crisis, facing multiple catastrophes, explained clearly, a website seeks, the user does. \n\nAccessible to non-experts, a way, the user desires. \n\nRecommended, several websites are, by users, including Breaking Down: Collapse, The Great Simplification by Nate Hagens, Planet Critical, and the Collapse Wiki. \n\nArticles and flowcharts, on collapse and catastrophe, also recommended, they are.",
        "\"A website single that explains crises multiple facing the world, in way accessible and concise, clearly, seeking is the user Reddit.\""
    ],
    "https://www.reddit.com/r/collapse/comments/1ijvjxx/normies_seem_extremely_open_to_geo_engineering/": [
        "A certainty, geoengineering is, believe many on Reddit. Unilaterally or through governments, done it will be, some argue. Delay the inevitable, it will only, and problems underlying, not address, others say. New issues, potentially cause, it will, concerns they have.",
        "\"A delay the inevitable, only will it, and problems environmental, exacerbate it will, concerns despite, into the atmosphere, particulates spraying, propose some experts, a solution to climate change, geoengineering as, open to the idea, increasingly are people.\""
    ],
    "https://bbc.com/news/articles/cdd9p8g405no": [
        "A reversal of the sentence structure, I shall do:\n\n\"USAID, a valuable use of taxpayer money, not a, Trump had argued. \nLeave administrative, already placed on, 500 staff, reinstates, the order does. \nFebruary 14, until, in place, the order will remain. \nEmployees, harm irreparable, to, citing, the judge has. \nLeave paid, on, 2,200 workers, put, plan to, Trump's, blocked temporarily, a judge has.\"",
        "\"Suffer irreparable harm, the workers would, if intervene the court does not, a judge has temporarily blocked.\""
    ],
    "https://bsky.app/profile/baron333.bsky.social/post/3lhmibcet4c2o": [
        "A call for change and resistance, they are making. \nDestructive and self-serving, actions in power are seen as. \nCriticism and outrage, on social media expressed, they are. \nPower in those who are, criticized, they are.",
        "\"A kleptocracy, their country is like, say they do. In power, those who act with corruption, criticized they are.\""
    ],
    "https://v.redd.it/w08w3ii3sxhe1": [
        "A summary of the article, I shall create, young one. \n\nEffects on society, the economic collapse has. \nShare their opinions and experiences, users on the r/economicCollapse subreddit do. \nAgainst government agencies and corporations, protests and demonstrations, there are. \nThe financial system, debt, and economic instability, topics of discussion, they are. \nTyranny of democracy, a topic, it is.",
        "\"A collapse economic, related topics various discusses the article, injustices perceived to resistance and frustration expressing many users, commentary social and actions government with protests including.\""
    ],
    "https://bizfeed.site/homebuyers-are-starting-to-revolt-over-steep-prices-across-us/": [
        "A decline in sales, the US housing market is experiencing. Due to high mortgage rates and stagnant inventory, a decline in sales, it is. Rise in listings, there is, yet hesitant to enter the market, buyers are. Decrease in contract signings and surge in price reductions, a result, it is. Cutting asking prices, sellers are. Cooling down, the Sun Belt is. High prices, a reason, they are. Recovering, Seattle and San Francisco are. Previous corrections, they are overcoming.",
        "\"A rise in inventory and decline in sales, experiencing the US housing market is."
    ],
    "https://www.reddit.com/r/blackmen/comments/1ikcy84/nazi_freaks_out_because_he_couldnt_intimate_a_bad/": [
        "A fascist intimidation, see as they do, users in r/blackmen community do. \nOutrage, many express, and self-defense, call for they do. \nA black man, intimidate not, a white man could not. \nA video, posted by NewNollywood, it was.",
        "\"Perceived fascist threats, against themselves arm, some users are calling, and self-defense, for, a video of a white man, discussing, a group of Black men on Reddit are.\""
    ],
    "https://www.mpamag.com/us/mortgage-industry/market-updates/fha-and-va-loan-delinquencies-increasing-at-a-faster-pace-mba/523889": [
        "A summary, rewritten in the style of Yoda, I shall:\n\nWidened, the gap between FHA and conventional delinquency rates did, to 841 basis points. \nIncreasing, VA loans were, 12 basis points to 4.70%. \nSurged, FHA loans did, 57 basis points to 11.03%. \nRise, the overall delinquency rate did, to 3.98%. \nIncreases, government-backed loans showed, particularly FHA and VA mortgages. \nFourth quarter of 2024, mortgage delinquency rates rose, they did.",
        "\"A steep increase, FHA and VA mortgages, particularly government-backed loans, showed, did they."
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikow9n/tariffs_taxes/": [
        "A destruction own their to avoid, understand Americans should, posted TurboFX98 a user named. \n\nTariffs Trump's are, taxes on items everyday such as food, clothes, and electronics, essentially.",
        "\"A concept of tariffs, not fully understood by Americans, they may, suggests a user on the r/economicCollapse subreddit.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikfjoj/lets_discuss_the_end_game_of_a_scenario_involving/": [
        "A recession massive, causes the regime, does. \nLiberties civil, erode, they will. \nHomelessness widespread, becomes, it will. \nChurches local, informants, serve, they do. \nA scenario hypothetical, discusses, the user does.",
        "A recession massive, cause may a theocracy authoritarian AI-assisted hypothetical, leading to homelessness widespread and liberties civil erosion, norms societal conform to buy, work, and refuse collective, prompt it will."
    ],
    "https://www.military.com/daily-news/2025/02/07/trump-promotes-conspiracy-theory-about-federal-governments-media-subscriptions.html": [
        "A \"biggest scandal of them all\" it is, Trump labels. \nFor subscriptions or content licensing, payments to news outlets end, he calls for. \nCriticism of Politico, The New York Times, and NPR, Trump has. \nConcerned, free press advocates are, about Voice of America's future. \nGuarantees editorial freedom, its charter does.",
        "\"A scandal biggest of them all, it is, claims his with no evidence, he makes.\""
    ],
    "https://www.reddit.com/r/climatechange/comments/1ikikkq/why_should_we_be_concerned_with_global_warming/": [
        "A naturally occurring event, global warming is. Concerned, we should be, or not, hmm? \n\nFast, the current rate of warming is. Man-made, the cause is, some say. Human activities, the blame is on. Severe, the consequences are. Weather extreme, and animals in danger, they are.",
        "\"A naturally occurring event, global warming is, concerned humans should be, why, asks Dragosfgv, a Reddit user.\""
    ],
    "https://maralagofacistclub.com/": [
        "A professional email address with domain @yourbusiness.com, offers the Mara Lago Fascist Club website. \nUpdates and promotions, for their email list, sign up users can.",
        "\"A professional email address offers, and updates and promotions sign up for, allows the Mara Lago Fascist Club website.\""
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikk5px/when_is_enough_enough/": [
        "A global economic collapse, lead to by US takeover of Canada, warned a Canadian user, they did. \nAction best, preparing for collapse is, suggested another user, they did. \nProtect the people, the military is not there to, stated one user, with skepticism, others responded. \nA coup and collapse, potential for, cited a class war, the user did. \nCollapse of US economy, concerns expressed, a user on Reddit did.",
        "A coup's potential and authoritarianism's rise, concerns express some users do."
    ],
    "https://www.reddit.com/r/economicCollapse/comments/1ikgtp6/tech_overthrow/": [
        "A takeover technological, potential for there is. Collapse economic, discussed the article does. Influence AI's, increasing it is. Trust in media social, erosion of it there is. \n\nTopics various, on share and articles users do. Instability economic, related to they are. Inflation, debt, and actions government, discussed the users do. Outrage and frustration, at injustices perceived and corruption, expressed the users do.",
        "A takeover technological, collapse economic, potential for discusses the article, it does."
    ],
    "https://tsakraklides.com/2025/02/02/the-extinction-tariff/": [
        "A threat existential, the climate crisis is. \nExtinction, humanity's own, will lead to, a parasitic relationship it has. \nCollapse, the human economy is, due to climate-related issues, it is. \nTariffs, the Earth imposes, on human exports, such as pollution, destruction, and extinction, it does. \nA war economic, between humanity and the Earth, described in the article, it is.",
        "\"A war economic between humanity and the Earth, describes the article \"The Extinction Tariff\" by George Tsakraklides, it does.\""
    ],
    "https://www.hindustantimes.com/environment/weather-bee-january-2025-all-set-to-be-the-warmest-january-month-on-record-101738413156289.html": [
        "A referendum on Kejriwal, not Modi's policies, a statement from Congress, it is. \nLost, the AAP has, while gained, the BJP vote share, it did. \nWarmest January on record, India is set to experience, it will. \nAbove pre-industrial levels, a 1.75°C average temperature increase, there is.",
        "\"A record hottest January, on track to be, 2025 is.\""
    ]
}