{
    "https://www.theguardian.com/us-news/2025/feb/03/republicans-lead-exposure-rules": [
        "(Scene: A congressional hearing room. A Republican congressman, JIM, is speaking.)\n\nJIM: So, we're trying to repeal this rule about lead pipes, right?\n\n(Dramatic pause. The audience laughs awkwardly.)\n\nJIM: (confused) What's so funny?\n\nLAUREN (a Democratic congresswoman): (laughing) I think it's just... (pauses) never mind.\n\nJIM: (defensively) Okay, so we're trying to repeal this rule. And the Trump administration is on board.\n\n(Dramatic music plays in the background.)\n\nJIM: (dramatically) But the Biden administration says we have to replace all these lead pipes. And lower the lead limit in water.\n\nLAUREN: (sarcastically) Oh, yeah. Because that's not a big deal at all. (rolls her eyes)\n\nJIM: (ignoring her sarcasm) And the industry lobbyists say it's going to cost $90 billion.\n\nLAUREN: (dramatically) $90 billion! That's a lot of money!\n\nJIM: (smugly) Yeah, I know. But we have to think about the economy.\n\nLAUREN: (outraged) The economy? You're talking about people's health!\n\n(Dramatic music swells. The audience laughs awkwardly.)\n\nJIM: (defensively) I'm just trying to do what's best for the country.\n\nLAUREN: (exasperated) By putting tens of millions of people at risk of drinking contaminated water?\n\nJIM: (sheepishly) Well... maybe we should just... (pauses) I don't know.\n\n(Awkward laughter from the audience.)\n\nLAUREN: (dramatically) This is a disaster waiting to happen!\n\n(Dramatic music reaches a crescendo. The audience laughs awkwardly.)\n\n(Curtains close.)",
        "(Scene: A congressional hearing room. A confused Republican congressman, Bob, is standing at a podium.)\n\nBob: So, uh, we're trying to, you know, repeal this thing... (pauses for comedic effect)...about lead pipes?\n\n(Laugh track)\n\nBob: Yeah, because, you know, lead is, like, totally fine in our water, right? (nervously chuckles)\n\n(Laugh track)\n\nBob: I mean, who needs clean water, anyway? (dramatic pause) Am I right, folks? (looks around awkwardly)\n\n(Laugh track)\n\nBob: So, we're trying to get rid of this rule that says we have to replace all the lead pipes. (pauses again) Because, you know, that's just too expensive. (shrugs)\n\n(Laugh track)\n\nBob: And, uh, we're also trying to lower the limit on lead in water. (pauses once more) Yeah, because a little bit of lead is, like, totally healthy for you, right? (nervously laughs again)\n\n(Laugh track)\n\nBob: So, that's it. That's our plan. (pauses for comedic effect) We're just, you know, trying to make America great again... with lead pipes! (laughs awkwardly)\n\n(Laugh track)\n\nAnnouncer (voiceover): And that's the latest from Congress! Stay tuned for more breaking news... and more lead pipes! (dramatic music plays)"
    ]
}